{"RevBlackNetwork": ["“There have also been hundreds of Greens elected across the nation, from state legislatures & mayors down to local zoning boards.”\n\nYou can criticize the Green Party without LYING. They have built power, especially locally as Democrats sued them & establishment runs neg coverage!", "Define socialism & tell us how that applies to USLook up fascism while you’re at itandask Grok, which you’re using to build your AI, how the merger of corporate (that’s you)andstate power (ppl who contract you) suppresses the rights of workers through a police state", "Seems like the censorshipandmass surveillance is really ramping up. Sorry comrades!", "DNC: No primary\n\nLibs: we need Biden\n\nDNC: Genocide\n\nLibs: must save democracy \n\nDNC: No policy\n\nLibs: vibes are lit\n\nDNC: More wars & genocide\n\nLibs: but at least no fracking\n\nDNC: Record fracking\n\nLibs: no kids in cages\n\nDNC: Better cages\n\nLibs: legalize weed?\n\nDNC: No or Trump", "It’s devastating to watch those who were radicals simp for our oppressors. But it’s an old cautionary tale we must learn. We hold space for the work Angela Davis contributed to the movement in her youth but it has been clear for a long time that she chose conformity & submission.", "“There have also been hundreds of Greens elected across the nation, from state legislatures & mayors down to local zoning boards.”\n\nYou can criticize the Green Party without LYING. They have built power, especially locally as Democrats sued them & establishment runs neg coverage!", "DNC: No primary\n\nLibs: we need Biden\n\nDNC:GenocideLibs: must save democracy \n\nDNC: No policy\n\nLibs: vibes are lit\n\nDNC: More wars &genocideLibs: but at least no fracking\n\nDNC: Record fracking\n\nLibs: no kids in cages\n\nDNC: Better cages\n\nLibs: legalize weed?\n\nDNC: No or Trump", "Bombala Harris is a spoiler in this election", "Will fall to tyranny?\n\nWe have mass surveillance & censorship\n\nWe have cops murdering 3 ppl per day\n\nWe have corporations dictating policy\n\nWe have 20% of world’s prison population\n\nWe have skyrocketing inflation & stagnant wages\n\nWe have asset forfeiture for ppl never convicted", "It’s devastating to watch those who were radicals simp for our oppressors. But it’s an old cautionary tale we must learn. We hold space for the work Angela Davis contributed to the movement in her youth but it has been clear for a long time that she chose conformity & submission."], "TheDemocrats": ["One of Governor@Tim_Walz’s biggest accomplishments is getting free school meals for students in Minnesota.\n\nThe picture speaks for itself.", "In the aftermath of last night’s mass shooting in Lewiston, Maine, we mourn for those who have lost loved ones.\n\nWe are praying for the safety of everyone in Maine as they continue to search for the gunman.", "When@KamalaHarrisand@Tim_Walzare elected, they will pass universal background checksandan assault weapons ban to end the gun violence epidemic in America.", "On Missing or Murdered Indigenous Persons Awareness Day, we acknowledge the tragic injustices NativeandIndigenous communities have faced.\n\nDemocrats are working across jurisdictions to stop this cycle of violenceandprovide communities with the resources necessary to keep", "Eleven years ago, we lost 20 studentsand6 staff members at Sandy Hook Elementary School. We honor the memories of the lives lost in this tragedyandwill not rest in our fight to pass gun safety reforms. Every child deserves to feel safe in school.", "For too long, junk fees have caught Americans by surprise.\n\nPresident@JoeBidenis taking on price gouging by:Cutting credit cardandoverdraft feesRequiring companies to tell you the total price upfrontCracking down on surprise rental fees", "On Pearl Harbor Remembrance Day, we honor the American service members and civilians who lost their lives 82 years ago today. We will never forget the sacrifices they made to safeguard our freedoms.", "In total, the Biden-Harris administration has fought to cancel $137 billion in student loan debt and deliver relief for over 3.7 million Americans.\n\nThat’s a big deal.", "HAPPENING NOW: Vice President@KamalaHarrisis in Arizona, just days after the state Supreme Court upheld an abortion ban from 1864.\n\nTune in as she rallies voters in the fight for reproductive freedoms.https://x.com/i/broadcasts/1/i/broadcasts/1yNGaZVQrwdJj…", "Adding to the list of Biden-Harris wins, the Biden-Harris administration is…Pardoning thousands of LGBTQ+ veterans who were wrongfully punished by a discriminatory policyAnnouncing 148 new infrastructure grants across the country\n\nDemocrats show up for Americans.", "Today marks two years since 19 children and two teachers lost their lives in a mass shooting at Robb Elementary School in Uvalde, Texas.\n\nOur children and teachers deserve better—we owe them action to end gun violence for good.", "In case you needed more reasons that Trump-Vance’s Project 2025 is truly a nightmare:Reinstating and expanding Trump’s racist Muslim banArming teachersBanning transgender Americans from serving in the militaryDismantling the Department of Education", "“At this moment in history, I say, let us not throw up our hands when it’s time to roll up our sleeves.” —Vice President@KamalaHarris", ".@KamalaHarrisand@Tim_Walzwill fight for America’s future:Fighting for paid leaveWorking to end gun violenceProtecting reproductive freedomFighting for affordable health care and child care", "Command sergeant major.\nPublic school teacher.\nState championship football coach.\nGay-straight alliance faculty advisor.\nCongressman who flipped a red seat.\nGovernor who got free school meals for Minnesota kids.@KamalaHarrishas made her choice: Gov.@Tim_Walzis the real deal."], "msnbc": ["President Biden calls Hamas terrorist attacks “sheer evil”andvows “we stand withIsrael” as 14 Americans killed. \n\n\"There are moments in this life... when the pure, unadulterated evil is unleashed on this world. The people ofIsraellived through one such moment this weekend.\"", "BREAKING:Israelcarries out \"targeted strike\" in Beirut.@KeirSimmonshas the latest.", "Lawmakers were told at a  briefing tonight there had been four American fatalities as a result of the Hamas attacks inIsrael, a number they were told is expected to rise.", "BREAKING: Israeli military strikes Hezbollah as Nasrallah responds to wave of device blasts in Lebanon.", "BREAKING: State Department confirms at least 22 Americans killed inIsrael", "The death toll for Americans from Hamas' terror attack onIsraelandthe subsequent war now stands at 30, per State Department spokesperson. 13 Americans are missing.", "BREAKING:  Two American hostages held byHamashave been released and are back in Israel.  The two women released, Natalie and Judith Raanan, are members of former NBC News Tel Aviv bureau chief Martin Fletcher’s family.  Martin calls it “a miracle.”", "WATCH: Protestors interrupt President Biden's speech calling for aceasefirein Gaza", "Defense Secretary Austin gives update on Israel:\n\n“As President Biden has said, for any country, for any organization, for anyone thinking of trying to take advantage of the agony in Israel to try and widen this conflict or to spill more blood, we have just one word: don’t.”", "Biden: \"This is terrorism. But sadly for the Jewish people, it's not new. The attack has brought to the surface painful memories, the scars led by a millennia of anti semitism andgenocideof the Jewish people. So in this moment we must be crystal clear: We stand with Israel.\"", "BREAKING: State Department confirms at least 22 Americans killed in Israel"], "FoxNews": ["IDFsays it continued to attack Hamas military targets, headquarters inGazaStrip; Hamas official killed", "Jewish mother, family attacked at elementary school graduation by agitators yelling 'Death toIsrael': report", "Netanyahu mourns deaths of six hostages recovered inGaza, vows to 'settle accounts' with Hamas", "LA Times editorial board demands Biden administration push for cease-fire inIsrael-Hamas war", "Average Palestinian inGazasurviving on only 2 pieces of bread per day: UN human rights official", "Israel Security Agency creates new unit to hunt, kill everyHamasterrorist in Oct. 7 surprise attacks: report", "'HAMASIS ISIS': Standing united in Israel, Blinken andNetanyahuconfront the world afterHamasterrormassacre.https://trib.al/zubQYya", "'AT WAR': Israeli Prime Minister makes promise to citizens afterHamasterror attacks, says the enemies \"have made a mistake of historic proportions.\"https://trib.al/vUsml8J", "'HELL TO PAY':@NikkiHaleywrote a clear message toHamason an IDF artillery shell during her visit to Israel where she met with October 7 survivors and military leaders. Details about her tour:https://trib.al/Noax8El"], "TheAtlantic": ["\"To abandon Ukraine now would allow Russiaandits authoritarian friends in China, Iran,andNorth Korea to believe that the 21st century is moving their way—into a future of brutal armies, cowed populations,andendless lies,\" George Packer writes.", "If Iranian president Ebrahim Raisi turns out to have lost his life in a helicopter crash, it will set off a fierce scramble for power,@arash_tehranwrites:", "\"It is not irrational for women with socially liberal values to avoid dating people who think that they should be forced to carry an unwanted pregnancy to term,\"@AdamSerwerwrites:", "“As serious scholarship has shown, the right-wing rage we need to worry about is not coming from deep-red rural areas,”@Tyler_A_Harperwrites. “It is coming from citiesandsuburbs.”", "\"We have no viable path forward as a pluralistic society—none—without confronting the deterioration of the evangelical movementandrepairing the relationship between Christiansandthe broader culture,\" writes@TimAlberta:"], "aldotcom": ["A 12-year-old grill master from Alabama has been crowned winner of@MasterChefJrFOX. Congratulations, Bryson \"Cheese Curd\" McGlynn!https://al.com/life/2024/05/alabamas-bryson-mcglynn-wins-masterchef-junior-impresses-gordon-ramsay-you-did-it-man.html…", "Alabama’s bill to define the sexes passed the House 77-24 on Thursdayandis now in the Senate. The bill, HB111, defines the terms “male,” “female,” “boy,”and“girl.” It states that the sexes are equal but not the sameandthat there are only two sexes.", "After days of lengthy debate, an effort to ban diversity, equityandinclusion programs in Alabama state institutions will now head to the governor’s desk.\n\nRead more here:https://al.com/educationlab/2024/03/alabama-sends-bill-banning-college-dei-programs-training-to-governors-desk.html?utm_campaign=aldotcom_sf&utm_medium=social&utm_source=twitter…", "Trump has attended two Crimson Tide games before,andthis will be his second visit to Bryant-Denny Stadium.", "Alabama A&M University made a $52 million offer on Thursday to purchase Birmingham-Southern College with the intention to retain the school’s credentialed faculty and staff.", "Birmingham Mayor Randall Woodfin arrives in his Barons jersey at Rickwood Field before the San Francisco Giants take on the St. Louis Cardinals.#MLB#Rickwood#Birmingham", "The Northern Lights as seen from Eutaw, Alabama, on Friday night. Photos courtesy Latitia Rodgers#northernlights#alwx", "Kaleb Dillard, 28, is one of a roughly a dozen Alabama residents charged in connection with the Capitol breach. \n\nMountain Brook man gets 10 months in prison for attacking Capitol Police on Jan. 6:"], "JudiciaryGOP": ["WATCH: Eyal Yakoby, an undergraduate student at University of Pennsylvania, talks about the harassment that Jewish students face on college campuses", "Shabbos Kestenbaum, a Jewish graduate student at Harvard, details his harrowing experiences over the last 3 weeks on campus.", "The same TonyWestwho was involved in the 2012 Tom Perez DOJ scandal. \n\nThe scandal costing St Paul, Minnesota residents up to $200 million. \n\nRead more about it here:https://oversight.house.gov/hearing/dojs-quid-pro-quo-with-st-paul-a-whistleblowers-perspective/…", "JUST IN: Kamala's 'Powerful' New Advisor Served as Lawyer for Convicted Taliban Terrorist -- Tony West, Harris's brother-in-law, claimed 'American Taliban' John Lindh was 'not a terrorist'https://freebeacon.com/democrats/taliban-lawyer-tony-west-has-a-new-client-his-sister-in-law-kamala-harris/…", "RabbiDr. Goldfeder, the Director of the National Jewish Advocacy Center, details how nearly 75 percent of Jewish students across the United States have experienced antisemitism on college campuses.Andthat number is only growing."], "MSNBC": ["Netanyahu: \"The war inGazacould end tomorrow if Hamas returns all the hostages. If they don't,Israelwill fight until it destroys Hamas's military capacities,andits rule inGaza,andwe bring all our hostages home.\"", "NEW: 70 killed after Israeli strikes hit three convoys of evacuees trying to leave northernGaza.", ".@rafsanchezon the latest death toll after Hamas’ attack inIsrael: “Israeli Emergency Services are now saying 40 Israelis confirmed dead, some 800 wounded… The Palestinian Health Ministry is saying 200 people are dead inside ofGaza, 1600 wounded.”", "\"The ball has been in Hamas' court. We have made clear that they should accept that over. ThatIsraelmade significant compromises.\"\n\nWATCH: State Department spokesperson on Hamas accepting a cease-fire proposal from EgyptandQatar.", "Netanyahu: \"The war in Gaza could end tomorrow ifHamasreturns all the hostages. If they don't, Israel will fight until it destroysHamas's military capacities, and its rule in Gaza, and we bring all our hostages home.\"", "Pres. Biden onHamasterror attack: “The deadliest day for Jews since the Holocaust...Silence is complicity…I refuse to be silent.”", "BREAKING: Israel ordered to immediately halt Rafah offensive by top U.N. court.@rafsanchezhas the latest.", "A senior Israeli official who gave NBC News details on a tentative agreement withHamassays there is an option to extend aceasefirefor extra days in return for 10 hostages per day.\n\nNBC News Foreign Correspondent@rafsanchezhas more on the outlines of the possible deal."], "NBCNews": ["DEVELOPING: The Israeli military says it is striking targets in theGazaStrip after the Hamas militant group launched 5,000 rockets intoIsrael.", "Israel’s military says it carried out a deadly strike inGazaCity on an ambulance that was being “used by a Hamas terrorist cell.” \n\nPalestinian health authorities say the vehicle was part of a convoy carrying wounded people.", "LIVE UPDATES:Israel-Hamas war\n\n• Hostages were holding a white cloth when they were killed by Israeli soldiers, theIDFsays.\n\n• Protest erupts inTelAvivafter theIDFadmits it mistakenly killed 3 Israeli hostages.", "BREAKING: Prime Minister Netanyahu saysIsraelis at war, ordering retaliation against Hamas militants who launched an unprecedented attack from theGazaStrip.https://nbcnews.com/news/world/live-blog/live-updates-hamas-israel-gaza-attack-rockets-gunmen-palestinian-rcna119316?cid=sm_npd_nn_tw_ma&taid=6521331c7810a500012bc754&utm_campaign=trueanthem&utm_medium=social&utm_source=twitter…", "BREAKING: NBC NEWS SPECIAL REPORT:Hamasannounces it has accepted an Egyptian-Qatari cease-fire proposal.http://nbcnews.app.link/pthOE7nNnJb", "DEVELOPING: The Israeli military says it is striking targets in the Gaza Strip after theHamasmilitant group launched 5,000 rockets into Israel.", "ISRAEL-HAMASWAR LIVE UPDATES:\n\n• 1,300+ Israelis killed. 1,400+ people killed in Gaza \n• Israel says \"complete siege\" will not be lifted untilHamasreleases hostages \n• Israeli military preparing for potential ground assault on Gaza • Gaza hospitals operating without power", "LIVE UPDATES: Israel says it has retaken control of border with Gaza:\n\n• At least 900 dead in Israel, IDF says\n\n• At least 770 dead in Gaza, according to the Gaza Health Ministry\n\n•Hamassays it will not discuss prisoner swap as active battle continues"], "politico": ["Protesters calling for a ceasefire in theIsrael-Hamas conflict interrupted President Biden’s campaign speech at a historic South Carolina church.\n\nChants of “cease-fire now” were eventually drowned out by “four more years” at the campaign event.https://politi.co/3tK7M94", "These trauma surgeons thought they’d seen the worst of the worst. But nothing they’d experienced prepared them for the horrors they found inGaza, as civiliansandchildren suffer underIsrael’s bombing campaign.\n\nTwo weeks inside aGazahospital", "Ramaswamy:Israelshould provide post-Gazainvasion plan to assure further U.S. aid", "Biden expected to issue executive order targeting Israeli settlers inWestBank", "The alleged offer is the latest blowback against Rep. Rashida Tlaib, the only Palestinian American in Congress, for her criticism of the Israeli government since its war with Hamas began.", "Biden administration thinksNetanyahumay not last politically", "Kamala Harris pushes W.H. to be more sympathetic toward Palestinians", "Lawrence Summers, Ted Cruz criticize Harvard for student statement blaming Israel", "Centrist GOP effort to reinstate McCarthy picks up steam after Israel attacks", "Lindsey Graham: Time to designate Russia a state sponsor of terrorism"], "joncoopertweets": ["GREAT NEWS! With the assistance of Croatia, the Ukrainian government has completed the process of confiscating the $220 million yacht of Putin's crony, Medvedcuk. It will be auctioned off to raise money for weapons for Ukraine.\n\nThe U.S. needs to do the same!h/t@JayinKyiv", "Yesterday, two Ukrainian soldiers ran out of ammunitionandsurrendered. Instead of taking them as POWs, Russian troops EXECUTED them in cold blood.\n\nIf House Republicans fail to approve more military aid to Ukraine, murders like that will be repeated thousands of times over.", "Below is a current list of House members who’ve signed the discharge petition to force a vote on the Senate's bipartisan Ukraine-Israel-Taiwan aid bill. 218 signatures are needed.If your rep isn’t listed, call 202-224-3121 TODAYandurge them to sign!", "Military aid toIsraelandUkraine should be coupled together. Putin apologist Mike Johnson can go screw himself.", "Putin sacrificed Russia to save himself.\n\nNetanyahu sacrificedIsraelto save himself.\n\nTrump is happily sacrificing America to save himself.", "Putin killed Navalny. TrumpandJohnson are doing Putin’s bidding to deny military aid to Ukraine. Not a coincidence. \n\nWake up, you fucking GOP cowards — the blood of an allied nation will be on your hands if you fail to act.#UKRAINEAID NOW!!!", "I totally agree with you. It’s such a shame —andmoreover, I think it’s a disservice to justice in the broadest sense.", "It’s a fact:@SpeakerJohnsonandthe House Republican caucus are protecting fentanyl smugglers, child sex traffickersandterrorists. \n\nIf they think that will be a winning election message, they’re going to have a very rude awakening when the GOP gets decimated in November.", "Here’s a list of House members who’ve signed the discharge petition to force a vote on the Senate's bipartisan Ukraine-Israel-Taiwan aid bill. 191 signatures now — 218 are needed.If your rep isn’t listed, call 202-224-3121 TODAY and urge them to sign!", ".@PolitiFact: \"Joe Biden is correct that violent crime is near a 50-year low. Despite a spike in murder in 2020 amidst the emergence of  COVID, even homicides have declined.'\"\n\n𝗪𝗵𝘆 𝘄𝗼𝗻’𝘁 𝗺𝗮𝗶𝗻𝘀𝘁𝗿𝗲𝗮𝗺 𝗺𝗲𝗱𝗶𝗮 𝗿𝗲𝗽𝗼𝗿𝘁 𝘁𝗵𝗶𝘀?", "Tragedy struck Winder, GA last week. Four people were killed and nine were injured when a 14-year-old shooter opened fire. Today, back-to-school season means living under the threat of gun violence.\n\nSIGN HERE to demand that Congress ban assault weapons!", "Trump — the same guy who wants to pardon J6 insurrectionists — says he’ll deport pro-Palestinian students if he’s elected. “One thing I do is, any student that protests, I throw them out of the country. As soon as they hear that, they’re going to behave.”", "Katie, thank you for all your amazing reporting over the past several weeks. You were one of my primary sources for accurate, breaking news throughout the entire trial.", "To be fair, I’m pretty sure I count 20 vehicles — if you include the bus!"], "HomelandDems": ["Nope. \n\nCBP has told us timeandagain that need more resources (andstaffing). \n\nThe Speaker,andextreme MAGA Republicans, are gleefully standing in the way of the President’s request to get more $andstaff to CBP.", "Tapper: Some people are saying why not pass the $14 billion supplemental \n\nJohnson: That won’t help\n\nTapper: I’m sure the CBP agents think it might do something\n\nJohnson: Nope\n\nTapper: They don’t want the $14 billion?", "Tell us you don’t understand national security without telling us you don’t understand national security. \n\nSo deeply unserious.", "Green: The greatest domestic threat to the national security is Secretary Alejandro Mayorkas\n\nOther Republicans: *clap*", "Don't forget: \n\nYour sham impeachment was ruled unconstitutional in the Senate, a complete rejection of it on the merits.", "Greene: My amendment would effectively fire Secretary Mayorkas. If the House impeached Secretary Mayorkas, we should certainly not pay him.", "Fun fact: Republicans voted against legislation for more CBP Officers and Agents.\n\nThey also said “not another dime” for CBP for more resources and staffing.", "Kirby: So just by the sheer numbers in the votes the House Republicans have said they don't favor increasing the number of border agents and you heard Johnson that they are not interested in moving forward on the president's national security supplemental..", "Republicans don’t want  any border solutions. They want to preserve a political wedge issue for an election year. \n\nThat’s all they got.", "Harf: President Biden put on the table more tough border restrictions than any Democratic president in history and Republicans walked away for political reasons. He should remind people that Republicans walked away to help Donald Trump.", "Tell us you don’t understand national security without telling us you don’t understand national security. \n\nSo deeply unserious.", "Green: The greatest domestic threat to the national security is Secretary Alejandro Mayorkas\n\nOther Republicans: *clap*", "Spoiler alert: Extreme MAGA Republicans don't want to fix problems at the border, they just want to use it as a political weapon (and for photo ops of course).", "Tapper: Some people are saying why not pass the $14 billion supplemental \n\nJohnson: That won’t help\n\nTapper: I’m sure the CBP agents think it might do something\n\nJohnson: Nope\n\nTapper: They don’t want the $14 billion?"], "HouseJudiciary": ["Rep.@StaceyPlaskett: I know the American people don't believe that this is an appropriate use of the $20 million allocated to this committee. Holding six full hearings to bolster disproven lies.", ".@RepRaskin: Democracyandfreedom are under siege todayandall Republicans can think to do is to sell out our Democratic alliesandsell out the cause of human rightsandthen impeach a cabinet secretary working to solve the immigration problem that they claim to care about.", "Ranking Member@RepJerryNadlerdelivers his opening statement during today's hearing featuring far-right advocates who want to dismantle the agencies charged with protecting our healthandsafety.", "Republicans’ plan to abolish the ATF would lead to increased gun violenceandunchecked gun trafficking", "ATF Director Dettelbach: A recent ATF report shows that 60% of trafficked firearms go to convicted felons and prohibited people and thousands of these traffic guns are used in murders and shootings.", "Republicans claim to be the party of law and order, but 8 out of the 10 states with the highest murder rates in 2022 voted for Donald Trump in both 2016 and 2020.", "President Biden acted responsibly, cooperated completely, and the decision to decline criminal charges was relatively straightforward.\n\nIn short, the Hur Report represents thecomplete and total exonerationof President Biden.", "CNN: Violent crime dropped by more than 15% in the United States during the first three months of 2024, according to statistics released Monday by the FBI", "New preliminary data from major U.S. cities shows a sharp drop in violent crime in the first half of the yearhttps://axios.com/2024/08/12/violent-crime-harris-trump-election…"], "NPR": [], "CNN": ["Benny Gantz resigns fromIsrael's war cabinet, delivering a blow to PM Benjamin Netanyahu who has been celebrating the rescue of hostages held inGaza", "Israelsays the country's military operation in Rafah will continue while it sends a delegation to ceasefire mediatorshttps://cnn.it/3JODGph", "The truce betweenIsraelandHamas has been extended, theIDFconfirms, minutes before deal was set to expire", "The UN Security Council passes a resolution calling for an immediate ceasefire inGazaafter the US abstainshttps://cnn.it/3x6I6op", "Israeli military gives Gazans a six-hour window to evacuate south on specified streets. It is unclear how widely the messaging has been received.https://cnn.it/45AKEqu", "Israeli tanks seen in central Rafah for the first time, witnesses say, despite growing global condemnation ofIsrael's operation", "While assuring Americans there are no credible threats locally, cities throughout the United States are ramping up security around houses of worship after the large-scale attack byGazamilitants onIsraelon Saturday.https://cnn.it/3F5Onl6", "New information is emerging about the cause of the devastatingGazahospital blast. Here's what we know --andwhat we don't.https://cnn.it/3S5SC7Z", "Broad terms were settled to free hostages. Israel and the US were on board. ThenHamaswent dark. Here's how weeks of painstaking negotiations came through.https://cnn.com/2023/11/21/politics/negotiations-israel-hamas-hostages?Date=20231122&Profile=CNN&utm_content=1700623535&utm_medium=social&utm_source=twitter…", "Six more hostages held in Gaza have been freed, the IDF says. This marks the seventh round of hostage transfers fromHamasto Israel.", "At least nine US citizens are among those who have died afterHamas' attack on Israel, says a US National Security Council spokespersonhttps://cnn.it/3RTApdE", "Israel denies responsibility for Gaza hospital blast, blaming an Islamic Jihad \"failed rocket launch.\" Hundreds are believed to have been killed.https://cnn.it/3PZ7Ite", "About 1 in 100 people in Gaza has been killed since October 7, Palestinian statistics show", "Israeli military withdraws from Gaza's Al-Shifa hospital after 14-day siege, Gaza officials say. Follow live updates.", "A visibly shaken US secretary of state evoked the brutality ofHamas' attack, but also said the US is pressing Israel to minimize civilian casualtieshttps://trib.al/dfDBJg4"], "LPMisesCaucus": ["On Good Friday, let's recognize that the story of Christ is - at a minimum - the story of a virtuous, peaceful individual put to death by government agents of his time due to the schemes of power-hungry priestsandacademics, with popular demand from the masses.", "No entangling alliances. Border wars overseas are not the proper jurisdiction of the US federal government. Stop foreign aid to all countries including#Ukraine,#Taiwan,and#Israel.", "The regime media uses language to manipulate, not communicate", "All gun control is infringement. Those who enforce gun control are gangster thugs. The Branch Davidians were victims defending themselves.#AbolishTheATF", "SupportingIsraelis against America's national interests.", "Quite the headline. Surely it's a completely accurate representationandnot at all a disingenuous hit piece.\n/sarc\n\nThe regime media is an enemy of the people.", "The regime media is an enemy of the people.", "Oh, so we're at the \"yes it happenedandit was a good thing\" stage, now?\n\nKeep justifying corporatist censorship of dissidents, you're just reinforcing how the regime media is an enemy of the people.", "\"The war to end all wars\" is what WW1 was sold as,andthe reality was the disastrous opposite. So too will it be the case here.#NoWarwith#Iran", "Avoid the US government’s armed forces. Don't sign up or re-enlist. Be a conscientious objector. Prepare to dodge the draft. Support#DefendTheGuard. Do whatever it takes to not be a part of this insane imperial blood sport that risks Nuclear WW3.#NoWarwith#Iran#DefundIsrael", "BREAKING: 4,000 United States Marines and sailors headed to the Middle East.", "Chevron Deference has been disastrous for libertyanda major catalyst for growing Deep State power. The Supreme Court overruling it is a fantastic decision.", "BREAKING: In a major blow to the unelected administrative state, the Supreme Court has overruled the Chevron doctrine, which required courts to defer to the legal interpretations of unelected bureaucrats. \n\n“Chevron is overruled.”", "It started with Assange, now the regime's lawfare against real journalism is expanding.", "WASHINGTON (AP) — Judge holds ex-CBS and Fox News reporter Catherine Herridge in civil contempt for refusing to divulge source of stories.", "There should never have been American soldiers in Iraq, let alone still there after decades of unnecessary wars. Enough Already. Don't look at this as the Casus Beli for more war, look at this as more reason to Bring All Troops Home.#NoWarwith#Iran#WW3", ": At least 2 American soldiers have been killed as a result of rocket attacks against Ain al-Asad Airbase in Iraq.", "The US federal government should not be entangled with either one. No troops, no weapons, no aid.\n\nAlso, Israel isn't just \"a land\", it's a repressive ethnostate that is currently closer to dragging the US into WW3 than anything else, including Ukraine.", "Israel is a land with a 4,000 year connection to our faith. \n\nUkraine is a former Soviet state. \n\nThese are not the same thing, and should be considered independently.", "This is grossly counterproductive. If there's one thing leftist vandals do well, it's toxify whatever cause they're championing. The desire to oppose this gives Zionists plenty of ammo to keep regular people from denouncing the ongoing Israeli slaughter in Gaza.", "they just desecrated the Freedom Ball in D.C.", "No, the mass incineration of babies and schoolchildren is never \"right\". Not only was it evil, it was militarily unnecessary; and many top military leaders of the day said as much.", "Was America right to use a nuclear bomb against Japan in World War 2?", "Israelis have agency, nobody would think bombing a school is a just response to a school shooter,Hamasis a creation & asset of Israel, the conflict between Israelis & Palestinians started well before this month, and killing children is always unjust (not just tragic).", "It's tragic that civilians are caught up in the#Gazabombing.\n\nUltimately, though, the blame is on Hamas. They started this war in the most barbaric manner possible. Israel has not just the right, but the obligation, to finish it."], "RealSpikeCohen": ["Here’s the link, but before you contact them, like I say every time: I know you're angry. So am I. \n\nBut let's not give government officials the opportunity to play the victim. They'd love nothing more than to make it about them.\n\nBut it's not about them,andit’s not about what", "The best way to reduce gun violence is to see where it happens:\n\n1. Cities with strict gun laws.\n\n2. \"Gun free\" zones.\n\nSo let's ban strict gun lawsand\"gun free\" zones.", "Delete this.\n\nBullying some random retail workerandtrying to get her fired for wearing an article of clothing you don't like is despicable.", "The man was walking down the street, neither harming nor threatening anyone.\n\nRename yourselves @KARENS_organdthen delete your account.", "\"There is not a single abolitionist who would not grab a feasible method, or a gradual gain, if it came his way. The difference is that the abolitionist always holds high the banner of his ultimate goal, never hides his basic principles,andwishes to get to his goal as fast as", "Absolutely.Andthe groups funded in Iraq which later formed ISIS.AndHussein,andNoriega.\n\nThe US government has a long history of creating its next enemies.", "This is Cheyenne Benthin, with her son Heston. \n\nHeston died one night, the autopsy found it was caused by natural causes, but the@GilbertPolicetook Cheyenne's daughter from her anyway, and now she's living every parent's worst nightmare. \n\nWe're going to get her daughter back,", "The government helped create the unstable conditions around the world that are causing a surge of people to come here. \n\nThe government offers free food, housing, phones and more to anyone who enters, but in most cases doesn't allow them to work.\n\nThe government makes it", "\"Oh huh huh I guess that means Israel too!\"\n\nYes. That means Israel too.\n\nYou must be new here. Welcome.", "Haley was governor of my state. \n\nShe ran on many promises: reigning in spending, ending the backroom deals in Columbia, signing permitless carry of firearms into law, and many other very good promises.\n\nShe did exactly 0% of them.\n\nShe then became Trump's chief neocon at the UN.", "Barack Obama murdered a 16 year old American citizen.\n\nHe claimed absolute immunity for it, and the courts dismissed the case against him.\n\nYou were Vice President when it happened.\n\nWell anyway you probably don't remember."], "YATPOfficial": ["Last Wednesday, YATP member Henry Lever addressed the Springerville, AZ council on behalf of the Hightower family to demand that the town manager Tim Rasmussen, STOP harrassing their grandfather Joe Woodandallow him to continue to live in his RV on his grandchildren's private", "Meet the Williams.\n\nAfter growing up with four foster brothers, Jennifer was looking forward to following in that tradition with her own home. While dating Jonathon, he was all-in on doing the same. \n\nThey have always believed it was their job to not only protect the children in", "Joslyn Sanders was expecting to go into court last Wednesday in Denton, TX to hear the news that she would be given her son, Josiah Sanders, back from the state’s care. As we’ve come to expect, the state isn’t wanting to give up their control so easily.\n\nIn the courtroom, Texas", "This is JoslynandJosiah Sanders.\n\nJosiah was a healthy baby boy born in May of 2021.\n\nAfter Joslyn stopped breastfeeding Josiah in March of 2023, he experienced some eating difficultiesandhad a minor seizure. A visit to the ER revealed Josiah had a mild calcium deficiency. A", "This is Joslyn and Josiah Sanders.\n\nJosiah was a healthy baby boy born in May of 2021.\n\nAfter Joslyn stopped breastfeeding Josiah in March of 2023, he experienced some eating difficulties and had a minor seizure. A visit to the ER revealed Josiah had a mild calcium deficiency. A", "Imagine taking your medically fragile child to a pediatrician or hospital just to be accused of abuse and having your child seized by DFCS, the state agency responsible for the safety and well-being of children in the state’s care.\n\nThe very same agency that, just a few years", "Meet the Hernandez family. That's Matt and Tuckey smiling with their beautiful young daughters.\n\nOver the past few months, the Georgia state government has ripped this family apart, because one of their daughters has a medical condition that the court refuses to acknowledge.", "If you are in the area and would like to show up and support Damani & Shelby during court, the family asks that you wear Pink!\n\nCourt hearing is September 23rd and September 24th @ 9:00am\n\nLocation:\nTerry K. Floyd Juvenile Justice/Court Building\n303 East 4th Street\nWoodbine, GA"], "justinamash": ["Offensive military operations without congressional authorization—in Syria, Iraq, or elsewhere—are unconstitutionalandunlawful. Before ordering acts of war, a president needs the express approval of the people’s representatives in Congress. Any order that disregards this", "Rememberingandhonoring those who sacrificed everything to liberate people from tyranny 80 years ago today.", "End the Patriot Act.\nEnd FISA 702.\nEnd no-conviction watchlists.\nEnd NDAA indefinite detention.\nEnd the 2001 AUMF.\nEnd the illegal wars.", "President Biden needs to stop demanding that Americans fund other countries’ wars. Congress hasn’t declared war in aid of any other country. Biden wants it both ways: Financing the wars—andurging Americans to support the war efforts—while taking no responsibility for the wars.", "Follow the Constitution.\nRead the bills.\nStop governing by emergency.\nEnd the forever war.\nStop borrowing trillions.\nNo centralbankdigital currency.\nProtect free speech.\nRepeal Patriot Act/FISA 702.\nEnd civil asset forfeiture.\n\nLet’s do it!\nDONATE herehttps://secure.justinamash.com/donate?source_code=x…", "We must prevent adoption of a centralbankdigital currency but then also take the next step of denationalizing money. Bitcoin is the most promising money innovation in our lifetime. We need a wall of separation between moneyandstate. Click here to help:https://secure.justinamash.com/donate?source_code=x…", "Prayers for those injured in the shooting at the Rochester Hills splash padandfor their families.", "What the U.S. government is doing to Julian Assange puts all journalists at riskandundermines press freedom. He faces prosecution for journalism—for publishing materials exposing war crimesandother horrors in AfghanistanandIraq. Uphold the 1st Amendment. Free or pardon him.", "I’m the only candidate in this U.S. Senate race who consistently supportsanddefends the First Amendment—the freedom of religion, speech, press, peaceable assembly,andexpression of every kind.", "I just received a panicked phone call from a cousin in Gaza. He told me that there has been another IDF strike against Saint Porphyrius Orthodox Church.\n\nThese horrific assaults against civilians in Gaza, including Christians like members of my family, must end immediately!", "One of the most meaningfulandemotionally stirring messages I have ever received came to me this past week from a cousin in Gaza.\n\nDespite all the horrors they are going through—the destruction of their lives, the deaths of their family members—he was praying for me.\n\nPraying", "In this video, provided to me by a relative on site, you can see the destruction at Saint Porphyrius Orthodox Church in Gaza. The ancient sanctuary remains standing, but the church annex, which includes officesandmeeting spaces for the Christian community, collapsed from an", "Michigan’s Chaldean, Assyrian,andSyriac communities have felt the devastating impact of the forever war policies of Mike RogersandElissa Slotkin.\n\nNo prevalent ideology in U.S. politics has been more harmful to Christian minorities in Iraq, Syria, Lebanon,andPalestine than", ".@RepWalberg’s comments evince an utter indifference to human suffering. The people of Gaza are our fellow human beings—many of them children trapped in horrific circumstances beyond their individual control. For him to suggest that hundreds of thousands of innocent Palestinians", "Video appears to show Tim Walberg calling for nuclear bombs to be dropped on Gazahttps://freep.com/story/news/politics/2024/03/30/video-suggests-walberg-called-for-nuclear-bombs-to-be-dropped-on-gaza/73155099007/?utm_campaign=snd-autopilot…", "Then Israel can planandconduct their military operations without our moneyandassistance. You can’t have it both ways.", "WHITE HOUSE: \"[Israel] is a sovereign nation. They plan their military operations and they conduct their military operations and they make the choices. It's not like we give them a homework assignment and they have to then turn in their plan to us for grading.\"", "Language like this dehumanizesandendangers people of Palestinian descent everywhere. Replace “Palestinians” in this headline with any other ethnicity or raceandfew would tolerate it.", "There Are No ‘Innocent Palestinians’https://townhall.com/columnists/dwwilber/2023/12/07/there-are-no-innocent-palestinians-n2632056…"], "LPNational": ["War with Iran is unacceptable. Neocons always drench the world in blood, while destroying your moneyandviolating your civil liberties in the process. They can never be trusted.", "What became known as the Christmas Truce showed that, given the choice, people do not want to kill each other. It was a heartwarming occasion for the soldiers, but the governments of both sides feared what this meant for their war propaganda...", "Follow the federal money trail in the new $886 billion NDAA bill,andyou'll find Congress represents Ukraine,Israel, the military industrial complex, the surveillance state,andthe banks.\n\nNot regular Americans, who are struggling to make ends meet.", "Even today, war-makers in every country demand total dehumanization of the enemy. This is why we must remain focused on dispelling the lies of the war machine.\n\nAs Ludwig von Mises taught us just 8 years after the Christmas Truce, \"Peaceandnot war is the father of all things.\"", "If you opposed the Patriot Actandinvasion of Iraq, they called you anti-American.\n\nIf you opposed the lockdownsandvaccine mandates, they called you antiscience.\n\nIf you oppose endless funding forIsrael, they call you antisemitic.\n\nIgnore their liesandpreserve your liberty.", "The military-industrial complex thrives on perpetual warandfear. \n\nEndless conflictsandinterventions aren't about national security; they're about profitandpower. \n\nThe state uses patriotism to mask its true intentions, sacrificing livesandliberties for the benefit of a", "Ukraine is not the 51st state.\n\nTaiwan is not the 51st state.Israelis not the 51st state.\n\nNot one cent should be sent overseas while you struggle to make ends meet in America.", "The US war regime intends for Ukraine to serve the purpose that Afghanistan once did—as the excuse for a long-term money laundering scheme for the banksandmilitary industrial complex. \n\nThat's why $173 billion has been spent there without realistic goals or significant", "Today in Davos, Javier Milei told a bunch of WEF elites that socialist schemes aren't the solution to society's problems—but instead their root cause. He's exactly right.", "The neoconsandmilitary industrial complex wanted war with Iran in 2001. None of us should be surprised by the new ploy to drag Americans into such a conflict.", "America needs a peace President.\n\nThe Libertarian Party is dedicated to peace. Actual peace. Not the kind cloaked in the grandiloquence of political doublespeak, nor the fleeting mirage conjured up by the ephemeral gestures of international diplomacy. We are speaking of a peace", "This video is from 2019,andour rulers have made the suicide mission more obvious since then. We can only change course by ending their criminal institutions, nullifying their schemes at the local level,andembracing liberty.", "Follow the federal money trail in the new $886 billion NDAA bill, and you'll find Congress represents Ukraine, Israel, the military industrial complex, the surveillance state, and the banks.\n\nNot regular Americans, who are struggling to make ends meet.", "Imagine reflecting upon recent decades—with wars in Afghanistan, Iraq, Syria, Libya, Yemen, and elsewhere—and believing the biggest problem with US foreign policy is that it hasn't been harsh enough toward Muslims in the Middle East.", "The military-industrial complex thrives on perpetual war and fear. \n\nEndless conflicts and interventions aren't about national security; they're about profit and power. \n\nThe state uses patriotism to mask its true intentions, sacrificing lives and liberties for the benefit of a", "“There are elements within the United States' government that are hubristic enough to flirt with WWIII. The people who authorized and encouraged air strikes on Syria are grossly irresponsible and unamerican. American interests are not supported by a proxy war with Iran. We need", "Wars are the health of the state and the death of the individual.\n\nThe government thrives on conflict, sending your sons and daughters to die for its power games. \n\nThe true fight is back home and bettering our own communities.", "We don't stand with murderous states.\n\nWe stand with innocent civilians in every state caught up in the horrors of wars carried out by their rulers.", "The US war regime intends for Ukraine to serve the purpose that Afghanistan once did—as the excuse for a long-term money laundering scheme for the banks and military industrial complex. \n\nThat's why $173 billion has been spent there without realistic goals or significant", "It was a gun-free zone, making the children there sitting ducks. We will not sit idly as you attempt to make it easier to commit mass murder in schools. Well-trained teachers and staff are always a hedge against atrocities like Sandy Hook.", "If the government’s ‘solutions’ worked, we wouldn’t need to repeat them endlessly. \n\nThe war on poverty created more poverty, the war on drugs fueled more crime, and the war on terror made the world less safe. \n\nIt’s time to admit: the state doesn’t solve problems; it perpetuates"], "theintercept": []}