{"denverpost": ["New Colorado law aims to protect public libraries from partisan book-banning battles", "JUST IN: Former Colorado clerk Tina Peters, a hero to election deniers, has been found guilty in a breach of her county’s election computer system in a jury verdict returned Monday at trial.", "A new Colorado law signed Wednesday by Gov. Jared Polis bans the use of a cell phone while driving, except with a hands-free device or in emergency situations.", "University of Colorado to consider banning concealed carry on all campuses", "NEW: Gov. Jared Polis signed a bill into law Monday that officially eliminates most restrictions on how many unrelated roommates can live together in Colorado.", "NEW: Jenna Ellis, a Colorado native and former lawyer for then-President Donald Trump in 2020, will not be allowed to practice law in Colorado for at least three years under an agreement approved Tuesday by the Colorado Supreme Court.", "Colorado Republicans, facing power gap, will try to impeach — or recall — Jena Griswold over Trump ballot case", "NEW: For the first time in Colorado history, House Democrats passed a bill Sunday to ban the sale, purchase and transfer of so-called “assault weapons” in the state, setting the measure on a collision course with the state Senate.", "NEW: Gov. Jared Polis signed a bill into law Monday that officially eliminates most restrictions on how many unrelated roommates can live together in Colorado.", "NEW: CU athletics informed The Denver Post that head coach Deion Sanders and anyone else within the Buffs football program will no longer take questions from columnist Sean Keeler due to what CU perceives as “a series of sustained, personal attacks”"], "action_4assange": [], "CapitolJournal": [], "politicallyga": [], "fred_guttenberg": ["This is so simple.Israelwants a ceasefire.  I want a ceasefire.  We all agree that there should be a ceasefire.  JUST RELEASE THE HOSTAGESANDSTOP TREATING HAMAS LIKE AN HONEST BROKER FOR PEACE.", "“The hostage deal is in the hands of Hamas right now. The Israelis have been cooperating. There's an offer out there that's rational. We’ll know in a couple of days if it’s going to happen. But we need the ceasefire.” -@POTUS", "This is why the failures to acknowledgeandrelease the hostages mattered before a ceasefire.  These Hamas supporting terrorists never wanted a ceasefire.  It was bullshit.  Read below.  This is what they want.   THIS IS WHYISRAELMUST BE SUPPORTED.", "More absolute insanity out of@Columbiatonight.\"Al-Qassam you make us proud! Take another soldier out!\"\n\"We say justice, you say how? Burn Tel Aviv to the ground!\"\n\"Hamas we love you. We support your rockets too!\"\n\"Red, black, green, and white, we support Hamas’ fight!\"\n\"It", "Please read & understand the reality of the hate directed atIsrael.  It is about its right to exist. If you refuse to understand that or why yesterdays attack mattered, that is your choice.Israelwill exist,Israelwill respond,andIsraelwill defeat those seeking to harm it.", "The DSA held a hate rally, chanting: “from the River to the Sea,” which is code for wiping Israel from the face of the earth.  \n\nLet that sink in.  The DSA is calling for the destruction of the Jewish State amid the largest single-day massacre of Jews since the Holocaust.  When", "For those disturbed byIsraeltelling Palestinian civilians to \"leave now\" in advance as it RESPONDS to terror, hostage taking, & war, you should redirect your anger.  Direct your anger at the terrorist leaders who did this & who bought the means to do this.", "BREAKING: Israeli Prime Minister Benjamin Netanyahu called on Palestinian civilians in Gaza to “leave now” because the Israeli military is going to “turn all Hamas hiding places into rubble”", "This is so simple.  Israel wants aceasefire.  I want aceasefire.  We all agree that there should be aceasefire.  JUST RELEASE THE HOSTAGES AND STOP TREATINGHAMASLIKE AN HONEST BROKER FOR PEACE.", "“The hostage deal is in the hands of Hamas right now. The Israelis have been cooperating. There's an offer out there that's rational. We’ll know in a couple of days if it’s going to happen. But we need the ceasefire.” -@POTUS", "This is why the failures to acknowledge and release the hostages mattered before aceasefire.  TheseHamassupporting terrorists never wanted aceasefire.  It was bullshit.  Read below.  This is what they want.   THIS IS WHY ISRAEL MUST BE SUPPORTED.", "More absolute insanity out of@Columbiatonight.\"Al-Qassam you make us proud! Take another soldier out!\"\n\"We say justice, you say how? Burn Tel Aviv to the ground!\"\n\"Hamas we love you. We support your rockets too!\"\n\"Red, black, green, and white, we support Hamas’ fight!\"\n\"It", "I support and have supported aceasefire, upon release of the hostages.  The only group preventing aceasefirefrom happening is the terrorist groupHAMAS.", "Hi Fred -- will you please support an immediate ceasefire to protect the lives of Gazans and the hostages?", "For those questioning my commitment to peace, STOP!!!  NEVER FORGET THIS!!!  I hate every second of what is happening and the reality of war.  However, I blameHamas, who chose to embed with the civilian population in Gaza.Hamasis doing this.  RELEASE THE HOSTAGES & IT ENDS!!!", "I support your anti-gun stance 100% but how can you be complacent of killing of children in Gaza?"], "AmpedUpPodcast": [], "LeeCamp": ["The debate over what is happening inGazaright now is not a real debate.Israelhas ADMITTED to a long list of atrocities & crimes. Here are some of them:", "BREAKING: Netanyahu has revealed his plan for $5 Billion settlements inGaza, once the land is all effectively stolen.\nHe apparently missed the lesson in school about hiding your ethnic cleansing plans.", "BREAKING: Netanyahu unveils plans to construct settlements in Gaza, backed by a staggering investment of $5 billion.\n\nThis is criminal!!!", "Israelhas been shown againandagain to be bombing & shooting Gazans in the areas where aid is dropped. They’ve killed over 400 in “flour massacres.”", "EGYPT AND BELGIUM AIR DROP AID\n\nISRAEL BOMBS THE EXACT SAME LOCATION \n\nThese are War Crimes", "BREAKING — Today saw protests in Washington DC, NYC, Tokyo, Rochester, Pittsburgh, Havana, Cuba & many other cities around the world demanding an end toIsrael's war / conflict / genocide / ethnic cleansing — Whatever you want to call it.", "Wow. An Israeli official accidentally ADMITTED on live television that their goal is to severely punish all 2.2 million Gazans, including children. Collective punishment of innocent people is illegal under the Geneva Conventions & international law.", "The debate over what is happening in Gaza right now is not a real debate. Israel has ADMITTED to a long list of atrocities & crimes. Here are some of them:", "Secretary of State Antony Blinken's propaganda is not hard to break down but many Americans don't notice it. To begin with,Hamas's attack on Oct 7th is called a \"slaughter\" but nothing Israel ever does is called a \"slaughter\", even though Israel has killed many thousands", "The Lancet Medical Journal says that *conservatively* Israel has killed 180,000 GazansThe Lancet Medical Journal says that *conservatively* Israel has killed 180,000 GazansThe Lancet Medical Journal says that *conservatively* Israel has killed 180,000 Gazans"], "JordanChariton": ["Meanwhile you’ve abandoned the SICK, poisoned people ofEastPalestine Ohio—while refusing to call for criminal charges against Norfolk Southern for unnecessarily chemically nuking the town", "Kamala Harris calls me and Donald Trump disloyal to America. Call me crazy, but I think it's disloyal to let in 20 million illegal aliens and poison our citizens with fentanyl.", "The Mayor ofEastPalestine, OH just spoke at the RNCanddid not mention the fact thatEastPalestine is STILL a chemical petri dish, its residents are growing sicker,andthe EPA is helping Norfolk Southern cover it up.", "I know there’s a lot going on, but I want to remind folks what the govt & media are covering up—the latest sacrifice zone. Jenna is an 18 year oldEastPalestine OH resident. Before Norfolk Southern unnecessarily detonated toxic cancerous chemicals over EP, she was healthy….", "Joe Scarborough on studentGazaprotests: “This is not helping those of us who want to fight fascism in America.”\n\n***As MSNBC shows American fascism on screen***", "Joe Scarborough Blasts MSNBC Viewers ‘Too Stupid’ To See Campus Protests Hurting Biden’s Reelection: ‘Change to Another Channel’\n\n“If you’re offended by this, please, I’m trying to help you.  I don’t want Donald Trump to get elected. All right? I’m trying to help you. If you’re", "Meanwhile you’ve abandoned the SICK, poisoned people of East Palestine Ohio—while refusing to call for criminal charges against Norfolk Southern for unnecessarily chemically nuking the town", "Kamala Harris calls me and Donald Trump disloyal to America. Call me crazy, but I think it's disloyal to let in 20 million illegal aliens and poison our citizens with fentanyl.", "The Mayor of East Palestine, OH just spoke at the RNC and did not mention the fact that East Palestine is STILL a chemical petri dish, its residents are growing sicker, and the EPA is helping Norfolk Southern cover it up.", "The Yes Queen Dem sycophants will love this. But anyone who cares about an ongoinggenocideshould be disgusted by this.", "Pro-Palestine protesters just disrupted Kamala's speech in Michigan.\n\nHer response: \"If you want Donald Trump to win say that. Otherwise, I’m speaking.”", "Sorry for folks on Team Blue who want to close their eyes, but VP Harris expressing more \"sympathy\" for slaughtered Palestinians isn't enough. Based on my recent interviews w/ Arab-Americans in Dearborn, MI,  she'll lose MI without changing policy on Gaza", "EXCLUSIVE: Palestinian-American Layla Elabed broke down in tears while speaking w/ VP Harris before MI rally yesterday. Elabed tells us VP Harris will \"100 percent\" lose MI if she doesn't announce Gaza policy change & meet demands of Uncommitted movement.\n\nFULL INTERVIEW below..."], "TheDemCoalition": ["Maddow: Trump's rhetoric is extremely dangerous -andeffective\n\nTrump has upped the ante with his most recent disgustingly racistandgenocidal comments that echo Hitler. \n\nHe is warning all of us, point-blank, that he will violate the law if he wants to,andif you don’t like", "This is great to see - a community pushing back against shameful Republican bigotry with a powerful show of support for their neighbors", "This is heartwarming. To push back against the lies, hate, racism and bigotry of Trump, JD Vance and Elon Musk — residents of Springfield, Ohio are packing Haitian restaurants to show support for the Haitian community.", "In February, Louisiana's knuckle-dragging Republican governor Jeff Landry announced the state would not accept federal money to help families to cover summer food expenses when their children aren’t in school to receive free breakfastandlunch, citing the need for", "A glorious headline for the ages#NoOneIsAboveTheLaw", "Maddow: Trump's rhetoric is extremely dangerous - and effective\n\nTrump has upped the ante with his most recent disgustingly racist and genocidal comments that echo Hitler. \n\nHe is warning all of us, point-blank, that he will violate the law if he wants to, and if you don’t like", "174 House Republicans voted against this", "In New Hampshire today,@POTUS\"is expected to announce a major milestone for the PACT Act...which boosts health care for veterans who were exposed to toxic substances like Agent Orange\"\n\n\"The law has [now] provided over 880,000 veterans and survivors with disability benefits\"", "Hello, 911, we'd like to report a murder", "We wish they cared as much about the school children who get slaughtered in their classrooms.\n\nTell Congress to ban assault weapons and large capacity magazines and pass comprehensive legislation to reduce gun violence here:http://bit.ly/31cmLXG#GunSafetyNow"], "DworkinReport": ["BidenandHarris Demand Accountability for Supreme Court Corruption \n\nIt's time:", "Biden Nails Wisconsin Speech! Still Got It!#DemocratsDeliverGoodJobsRead:", "BREAKING: Joe’s NAACP speech was one of his best. \n\nRead:", "Kamala Harris is Now the Presumptive Nominee\n\nHarris secured 2,579 delegates; 1,976 needed for nomination:", "Biden Nails Wisconsin Speech! Still Got It!#DemocratsDeliverGoodJobsRead:", "Kamala Harris is Now the Presumptive Nominee\n\nHarris secured 2,579 delegates; 1,976 needed for nomination:", "Biden and Harris Demand Accountability for Supreme Court Corruption \n\nIt's time:", "BREAKING: Joe’s NAACP speech was one of his best. \n\nRead:"], "WarOnDumb": ["Here is the answer I got from Britt’s spokesman Sean Ross. I don’t think it answers the questionandas you can see I have asked for further clarification.", "Lots of you have shared this with me. I have asked Britt’s spokesman for comment. I’ll let you know what I find out. For what it’s worth, I’ve followed Katz for years and have thought highly of his work going back to when he was an AP reporter in Haiti. x.com/NickKnudsenUS/…", "If ever you hear the words, “Alabama has done itandnow so can you,” run.", "Steve Marshall on nitrogen gas execution: 'Alabama has done it and now so can you. And we stand ready to assist you in implementing this method in your states.'#alpoliticshttps://al.com/news/2024/01/ag-steve-marshall-expects-other-states-to-follow-alabamas-textbook-nitrogen-execution.html…", "Alabama’s next-up guv went to church this morningandcame back talking about leftistjihadon Christian values. \n\nIf anyone was hoping partisans would stand downandcool off — nope. \n\nGas on the fire.", "An innocent man, Toforest Johnson, is on Alabama’s death row. Former GOPandDem Alabama officials have called for him to be set free. Steve Marshall has fought in court to kill him anyway. Instead, he defends Trump.", "By all accounts, Imane Khelif was born female and is not trans.", "Take a good look at this photo. Watch Angela Carini’s interviews.\n\nThis type of heartbreak for female athletes—this unfairness, this risk of injury—is exactly what the Biden-Harris attacks on Title IX would cause across American high schools, colleges, and universities. x.com/Riley_Gaines_/…", "If ever you hear the words, “Alabama has done it and now so can you,” run.", "Steve Marshall on nitrogen gas execution: 'Alabama has done it and now so can you. And we stand ready to assist you in implementing this method in your states.'#alpoliticshttps://al.com/news/2024/01/ag-steve-marshall-expects-other-states-to-follow-alabamas-textbook-nitrogen-execution.html…", "Here is the answer I got from Britt’s spokesman Sean Ross. I don’t think it answers the question and as you can see I have asked for further clarification.", "Lots of you have shared this with me. I have asked Britt’s spokesman for comment. I’ll let you know what I find out. For what it’s worth, I’ve followed Katz for years and have thought highly of his work going back to when he was an AP reporter in Haiti. x.com/NickKnudsenUS/…", "An innocent man, Toforest Johnson, is on Alabama’s death row. Former GOP and Dem Alabama officials have called for him to be set free. Steve Marshall has fought in court to kill him anyway. Instead, he defends Trump."], "NPR": [], "TPUSA": ["Dear colleges,\n\nPlease stop teaching our kids Marxism.\n\nThanks,\nAmerica", "Exciting news!@SenTedCruzwill be joining us at#AMFEST2023!\n\nCome together with 10,000+ patriots next week for the nation’s largest multi-day conservative gathering:http://AMFEST.COM", "The Founding Fathers would revolt if they saw America’s tax burden today.", "Do you support using the U.S. military to protect the southern border from the illegal immigrant invasion?", "12 years of championing truth, leading the culture war,andempowering the next generation of patriots.\n\nThis is just the beginning.@charliekirk11", "\"Hang on to that 2nd Amendment of yours for dear life!\"@EvaVlaar#AmFest2023", "BREAKING: Turning Point USA Students File Federal Lawsuit Against SUNY Cortland for Discrimination Based on Views@tpusastudents", "\"This is an invasion.\"\n\nSAY IT LOUDER FOR THE PEOPLE IN THE BACK", "Argentina President Javier Milei STICKS IT to the WEF", "4-year-old Stone Hicks, battling end-stage kidney disease, gets his wish of becoming a police officer in Orlando, Fl.\n\nI’m not crying; you’re crying", "Pastor@revwutruthSILENCED at NJ School Board Meeting\n\nLast night, Pastor John Amanchukwu attended the Old Bridge Township School District board meeting in Old Bridge, NJ. With over 200 people in attendance, Pastor John delivered a message in support of parents but was shut"], "mmpadellan": ["While Democrats push for ceasefireandhumanitarian aid inGaza, Republicans like Rep. Tim Walberg call for the slaughters of Palestinian children, \"It should be like NagasakiandHiroshima.\"\n\nThis should be a much bigger story.", "BREAKING: Hamas has tentatively accepted the ceasefire proposal!!!!!", "As aMuslim, \na father, \na brother,\na son,\nan American,anda human being\n\nI am APPALLED at the heinous, horrendous attacks against civilians inIsraelthis weekend. You don't need to fit neatly into ANY category besides \"decent human being\" to condemn the atrocities we saw", "Israelhas a right to exist.\nPalestine has a right to exist.\nA two-state solution is the ONLY way forward.\nBOTH need to be free of terrorist violence, retaliatory violence, settler violence,andoccupier violence.\nFree of violence, PERIOD.\n\nBoth sides have suffered tremendous", "While Democrats push forceasefireand humanitarian aid in Gaza, Republicans like Rep. Tim Walberg call for the slaughters of Palestinian children, \"It should be like Nagasaki and Hiroshima.\"\n\nThis should be a much bigger story.", "BREAKING:Hamashas tentatively accepted theceasefireproposal!!!!!", "WOW.\n\nSenator Chuck Schumer called BenjaminNetanyahu\"an obstacle to peace,\" and \"too willing to tolerate the civilian toll in Gaza,\" and called for Israel to hold new elections to replace him.\n\nSenator Schumer is 100% right.", "As a Muslim, \na father, \na brother,\na son,\nan American,\nand a human being\n\nI am APPALLED at the heinous, horrendous attacks against civilians in Israel this weekend. You don't need to fit neatly into ANY category besides \"decent human being\" to condemn the atrocities we saw"], "charliekirk11": ["BREAKING: According to AP, Hamas has told QatarandEgyptian mediators that it will accept terms of a ceasefireandprisoner swap withIsrael. This comes asIsraelwas preparing a ground siege on Rafah, the last Hamas stronghold inGaza.", "Hundreds of Israelis deadandinjured. 50+ Israeli hostages. Hamas militias killing innocents in their homes, 2,200 missiles launched in an unprovoked, surprise attack...\n\nMSNBC: \"I couldn’t think of a better gift for Benjamin Netanyahu right now than this kind of incursion...\"", "Six days after Oct. 7th, I went on the PBD Podcastandasked a series of questions about what Israeli intelligence failures happened that allowed Hamas to massacre 1,200 civilians. The clip went viralandI was attacked as an antisemiteandcalled worse than a \"Holocaust denier.\"", "Days before the Oct. 7 Hamas attack onIsrael, stock traders magically began anticipating events to come:\n\nResearch by law professors Robert Jackson Jr from NYUandJoshua Mitts of Columbia reveals MASSIVE short-selling leading up to the attacks:\n\nThe short-selling before Oct. 7", "BREAKING: According to AP,Hamashas told Qatar and Egyptian mediators that it will accept terms of aceasefireand prisoner swap with Israel. This comes as Israel was preparing a ground siege on Rafah, the lastHamasstronghold in Gaza.", "Hundreds of Israelis dead and injured. 50+ Israeli hostages.Hamasmilitias killing innocents in their homes, 2,200 missiles launched in an unprovoked, surprise attack...\n\nMSNBC: \"I couldn’t think of a better gift for BenjaminNetanyahuright now than this kind of incursion...\"", "Son ofHamasleader, Mosab Hassan Yousef, denouncedHamasand converted to Christianity after witnessing their savagery: \n\n\"They don't care for the Palestinian people. They don't regard human life. I saw their brutality firsthand....If they succeed in destroying Israel and", "Six days after Oct. 7th, I went on the PBD Podcast and asked a series of questions about what Israeli intelligence failures happened that allowedHamastomassacre1,200 civilians. The clip went viral and I was attacked as an antisemite and called worse than a \"Holocaust denier.\""], "robreiner": ["Faith leaders tell us that Christian Nationalism is not only a threat to Democracy, but to Christianity itself. GodandCountry opens nationally in theaters today. If you’re in LA, join director Dan Partland at the Landmark theatre for a screeningandQ&A.", "Voters in Penn., Michigan, Wisconsin, Arizona, Nevada, Georgia, N. Carolinaandevery other state must be clear eyed when casting your vote. If the Convicted Felon wins, it will be the last vote you cast that will count. Kamala Harris will save our Democracy. Vote wisely.", "It’s time to stop fucking around. If the Convicted Felon wins, we lose our Democracy. Joe Biden has effectively served US with honor, decency,anddignity. It’s time for Joe Biden to step down.", "If Biden stays in the race, every day from now until Nov.5, the focus will be on whether or not he falters. To save Democracy, this cannot be a referendum on Joe Biden. It must be a referendum on a Convicted Felon who wants destroy 250 years of self rule. Biden must step down.", "It’s time to stop fucking around. If the Convicted Felon wins, we lose our Democracy. Joe Biden has effectively served US with honor, decency, and dignity. It’s time for Joe Biden to step down.", "Voters in Penn., Michigan, Wisconsin, Arizona, Nevada, Georgia, N. Carolina and every other state must be clear eyed when casting your vote. If the Convicted Felon wins, it will be the last vote you cast that will count. Kamala Harris will save our Democracy. Vote wisely.", "Once again the Convicted Felon breaks the law. He illegally goes to Arlington Cemetery to take a campaign photo op over the grave of a fallen soldier whose death he was responsible for. Just another day at the office for the most disgusting human being to ever seek the presidency", "The United States Supreme Court has just let Trump get away with shooting someone on 5th Avenue."], "davidsirota": ["here are examples of my \"deafening silence\" onIsrael-Palestine", "Sirota has been one of the great disappointments. His silence has been deafening. x.com/acabthearab/st…", "MUST READ: Right-wingIsraeladvocacy groups intervened in Democratic primaries to crush progressives, including a pro-Israel Jewish Democratic congressman.\n\nThe tactic has helped deter Democratic congressional opposition toIsrael's war inGaza.", "- Hamas terrorism is not justifiable/defensible.\n\n-Israel's violent response is not justifiable/defensible.\n\nMost people in the real world I've talked to acknowledge both truths.\n\nMany on this website will not acknowledge both truths for fear that it may prevent a Twitter dunk.", "Pretending to be powerless is Democrats' patented move - their special technique to insist they can't ever do anything. \n\nBiden has pulled this multiple times before - now he's trying to do it onIsrael-Palestine. \n\nDon't fall for it - he's not powerless.", "Harris needs to break from Biden’s policy of unwavering, unconditional support ofNetanyahu’s government. A clear break needs to happen as soon as possible.", "Completely insane that they are havingNetanyahudo an address. Rewarding one of the worst people in history with a platform. Disgusting.", "Friendly reminderthat Schumer and Jeffries both signed off on an active war criminal, Netanyahu addressing Congress in what will be one of the darkest, ugliest moments in U.S. modern history!", "here are examples of my \"deafening silence\" on Israel-Palestine", "Sirota has been one of the great disappointments. His silence has been deafening. x.com/acabthearab/st…", "-Hamasterrorism is not justifiable/defensible.\n\n- Israel's violent response is not justifiable/defensible.\n\nMost people in the real world I've talked to acknowledge both truths.\n\nMany on this website will not acknowledge both truths for fear that it may prevent a Twitter dunk."], "blacks4peace": ["The Black Alliance for Peace was at the#March4Palestinerally in Washington, DC today#FreePalestine", "Fascism is already here! The U.S. can see us telling people the truth about their crimes so they call us foreign puppetsandtry to silence us. In reality the foreign power backing  puppet governments is them!", "African Stream is under attack!", "The Kenyan people stand by Haiti! The ongoing invasion is the will of the United Statesandthe Western back puppet government in Kenya. The people say free Haiti", "To the people of Haiti we are sorry! We are not complacent and we are doing everything within our power to make sure that this Neo colonial project under dictator Ruto is defeated. The imperialist offensive in Haiti shall be humiliated and defeated.", "A peoples-centered Zone of Peace in Our Americas requires rejecting western imperialist intervention in Haitiandall of our nations. We call for movements across the Americas to support the Haitian people’s popular sovereigntyandself-determination!#HandsOffHaiti", "The Black Alliance for Peace was at the#March4Palestinerally in Washington, DC today#FreePalestine", "MIT student organizers at the Students AgainstGenocideEncampment join the call to stand firm against foreign interference in Haiti. Haitians deserve self-determination to address their own political affairs without external meddling.@mit_caa#HandsOffHaiti#FreePalestine", "A peoples-centered Zone of Peace in Our Americas requires rejecting western imperialist intervention in Haiti and all of our nations. We call for movements across the Americas to support the Haitian people’s popular sovereignty and self-determination!#HandsOffHaiti", "Happy birthday to the young revolutionary Fred Hampton dedicated his life to the liberation of all Africans!", "Born on this day in 1948."], "people4liberty": [], "HouseDemocrats": ["Today marks 11 years since 20 studentsand6 educators were killed in a devastating mass shooting at Sandy Hook.\n\nHouse Democrats stand ready to act to protect our kidsandour communities.\n\nA future free of gun violence is possible if our colleagues have the courage to act.", "Jim Jordan is a MAGA extremist. \n\nHe led the fight to overturn the 2020 election,andnow wants to criminalize abortionandslash Social SecurityandMedicare. \n\nHe’s unfit to lead the People’s House.", "Democracy is on the line, but MAGA Republicans continue to side with Vladimir Putin.", "As Ukrainian troops run out of ammo, MAGA Republicans continue to do the bidding of Vladimir Putin.\n\nTheir inaction is putting democracy at risk at homeandabroad.", "Today marks 11 years since 20 students and 6 educators were killed in a devastating mass shooting at Sandy Hook.\n\nHouse Democrats stand ready to act to protect our kids and our communities.\n\nA future free of gun violence is possible if our colleagues have the courage to act.", "Jim Jordan is a MAGA extremist. \n\nHe led the fight to overturn the 2020 election, and now wants to criminalize abortion and slash Social Security and Medicare. \n\nHe’s unfit to lead the People’s House.", "House Democrats are ready to keep the government open and help everyday Americans.\n\nWe rejected House Republicans’ extreme cuts and worked towards bipartisan funding bills that create jobs, protect our freedoms and lower the cost of living.\n\nThat’s putting People Over Politics.", "As Ukrainian troops run out of ammo, MAGA Republicans continue to do the bidding of Vladimir Putin.\n\nTheir inaction is putting democracy at risk at home and abroad."], "TeamWarnock": [], "BadFaithPod": [], "kylegriffin1": ["Sen. Raphael Warnock is now calling for a ceasefire inGaza.", "Secretary of State Antony Blinken says the U.S. has submitted a draft resolution to the UN Security Council calling \"for an immediate ceasefire\" inGaza— \"tied to the release\" of hostages held by Hamas.", "Breaking:\n\nWASHINGTON (AP) — Biden says 'I'm not supplying the weapons' ifIsraellaunches assault onGaza's Rafah, after US paused bomb shipment.", "President Biden: \"I am outragedandheartbroken by the deaths of seven humanitarian workers from World Central Kitchen, including one American, inGazayesterday. They were providing food to hungry civilians in themiddleof a war. They were braveandselfless. Their deaths are a", "BREAKING. Vice President Harris on Israel-Gaza:\n\n\"Israel has a right to defend itself, and how it does so matters.\"\n\n\"The images of dead children and desperate, hungry people fleeing for safety, sometimes displaced for the second, third or fourth time — we cannot look away in the", "Secretary of State Antony Blinken says the U.S. has submitted a draft resolution to the UN Security Council calling \"for an immediateceasefire\" in Gaza — \"tied to the release\" of hostages held byHamas.", "Breaking:\n\nWASHINGTON (AP) — Biden says 'I'm not supplying the weapons' if Israel launches assault on Gaza's Rafah, after US paused bomb shipment.", "Sen. Raphael Warnock is now calling for aceasefirein Gaza."], "PalmerReport": ["#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow", "Senile Donald Trump doesn’t appear to know whatIsraelis anymore:", "Hey Jake TapperandDana Bash, if you’re not willing to push back on a candidate who’s claiming that babies are being aborted after they’re born, then quit your fucking jobsandgo work at a Wendy’s", "President Biden saysIsraelandHamas have agreed to the framework for a ceasefire. Congrats to Biden on a huge diplomatic victory on the world stage.", "#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow#BanAssaultWeaponsNow", "President Biden says Israel andHamashave agreed to the framework for aceasefire. Congrats to Biden on a huge diplomatic victory on the world stage.", "Senile Donald Trump doesn’t appear to know what Israel is anymore:", "But then that’s how you keep audiences coked up on outrage, right? Convince them that the other side’s leaders are infinitely powerful and are going to magically win each battle no matter what, so the audience might as well just give up and start angrily raging about defeat now."], "StatusCoup": ["\"I have been toGazatwice now....I saw horrifying injuries that indicated deliberate [Israeli] targeting of children. I saw a 19-month old girl who had been shot in the leg by a quadcopter while she was playing outside her family tent,\" -ER Dr. Tammy Abughnaim onGazahorror", "\"I met Al Goreandhe looked at meandhe said 'what [Norfolk Southern] is doing to you people is criminal.'\" -EastPalestine resident Darren Gamble. His wife Stella has had dizziness, headaches, & intestinal issues after Norfolk Southern derailmentandchemical detonation. \n\n1/3", "Zionists ASSAULT Pro-Palestine Protesters Outside the Los Angeles Auction ofGazaland. Unprovoked punching, kickingandmore can be seen as LAPD does nothing.\n\nVia Tina-Desiree Berg", "Zionists follow Pro-Palestine Jewish protesters to their car, harassingandthreatening them the entire way. \"All your beards, all fake! Cut them off b*tch! Cut them off!\" One yells at one point.\n\nVia@JonFarinaPhoto", "\"At the age of 18, Ezgi went as part of our socialist delegation to Standing Rock in solidarity with the movement protesting the Dakota Access Pipeline...that should give your viewers a sense of who she was\" -@cmkshamaon the IDF killing 26-year-old American Aysenur Ezgi Eygi", "\"I have been to Gaza twice now....I saw horrifying injuries that indicated deliberate [Israeli] targeting of children. I saw a 19-month old girl who had been shot in the leg by a quadcopter while she was playing outside her family tent,\" -ER Dr. Tammy Abughnaim on Gaza horror", "Zionists ASSAULT Pro-Palestine Protesters Outside the Los Angeles Auction of Gaza land. Unprovoked punching, kicking and more can be seen as LAPD does nothing.\n\nVia Tina-Desiree Berg", "EXCLUSIVE: Palestinian-American Layla Elabed broke down in tears while speaking w/ VP Harris before MI rally yesterday. Elabed tells us VP Harris will \"100 percent\" lose MI if she doesn't announce Gaza policy change & meet demands of Uncommitted movement.\n\nFULL INTERVIEW below..."], "POLITICO": ["Protesters calling for a ceasefire in theIsrael-Hamas conflict interrupted President Biden’s campaign speech at a historic South Carolina church.\n\nChants of “cease-fire now” were eventually drowned out by “four more years” at the campaign event.https://politi.co/3tK7M94", "These trauma surgeons thought they’d seen the worst of the worst. But nothing they’d experienced prepared them for the horrors they found inGaza, as civiliansandchildren suffer underIsrael’s bombing campaign.\n\nTwo weeks inside aGazahospital", "Palestinian death toll inGazasurpasses 25,000", "Burns says cease-fire is needed to help starving children inGaza", "These trauma surgeons thought they’d seen the worst of the worst. But nothing they’d experienced prepared them for the horrors they found in Gaza, as civilians and children suffer under Israel’s bombing campaign.\n\nTwo weeks inside a Gaza hospital", "Protesters calling for aceasefirein the Israel-Hamasconflict interrupted President Biden’s campaign speech at a historic South Carolina church.\n\nChants of “cease-fire now” were eventually drowned out by “four more years” at the campaign event.https://politi.co/3tK7M94", "Harris makes a forceful case for Israel-Gaza cease-fire afterNetanyahumeeting", "Biden speaks withNetanyahuas Israel andHamasmove closer to cease-fire"], "marceelias": ["We are not done fightingandwe are not done winning.", "BREAKING: 9th Circuit upholds district court’s decision BLOCKING Montana’s voter registration penalty law.\n\nMy legal team did it again--striking down a voter suppression law and enfranchising our clients and the voters of Montana!https://democracydocket.com/cases/montana-double-voter-registration-penalty-challenge/…", "Where are the so-called \"moderate\" Republicans denouncing this?  Where is the GOP legal establishment that is supposedly committed to the rule of law?\n\nThe truth--they don't exist. It's just proud MAGAandscared MAGA.", "NEW: New Georgia Project Action Fund files motion to fight right-wing lawsuit to facilitate mass voter challenges. Proud that my law firm is part of the effort to protect voters in Georgiaandaround the country.", "Don't miss@briantylercohenandme discuss the time Lou Dobbs told the GOP to pay me $500 million to stop beating them in court.", "Where are the so-called \"moderate\" Republicans denouncing this?  Where is the GOP legal establishment that is supposedly committed to the rule of law?\n\nThe truth--they don't exist. It's just proud MAGA and scared MAGA.", "We are not done fighting and we are not done winning.", "BREAKING: 9th Circuit upholds district court’s decision BLOCKING Montana’s voter registration penalty law.\n\nMy legal team did it again--striking down a voter suppression law and enfranchising our clients and the voters of Montana!https://democracydocket.com/cases/montana-double-voter-registration-penalty-challenge/…", "Today was the kind of day that proves that if you aren't paying attention to the courts, you aren't paying attention to democracy.   \n\nSign-up now to stay informed.https://democracydocket.com/me-newsletters/", "Republicans in the Ohio State Senate seem to have lost their minds and I'm living there rent free...\"Elias is D.C.’s alpha attorney. The Democrat’s wartime consigliere. Their fixer. The guy they send to make election recounts turn the Democrats’ way.\"https://ohiosenate.gov/news/on-the-record/citizens-not-politicians-is-actually-run-by-democratic-party-bosses-from-the-dc-swamp…"], "TuckerCarlson": ["The assassination failed, so they took out Biden. Jack Posobiec on how America changed forever in eight days.(1:00) Reacting to Joe Biden Dropping Out of the Race\n(17:25) Kamala Harris\n(28:01) Female Leadership\n(33:12) Trump Shooting Timeline\n(1:01:48) What Was the Shooter’s", "We’re clearly heading toward war with Iran. Is there any scenario where that’s a good thing for the United States? A definitive answer from Jeffrey Sachs.(1:21) Ukraine Is Losing Their War\n(10:14) The Potential for Nuclear War\n(25:07) Will We Go To War With Iran?\n(47:06) Who’s", "Blinken claims we’re bombing Yemen to protect oppressed poor people,andno doubt to protect democracy. Please. This is the next step toward full scale war with Iran, which the foreign policy ghouls in Washington have been fantasizing about for decades. Keep that in mind as this", "The attacks by the Houthis are hurting people around the world – especially the poorest and most vulnerable populations, including in Yemen and Gaza.", "Lindsey Graham’s latest scheme is convincing Republicans that it’s somehow better to loan Zelensky $60 billion, rather than give it to him. Some are falling for this. But it’s fraudulent. Ukraine will never repay the debt,andwe’ll never make them. This is just a more dishonest", "(2:00) Col. Douglas Macgregor\n(4:20) Threats to the homeland\n(6:12) Iran & its missiles\n(13:00) Going intoGaza(19:40) American hostages\n(22:45) Impact on the American economy", "(0:00) Vivek attacked for opposing World War III\n(3:00) The potential for disaster in America\n(5:00) What does an Israeli ground invasion mean?\n(9:30) The appropriate response to Hamas\n(14:25) The real threat of nuclear war", "Jeffrey Sachs with probably the smartestandmost accurate assessment of the Ukraine war,andAmerican foreign policy more broadly, ever caught on tape.\n\n(20:17) Why did America push for Ukraine to Join NATO?\n(58:34) What is a Neocon?\n(1:25:28) Regime Change Never Works\n(1:36:27)", "Ep. 70  Governments colluded to shut downanddestroy Russell Brand. This is his first interview since that happened. Watch it when you get a minute. It's one of the most brilliant explanations of the modern world you'll ever hear.", "Ep. 37 The two defining tragedies of our time — the war in Ukraineandthe presidency of Joe Biden — are both finally coming to an end.\n\nTIMESTAMPS:\n(00:17) Glenn Greenwald joins\n(05:41) Will the Ukraine War Hawks ever apologize?\n(07:25) Using foreign wars to punish Americans", "Fifty years to the day after Richard Nixon’s resignation, newly-unearthed documents show Watergate was a scam from start to finish. Geoff Shepard saw it happen. The parallels to what’s currently happening to Trump are remarkable.(0:51) Who Is Geoff Shepard?\n(2:22) What Was", "Rep. Thomas Massie doesn’t care what you think of him, which is pretty great.(3:19) Where Does US Debt End?\n(10:32) Why Massie Voted 15 Times Against Funding Israel\n(14:53) AIPAC\n(34:04) Mitch McConnell\n(42:25) Area 51\n(50:32) Massie's Relationship with Trump\n(57:09) Kill", "Jeffrey Sachs with probably the smartest and most accurate assessment of the Ukraine war, and American foreign policy more broadly, ever caught on tape.(20:17) Why did America push for Ukraine to Join NATO?\n(58:34) What is a Neocon?\n(1:25:28) Regime Change Never Works\n(1:36:27)", "Ep. 71  Bret Weinstein traveled to the Darien Gap to understand who's behind the invasion of our country. His conclusion: “it's not a friendly migration.”", "Ep. 69  War with Iran? Yes. We’re already in it. Joe Kent did 11 combat tours in the U.S. Army. His wife Shannon was killed serving in Syria. Here’s his informed view of what that war will mean."], "DworkinWeekly": ["Who else thinks James Comer should resign?\n\nRead thisandlet us know.", "Democrats will win big in November because of the Biden Harris ticket!#WeBackBidenHarris", "Who else thinks James Comer should resign?\n\nRead this and let us know."], "elonmusk": ["If you teach that “weak makes right”, then the perceived stronger party – in this case,Israel– is wrong.\n\nMorals should be taught in the absolute, meaning that it is possible for either the strong or weak to be morally good, depending on their actions.", "Khamenei’s official position is clear that the eradication ofIsraelis the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violenceandvengeance.\n\nStoking the fires of hatred isn’t", "Khamenei’s official position is clear that the eradication ofIsraelis the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violenceandvengeance.\n\nStoking the fires of hatred isn’t", "Starlink is now active in aGazahospital with the support of@UAEmediaofficeand@Israel", "Khamenei’s official position is clear that the eradication of Israel is the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violence and vengeance.\n\nStoking the fires of hatred isn’t", "Khamenei’s official position is clear that the eradication of Israel is the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violence and vengeance.\n\nStoking the fires of hatred isn’t", "Yes, “decolonization” necessarily implies a Jewishgenocide, thus it is unacceptable to any reasonable person", "“Martyrs” is not an objective or accurate word, nor is “murdered”.\n\nThe former implies dying for a cause in battle and the latter implies a deliberate attempt to kill those specific people.\n\nWhile reporting both sides is fair, please use maximally accurate words or I must"], "EliasLawGroup": [], "JoyAnnReid": [], "1819News": [".@asthegirlturns: Alabamians fight back against Haitian migration#alpolitics", "Athens residents petition Councilman Chris Seibert to resign for allegedly profiting off of Haitian migrants#alpoliticsBy@danieltaylornow", "'Join me in praying for himandfor our country' – Alabama lawmakers 'thankful' Trump unharmed in second assassination attempt#alpoliticsBy@CraigMonger1819", "'It’s hurting us': Sylacauga residents voice opposing opinions on Haitian resettlement during contentious city council meeting#alpoliticsBy@CraigMonger1819", "Tuberville's resolute stance, even in the face of widespread criticism, highlights the importance of having leaders who are willing to protect life and uphold the law.", "Governor Kay Ivey said on Thursday she was siding with Texas over the federal government in a border conflict heating up this week.", "U.S. Sen. Tommy Tuberville (R-Auburn) has firmly opposed the continued funding of Ukraine and pairing Ukraine aid with support for Israel.", "'If we don’t do something, you don’t get anything': Tuberville calls for halting aid to Israel, Ukraine until Biden deals with southern border crisis"], "itsJeffTiedrich": ["Donald Trump could stand in themiddleof Fifth Avenueandshoot someoneandThe New York Times would explain that Trump didn't mean it", "I wrote a thing: \"shove your thoughtsandprayers\" — we've been thinkingandpraying since Columbine,andit hasn't done shit.\nthanks for reading,andplease sign up for my daily newsletter so you never miss a post —https://bit.ly/3MznMk4", "#BREAKING: Well-Regulated Militia Opens Fire In Apalachee High School In Winder, Georgia; Cheap ThoughtsAndUseless Prayers Now Being Rushed To The Scene ... more on this soon-to-be-forgotten-and-then-repeated story as it develops ...", "I wrote a thing: \"The New York Times hits a new low in false equivalencies\" — there’s nothing the Grey Lady can’t both-sides.\nthanks for reading,andplease sign up for my daily newsletter to keep getting the good stuff —https://bit.ly/3XxHbs9", "hey, remember when Jared Kushner brought peace to the Middle East? me neither", "hey, remember when Jared Kushner brought lasting peace to the Middle East? me neither", "I wrote a thing: \"no, you fucking ghouls, school shootings don’t have to be a ’fact of life’\" — every other country in the world thinks we’re nuts.\nthanks for reading, and please sign up for my daily newsletter to keep getting the good stuff —", "Donald Trump praisingHamasis all the proof you need that the family of raccoons that live inside his head have finally chewed through all the wires"], "RacePowerPolicy": [], "chkbal": ["The need to defend the Constitution transcends political differences & competing legal philosophies.\n\nThe question is now about first principles: Will you put the rule of law over partisanship?\n\nWe are living thru a Constitutional emergency. We must act like it.\n\nVia@gtconway3d", "\"People question how exactly the retribution would take place. Because, after all, Trump is going to have to go through the Justice Dept. \n\nSo the Justice Dept. will be—along with the Defense Dept.andthe intelligence community—bearing the brunt of the retribution presidency.\"", ".@gtconway3don@cspanwj: \"The mission is to protect the rule of law at a time when it is seriously under threat. \n\nWe are trying to get the message out about the dangers that we face.\"", ".@judgeluttig: \"The former presidentandhis administration pushed beyond the boundaries of the Constitutionandthe laws of the United States, into democracy itself.\"", "The need to defend the Constitution transcends political differences & competing legal philosophies.\n\nThe question is now about first principles: Will you put the rule of law over partisanship?\n\nWe are living thru a Constitutional emergency. We must act like it.\n\nVia@gtconway3d", "\"People question how exactly the retribution would take place. Because, after all, Trump is going to have to go through the Justice Dept. \n\nSo the Justice Dept. will be—along with the Defense Dept. and the intelligence community—bearing the brunt of the retribution presidency.\"", ".@gtconway3don@cspanwj: \"The mission is to protect the rule of law at a time when it is seriously under threat. \n\nWe are trying to get the message out about the dangers that we face.\"", ".@judgeluttig: \"The former president and his administration pushed beyond the boundaries of the Constitution and the laws of the United States, into democracy itself.\""], "wabenews": ["Morehouse School of Medicine's first cohort of rural doulas just graduated. The doulas are slated to begin working with pregnantandpostpartum patients this year in a state that has one of the highest rates of maternal mortality in the country.", "Morehouse School of Medicine's first cohort of rural doulas just graduated. The doulas are slated to begin working with pregnant and postpartum patients this year in a state that has one of the highest rates of maternal mortality in the country."], "bluestein": ["A large crowd gathered at Georgia Tech today to rally for Jewish students who feel threatened by recent campus demonstrations. Similar rallies are being held all over Georgia campuses now.", "The VP briefly addressed the growing conflict in theMiddleEastafterIsraelretaliated for rocket attacks by targeting a Hezbollah commander.", "Biden’s speech ends after he speaks of theIsrael-Hamas war in broad terms, saying the conflict is “heartbreaking”andthat he’s working to bring it to an end. His address is well received by students, alumniandtheir families — who cheer as he’s given an honorary degree.", "Pro-Palestinian protesters chanted “Genocide Joe has got to go”and“Biden should be doing time” at the Fulton County Democratic Party’s holiday party tonight until they were kicked out by police.#gapol", "Protesters disrupted our county party holiday happy hour at Manuel’s Tavern while chanting “from the river to the sea.”", "Georgia, you can breathe a sigh of relief. It’s SINE DIE. \n\nPhew.", "“Shawn,” the president said, “I wish I didn’t have to make this call … I know there’s nothing anybody can say or do to ease the pain. I’ve been there.”", "The VP briefly addressed the growing conflict in the Middle East after Israel retaliated for rocket attacks by targeting a Hezbollah commander.", "Biden’s speech ends after he speaks of the Israel-Hamaswar in broad terms, saying the conflict is “heartbreaking” and that he’s working to bring it to an end. His address is well received by students, alumni and their families — who cheer as he’s given an honorary degree."], "UALawSchool": [], "OccupyDemocrats": ["BREAKING: Second Gentleman Doug Emhoff unleashes a brutal attack on Donald Trump, ripping into him as a \"known antisemite\" after his MAGA campaign releases a Nazi dog whistle video referencing a \"unified Reich.\"Andit gets even better...\n\nEmhoff, who is Jewish, posted a video", "BREAKING: President Biden scores a huge foreign policy win as he finally convincesIsraelto allow humanitarian aid to flow across the border from Egypt intoGaza— giving relief to the embattled, starving, thirsty Palestinians.\n\nIsraeli Prime Minister Benjamin Netanyahu said", "BREAKING: The father of a Sandy Hook school shooting victim rips into Republican billionaire Elon Musk for letting Alex Jones back on Twitter, says it proves that Musk is a full-blown \"sociopath.\"\n\nHe did not his mince words....\n\nMusk, who is always looking to pander to", "BREAKING: President Biden slams Republican billionaire Elon Musk for his recent shocking antisemitism, calling it \"unacceptable\"anda \"hideous lie.\"\n\nThis is EXACTLY how you stand up to MAGA bigotry...\n\nIt all started when Musk responded to a jaw-dropping tweet that alleged that", "BREAKING: President Biden scores a huge foreign policy win as he finally convinces Israel to allow humanitarian aid to flow across the border from Egypt into Gaza — giving relief to the embattled, starving, thirsty Palestinians.\n\nIsraeli Prime Minister BenjaminNetanyahusaid", "BREAKING: President Biden slams Republican billionaire Elon Musk for his recent shocking antisemitism, calling it \"unacceptable\" and a \"hideous lie.\"\n\nThis is EXACTLY how you stand up to MAGA bigotry...\n\nIt all started when Musk responded to a jaw-dropping tweet that alleged that", "BREAKING: Republican 2024 presidential candidate Donald Trump launches a dangerous, vile, and racist attack against President Obama over the Hammas attacks against Israel. \n\nOn Truth Social today, Trump posted, “The same people that raided Israel are pouring into our once", "Shoot first, ask questions later is DeSantis's brand of justice.https://occupydemocrats.com/2023/10/15/homicidal-stone-cold-dead-desantis-refuses-to-back-down/…"], "toddcstacy": ["Prattville vs Enterprise in the first round of the playoffs.#alpolitics", "Prattville vs Enterprise in the first round of the playoffs.#alpolitics"], "krystalball": ["Bibi’s been the main obstacle to a ceasefire the entire time so he can fuck right off with this hissy fit over some long overdue mild criticism.", "Israeli Prime Minister Benjamin Netanyahu was upset by Vice President Kamala Harris' on camera statement after their meeting & is concerned it will harm negotiations over a Gaza hostage & ceasefire deal, per Israeli official. My story on@axioshttps://axios.com/2024/07/26/israel-netanyahu-harris-ceasefire-hostage-deal-talks…", "Member of Netanyahu’s party defends starving civilians. Half of Gazans are already facing starvationand90% regularly go entire days without eating.", "\"בלי רעב וצמא אצל האוכלוסייה העזתית לא נצליח לגייס משת\"פ, לא נצליח לגייס מודיעין, לא נצליח לשחד אנשים, באוכל, בשתייה, בתרופות, כדי להשיג מודיעין ואנחנו יודעים שמציאת החטופים היא מטרה עליונה וסופר חשובה לצד מטרות הלחימה.\" - כך אמרה ח\"כ טלי גוטליב במליאת הכנסת@TallyGotliv", "Likud Knesset MemberandFormer Minister of Information calls for genocide: \n\"Gazashould be erased.Andfireandsmoke on the heads of the Nazis in JudeaandSamaria...A vengefulandcruelIDFis needed here. Anything less is immoral. Just unethical.\"", "Read this report. This investigation reveals based on audio, videoandeyewitnesses accounts that Palestinians were massacred by Israeli tanksandguns. TheIDFversion of events is a lieandeven the doctored video the Israelis released undercuts their fabrication.", "Brief statement: Euro-Med’s initial inquiries confirm Israel’s involvement in killing and wounding dozens of starving civilians in Gazahttps://euromedmonitor.org/en/article/6196", "Bibi’s been the main obstacle to aceasefirethe entire time so he can fuck right off with this hissy fit over some long overdue mild criticism.", "Israeli Prime Minister Benjamin Netanyahu was upset by Vice President Kamala Harris' on camera statement after their meeting & is concerned it will harm negotiations over a Gaza hostage & ceasefire deal, per Israeli official. My story on@axioshttps://axios.com/2024/07/26/israel-netanyahu-harris-ceasefire-hostage-deal-talks…", "This is exactly the sort of abhorrent logicHamasused to justify their slaughter of innocent Israelis", "Mast: I think when we look at this, as a whole, I would encourage the other side to not so lightly throw around the idea of innocent Palestinian civilians. I don't think we would so lightly throw around the term innocent Nazi civilians", "The campus crackdown is so unhinged and desperate because the progenocidecrowd has lost the debate so badly. \n\nAmericans:\nOppose aid to60-40\nSupport aceasefire67-22\nDisapprove ofActions in Gaza 55-45\nSayhas “Gone too far” 50-15\nSayis Prob or Def Committing", "JUST IN: Columbia University has announced classes will be remote for the rest of the year as anti-Israel protests rock the school. \n\nThere are now growing calls for tuition refunds for the $70k a year college now that it has practically turned into an online school.\n\n\"It’s vital", "Likud Knesset Member and Former Minister of Information calls forgenocide: \n\"Gaza should be erased. And fire and smoke on the heads of the Nazis in Judea and Samaria...A vengeful and cruel IDF is needed here. Anything less is immoral. Just unethical.\""], "SarcasmStardust": ["FuckIsrael. It was never about Hamas. It was never about hostages (shit they’ve been killing their own this whole time). It has always been a genocideandsilencing anyone who called it out. Like Shireen. \n\nWho terrorizes a FUNERAL???Israel. That’s who.https://x.com/day_walker110//day_walker110/status/1721135166880461046…", "Israelbombed homes.Israelbombed schools.Israelbombed hospitals.Israelbombed churches.Israelbombed evacuees.Israelbombed journalists.Israelbombed UN workers.\n\nBut they want you to believeIsraelis “good”andPalestinians are “evil.”", "Israel bombed homes.\nIsrael bombed schools.\nIsrael bombed hospitals.\nIsrael bombed churches.\nIsrael bombed evacuees.\nIsrael bombed journalists.\nIsrael bombed UN workers.\n\nBut they want you to believe Israel is “good” and Palestinians are “evil.” x.com/Kahlissee/stat…", "It’s been cut in half.AndMANY of those civilians were, in fact, killed byIsrael. \n\nBuncha clowns. \n\nEmbarrassed for anyone who blindly believed their bullshit despite their history of lying their faces off for decades.", "Israel just revised it’s Oct 7 civilian death toll again. This time down to: 695", "Israelhas been kidnapping Palestinians for decades. Including hundreds of children each year. Maybe if CNN had cared to report on it before now we wouldn’t be in this position. However much you hate mainstream media, it’s not enough.", "Israeli occupation soldiers denied CNN journalists access to film near the Sde Teiman military base in Israel, where investigations confirm that hundreds of Palestinians abducted from Gaza are being systematically tortured.", "Fuck Israel. It was never aboutHamas. It was never about hostages (shit they’ve been killing their own this whole time). It has always been agenocideand silencing anyone who called it out. Like Shireen. \n\nWho terrorizes a FUNERAL??? Israel. That’s who.https://x.com/day_walker110//day_walker110/status/1721135166880461046…", "Israel has targeted and murdered over 130 journalists in the past 9 months. \n\nFuck Israel.", "Guess what, I am supposed to report on the killing of my colleague and friend now", "How is it possible that Israel is being accused of committing agenocide? Because it’s committing agenocide. \n\nHope that helps. \n\nFuck Israel.", "All the UN bodies and its institutions have become weapons against Israel in the hands of Hamas terrorists. How is it possible that the Convention for the Prevention of Genocide, which was adopted after the Holocaust, is currently being used in the UN against the Jewish state,", "It’s been cut in half. And MANY of those civilians were, in fact, killed by Israel. \n\nBuncha clowns. \n\nEmbarrassed for anyone who blindly believed their bullshit despite their history of lying their faces off for decades.", "Israel just revised it’s Oct 7 civilian death toll again. This time down to: 695"], "GunnelsWarren": ["Price controls are good, actually:\n\nPrice of Ozempic (costs $5 to make)$969$155#122$59  \n\nPrice of Wegovy (costs $5 to make)$1,349$186$92\n\nLife Expectancy77.582828181", "Jamie Dimon became a billionaire after hisbankreceived a $416 billion taxpayer bailout while he was on the NY Fed, was fined $13 billion for mortgage fraud, illegally foreclosed on military families & avoided taxes through offshore tax scams.\n\nJamie Dimon is addicted to greed.", "JUST IN: Jamie Dimon says the U.S is addicted to debt and it’s created a dangerous “sugar high” in the economy.\n\nHe points to the enormous surge of new debt taken on during the pandemic\n\nHe says that money is like \"heroin\" in the hands of consumers\n\n\"We're on this sugar high and", "You wanna talk about destruction?Israelhas destroyed 84% ofGaza’s healthcare facilities & all ofGaza’s universities. Instead of parroting Netanyahu’s talking points, maybe you could interview just one of the hundreds of thousands of children inGazawho are facing starvation.", "Today: Destruction, violence and hate overtake college campuses across the country with Jewish students feeling unsafe at their own schools. It is unacceptable, and harkening back to the 1930s in Europe. Our@InsidePoliticsshow open, here.", "A 95% windfall profits tax on big corporations isn't radical. It's exactly what we did during World War II to stop companies from price gouging. What's radical is Chevron increasing its profits by 289% compared to pre-pandemic levels while their products destroy the planet.", "BREAKING: Bernie Sanders announces legislation to impose a 95% windfall tax on excess profits of large corporations, per MorePerfectUnion", "Jamie Dimon became a billionaire after his bank received a $416 billion bailout and was fined:\n\n$13 billion for mortgage fraud\n$614 million for predatory lending\n$31 million for foreclosing on military families\n\nNow, Trump is floating him as Treasury Secretary? Give me a break.", "Here's the truth: the billionaire class is fine with corporate socialism when it means they get billions in tax breaks and bailouts.", "Reminder: When Democrats banned assault weapons in 1994 mass shootings went down by 43%.\n\nWhen Republicans let the assault weapons ban expire in 2004 mass shootings skyrocketed by 245%.\n\nWe should NEVER be shy to point these facts out over and over again. Ban assault weapons.", "A 95% windfall profits tax on big corporations isn't radical. It's exactly what we did during World War II to stop companies from price gouging. What's radical is Chevron increasing its profits by 289% compared to pre-pandemic levels while their products destroy the planet.", "BREAKING: Bernie Sanders announces legislation to impose a 95% windfall tax on excess profits of large corporations, per MorePerfectUnion", "You wanna talk about destruction? Israel has destroyed 84% of Gaza’s healthcare facilities & all of Gaza’s universities. Instead of parrotingNetanyahu’s talking points, maybe you could interview just one of the hundreds of thousands of children in Gaza who are facing starvation.", "Today: Destruction, violence and hate overtake college campuses across the country with Jewish students feeling unsafe at their own schools. It is unacceptable, and harkening back to the 1930s in Europe. Our@InsidePoliticsshow open, here."], "ABC": ["JUST IN: Multiple strikes rockGazaasIsraelretaliates after the weekend's unprecedented attacks from Hamas.\n\nSome 130 targets have been struck inGazain the past 3 hours,IDFsays.https://trib.al/nPlwFuJ", "LATEST: Sen. Cory Booker was inIsraelfor several days of planned meetingsandwas in Jerusalem when the attacks began, a spokesperson said in a statement. He sheltered in place with his staffandsafely departed the country earlier Sunday.", "Israeli police announce the cabinet decided the supply of electricity, fuelandgoods to theGazaStrip will be suspended.\n\nFollow live updates:https://trib.al/gBSJxbo", "People have taken to the streets ofTelAvivin protest of the Israeli government, blaming Israeli Prime Minister Netanyahu for not protectingIsrael's citizens.\n\nFollow live updates on theIsrael-Gazaconflict:https://trib.al/8XcAdA1", "\"We can't go back to the status quo that allowed this to happen in the first place.\"\n\nSec. of State Antony Blinken denouncedHamas' war crimes on Friday saying there can \"be no more business as usual withHamas,\" and calling their actions \"unconscionable.\"\n\nHe also said the U.S.", "BREAKING: IDF releases video showing the moment Israeli hostages released byHamasamid cease-fire cross into Israeli territory. \n\nLive updates on the Israel-Hamascease-fire:https://trib.al/1y5MrUV", "BREAKING: Pres. Biden condemnsHamas' attacks on Israel as \"an act of sheer evil.\"\n\n\"More than 1,000 civilians slaughtered in Israel. Among them, at least 14 American citizens killed.\"https://trib.al/yolqXrj", "JUST IN: Multiple strikes rock Gaza as Israel retaliates after the weekend's unprecedented attacks fromHamas.\n\nSome 130 targets have been struck in Gaza in the past 3 hours, IDF says.https://trib.al/nPlwFuJ"], "LeverNews": ["Why would only 7.5% of House members support a ceasefire inGazawhile 66% of Americans want one?\n\nWe explain how AIPAC stifles dissent", "Watch@Maddow's coverage of The Lever's exclusive story showing J.D. Vance recently pressured federal regulators to let local police access women's private medical records to try to prosecute them for seeking abortion services. \n\nOriginal story here:https://levernews.com/j-d-vance-wants-police-to-track-people-who-have-abortions/…", "What stage of capitalism is it when the tax dollars you are paying to fund public universities are then used by those universities to lobby lawmakers to keep your medicine prices high?", "INVESTIGATION: Public universities are fighting a federal initiative to lower the price you are charged for medicines developed at taxpayer expense. \n\nThe schools are reaping profits off the high prices, according to documents obtained by@LeverNews.https://levernews.com/universities-are-making-billions-gatekeeping-your-meds/…", "“Democracy has disappeared in several other great nations — not because the people of those nations disliked democracy, but because they had grown tired of unemploymentandinsecurity…In desperation, they chose to sacrifice liberty in the hope of getting something to eat.” — FDR", "NEW DATA:  10 of the largest food corporations have announced they're paying out $77 BILLION to shareholders - as Americans are now paying 25% more for groceries & restaurant food.\n\nThere are now 3.5 million more households that are food insecure.https://levernews.com/big-food-big-profits-big-lies/…", "Why would only 7.5% of House members support aceasefirein Gaza while 66% of Americans want one?\n\nWe explain how AIPAC stifles dissent", "NEW: CEOs were caught on tape bragging that they were fueling inflation by raising prices to boost profits. \n\nMedia blamed inflation on workers & spending & lawmakers then threw millions off the social safety.\n\nBut it was a lie. \n\nHere’s the truth", "NEW: Project 2025 is the final stage of a secret plan written by the Supreme Court justice who gave corporations the same rights as people.\n\nOn 8/13, we begin releasing never-before-seen documents about the scheme. \n\nWatch below, retweet & subscribe.http://MasterPlanPodcast.com", "So it begins:\n\nThe US Air Force is refusing an EPA order to clean up drinking water it polluted with forever chemicals, citing SCOTUS’ gutting of the Chevron doctrine."], "AnnCoulter": ["The only promise he kept.\n\n<<After Trump won the GOP primary in 2016, Adelson offered him $20 million in exchange for moving the U.S. Embassy inIsraelfromTelAvivto Jerusalem.>>", "Every time I think I could vote for him to protest the border ...\n\nHaaretz: 'Trump Is Desperate for Miriam Adelson's Cash. Her Condition: West Bank Annexation'", "I don't want any of them here, but I don't hear anyone saying that, only \"Intifada! Intifada!\"", "They are here, chanting “Death to Jews…”  This is on the@UCLAcampus.", "When Muslims in Canada drove their trucks through the streets, celebrating the slaughter inIsrael, you figure Justin Trudeau froze any of theirBankaccounts?", "My win-win solution for the insolubleIsrael-Palestinian conflict! \n\nWe take all their Palestiniansand, in exchange,Israeltakes all our illegals.", "Hey!  No more pro-Hamasstuff on this site!", "Hamas would literally murder every single one of these people x.com/EndWokeness/st…", "He only had so much time!!!!  How about Haley bragging that SHE didn’t have to call out the Nat Guard in to stop riots… after the shooting at a black church.\n\nThere were no riots.  Desantis prevented riots while the rest of the country burned in 2020.", "Yes, everyone wanted to move to Florida under DeSantis, so rents went up. But DeSantis should have said that. x.com/AnnCoulter/sta…", "I don't want any of them here, but I don't hear anyone saying that, only \"Intifada! Intifada!\"", "They are here, chanting “Death to Jews…”  This is on the@UCLAcampus.", "My win-win solution for the insoluble Israel-Palestinian conflict! \n\nWe take all their Palestinians and, in exchange, Israel takes all our illegals."], "TexasTribune": ["Beryl did between $1.2 billionand$1.3 billion worth of damage to CenterPoint's electricity infrastructure, the company said Tuesday.\n\nThose costs will likely be passed on to customers, who could see a 2% increase on their bills for the next 15 years.", "Breaking: A Travis County district judge has granted a temporary restraining order allowing a pregnant Dallas woman, whose fetus has a lethal abnormality, to have an abortion.", "More than 80 music artistsandmultiple panelists have canceled appearances at SXSW over the U.S. Army’s sponsorship of the event.", "Update: The five fires in the Texas Panhandle have burned 975,000 acres — more than double the landmass of Houston — as residents have fled or sheltered in place.", "Judge rejects Attorney General Ken Paxton’s attempt to shut down Houston immigrant rights group\n\nPaxton’s office claimed the group broke rules prohibiting political activity by nonprofits, but the judge rejected the case outright.", "Houston ISD superintendent accused of funneling tax dollars out of state.", "NEW: Texas firefighters have completely contained the Smokehouse Creek fire in the Panhandle after battling the deadly and destructive inferno for nearly three weeks.https://bit.ly/48Vi3xL", "El Paso judge blocks Ken Paxton’s efforts to subpoena Annunciation House, suggesting the attorney general may want to shut down the network of migrant shelters for political reasons."], "RedState": ["J.D. Vance Is That Symbol of Unity Trump Is Looking For", "BREAKING: Iran Bombs U.S. Consulate, Takes Credit in Massive Escalation", "WATCH: Ted Cruz Gives Passionate Speech, Remembers Victims of Biden-Harris Open Border Policy", "Kash Patel: Senior Military Officials Intentionally Delayed National Guard Deployment on January 6th", "Steve Garvey Destroys Adam Schiff, Says Turning on Biden Shows 'Selfish Desperation'", "Kash Patel: Senior Military Officials Intentionally Delayed National Guard Deployment on January 6th", "How Many More Bodies Will Be Buried Before Somebody Stops Biden’s Illegal Invasion at The Border?", "BREAKING: Iran Bombs U.S. Consulate, Takes Credit in Massive Escalation"], "DemocracyDocket": ["Wisconsin Sen.@tammybaldwinis running for reelection to win back voters' rightsandfreedoms. She joined us for our Candidate Q+A series to discuss her stance on voting rightsandthe fight against election misinformation. \n\nWatch the full interview:https://youtube.com/watch?v=XlNLeja2BcI…", "As governor of Minnesota, Tim Walz:Restored voting rights to over 55,000 peopleSigned the Minnesota Voting Rights ActEstablished automatic voter registration\n\nRead more about his record on voting rights:https://democracydocket.com/news-alerts/tim-walz-is-kamala-harris-vp-pick-heres-his-record-on-voting-rights/…", "Once Again The Courts Protected Democracy", "Today is the 59th anniversary of Bloody Sunday when Rep. John Lewisandothers marching for voting rights were brutally attacked by state troopers in Selma.\n\nLet's honor their work by passing the John R. Lewis Voting Rights Advancement Act to protect voting rights for all.", "UPDATE: The 5th Circuit expedited this appeal given upcoming election deadlines and temporarily paused the lower court's decision until Nov. 2, while Galveston officials' request for a long-term pause is considered. This means the blocked map is temporarily back in place.", "UPDATE: Galveston officials have appealed this decision to the 5th Circuit to reinstate the previous map. The district court rejected their request to pause the decision pending appeal. x.com/DemocracyDocke…", "Despite Ohio GOP’s Efforts to Silence Us, the People of Ohio Won", "Unmasking the Anti-Democracy Agenda of Project 2025", "Today is the 59th anniversary of Bloody Sunday when Rep. John Lewis and others marching for voting rights were brutally attacked by state troopers in Selma.\n\nLet's honor their work by passing the John R. Lewis Voting Rights Advancement Act to protect voting rights for all.", "Once Again The Courts Protected Democracy", "Ohio Attorney General Dave Yost (R) accepted new ballot language for a proposed independent redistricting commission measure after the group behind the proposal fixed a small language typo.", "An Arizona judge dismissed a pair of lawsuits seeking to decertify the state's 2022 general election results and ordered sanctions for failed Republican attorney general candidate Abraham Hamadeh and his lawyer. The judge called the challenge “meritless.”"], "SteveSchmidtSES": ["\"IfIsraeldoesn't win this waranddoesn't do what is necessary to defend civilization, then we will have another ISISandthey will come for us.\"\n\nMore on why we must stand shoulder to shoulder withIsraelto defeat the evil of Hamas:https://youtu.be/UTRHWAeRx9Q", "\"The corruption of one man inIsraelhas brought the whole world to the brink of war because his corruptionandweakness stirred evil,andwhen evil sees weakness, it strikes.\"\n\nMore on how corrupt politicians like NetanyahuandTrump threaten the world:https://youtu.be/r4gBjhnOy_k", "\"Israelwill defend itselfandAmerica will stand firm by her side because the lessons of history are clear. Never again wasn't a slogan. It was the most essential moral lesson in human history.\"\n\nMore of my thoughts on what the American response should be to Hamas' attack:", "More than 100 people participated in a flash hora in Toronto to celebrate Jewish culture in the midst of a significant rise in antisemitism in both Canadaandworldwide. What a great show of solidarity.#stopantisemitism#neveragain", "\"If Israel doesn't win this war and doesn't do what is necessary to defend civilization, then we will have another ISIS and they will come for us.\"\n\nMore on why we must stand shoulder to shoulder with Israel to defeat the evil ofHamas:https://youtu.be/UTRHWAeRx9Q", "\"How could it conceivably be denied and forgotten within a single human lifetime when there are still nearly a quarter million survivors of the Nazi extermination camps?\"\n\nToday marks International Holocaust Remembrance Day and it's never been more important to remember:", "\"Israel will defend itself and America will stand firm by her side because the lessons of history are clear. Never again wasn't a slogan. It was the most essential moral lesson in human history.\"\n\nMore of my thoughts on what the American response should be toHamas' attack:", "\"The prime minister, who has prided himself on his vast political experience and irreplaceable wisdom in security matters, completely failed to identify the dangers he was consciously leading Israel into when establishing a government of annexation and dispossession.\"\n\nThese"], "TheWeekendMSNBC": ["Project 2025, the Heritage Foundation’s brainchild, has a plan to prep new recruits for a possible Trump Administration--replacing at least 50,000 federal workers@MichaelSteeleputs the plan's top architect@KevinRobertsTXin the hot seat on why.", "“These are the individuals who are in that video that former President Donald Trump is praising down in Mar-a-lago.”@_marcanthony4says plainly why violent Jan. 6 rioters deserve no reward for their actions.", "“As a person with an actual womb that is not true.”@SymoneDSandersfact checks@KevinRobertsTXon Project 2025’s stance that proposes “abortion is not health care.”", ".@MayorGilesshares why his choice to endorse VP Harris instead of Donald Trump is personal for him as he continues to serve the city of Mesa, AZ.", "Project 2025, the Heritage Foundation’s brainchild, has a plan to prep new recruits for a possible Trump Administration--replacing at least 50,000 federal workers@MichaelSteeleputs the plan's top architect@KevinRobertsTXin the hot seat on why.", "“We do not reward the bare minimum.” Rep.@JasmineforUSbreaks down why she and other House Democrats will not save Speaker Mike Johnson from losing his job.", ".@MayorGilesshares why his choice to endorse VP Harris instead of Donald Trump is personal for him as he continues to serve the city of Mesa, AZ.", "“We are focused like a laser.”@harrisonjaimetalks DNC strategy to take back the House this November."], "SocialistMMA": ["Netanyahu is getting peace loving Jewish people arrested for protesting the war crimes he was found guilty committing by the ICC\n\nAnother example of how Zionism is the height of antisemitism \n\nZionism makes Jewish people LESS SAFE", "Jews in the United States getting arrested on behalf of Israel's Netanyahu", "Israelcommits crime of the century as they slaughter Palestinians in Rafah\n\nZionism is currently the most barbaric ideology in the world", "Israelannounces war crimesandatrocities are planned forGazaCritical support for the Palestinians#FreePalestine", "Israelconsistently breaks ceasefireandthe western media just uncritically repeats Israeli propaganda denying it \n\nIt happens overandover again.Israelhas zero credibilityandshould NEVER be trusted", "Israel really tried to claim that it was H*mas violated the ceasefire, ending hostage negotiations. \n\nNot only is this a lie w/ plenty of evidence to debunk this bs. But the REAL reason behind them jumping to make this claim will piss off even Israelis.", "Israel commits crime of the century as they slaughter Palestinians in Rafah\n\nZionism is currently the most barbaric ideology in the world", "“The United States is controlling the war in Gaza, and it is the United States that must pay the price for the crimes perpetrated by the Israelis in Gaza and by the Americans in Iraq and elsewhere.”\n\nAddress by Hezbollah Chief Nasrallah that was viewed by millions around the", "Hamashas utterly defeated Israel. Israel getting buried on the battlefield AND diplomatically", "Ireland, Norway and Spain announce they are officially recognizing Palestine as an independent state.", "So when these IDF snipers retire from the IDF, after having a kill count of DOZENS of women and children, I am supposed to pretend they are civilians thatHamasshouldn’t go after?\n\nThis is why the concept of an Israeli citizen I struggle with. They are all forced to join the IDF", "Since the early morning in Jabalia refugee camp, we have retrieved around 70 decomposed bodies. Most of them were children and women who were killed by Israeli snipers while attempting to flee the camp from bombs."], "ajamubaraka": ["Exactly. Especially don't fall for the hustle of conflating opposition to the criminality of the Israeli state with antisemitism. The veil has been lifted & everyone now sees the reality of the Israeli settler state. There is no reversal back to the mythology ofIsrael.", "It's not necessary to \"condemn Hamas and antisemitism\" in your support for Palestinian liberation. These disclaimers only feed into the propaganda and distract from the real issue at hand: Israel's 75-year occupation, ethnic cleansing, illegal expansion, apartheid, and genocide.", "The issue is the murderous occupation thatIsraelhas been allowed to imposed now for 75 years. The \"collectiveWest\" has been silent as the apartheid state waged war on Palestinians. Now that the war has been brought toIsrael, we are supposed to be outraged.", "When a murderous occupation makes peaceful resistance impossible, it makes violent resistance inevitable.#Israel#FreePalestine#EndApartheidx.com/ProudSocialist…", "The arrogance of the oppressors telling the oppressed who their leaders should be. The Palestinian resistance goes beyond \"Hamas\" & is why the Israeli fascists are killing people in theWestBank! They understand that it is the Palestinian resistance that they must tryandkill.", "There must be no conflation between Hamas and the Palestinians. \n\nPalestinians deserve equal measures of safety and security, self-determination, and dignity.\n\nWe have been very clear that the rules of war must be adhered to and that there be humanitarian aid that flows.", "If these images remind you of other scenes of white mobs attacking the humanity of non-Europeans it is because that is exactly what is in play here. Zionism has finally been exposed for the racist doctrine it is & the Israeli society exposed as a sick white supremacist entity.", "US citizens: these are the Zionist colonists your tax dollars sustain while they destroy the aid you also pay for, all so their military can commit a genocide your government denies", "The Houthis say stop the slaughter in Gaza and they stop interrupting shipping in the Red Sea. Hezbollah says the people of Northern Israel can return home when Israel stops killing Palestinians in Gaza. Why does the U.S. continue supporting the racist terror in Gaza?", "We demand@JoeBidenand@KamalaHarrisavert the impending Middle East war by ending Israel’s genocide in Gaza now.\n\nThe long-feared regional war is looming in the Middle East and could easily spin out of control into a wider conflict. The Biden-Harris administration is pouring", "Since the Israeli fascist correctly understand that the Palestinian resistance resides in the hearts and minds of the people their strategy is simple - kill as many of the people as possible.Genocideand settler colonialism cannot be separated.", "Terrifying footage captured by Aljazeera’s cameraman in Jabaliya tonight -where IOF pounded the camp with over 100 bombs as quadcopters fired at civilians taking shelter in nearby schools. Safety is an illusion. Humanitarian zones a deception.", "Yes cut off support. The U.S. population should not be compelled to be accomplices in criminality. That is why the people must also call for the prosecution of Israeli & U.S. officials responsible forgenocidein Gaza. END IMPUNITY.", "With Netanyahu refusing a Palestinian state, Israel's only \"solution\" for Palestinians is driving them out, killing them, or keeping them in a perpetual state of brutal apartheid. \n\nThis is the opposite of what the US claims to stand for.\n\nCut off support for Israel now. x.com/kthalps/status…", "This systematic slaughter of Palestinians is the most obscene expression of white supremacy that the mass public has ever been exposed to. If Palestinians had not been racialized as non-European & thus less \"human\" this slaughter would have been stopped.", "An Israeli airstrike on the U.N.-run al-Sardi school in central Gaza has killed at least 40 people, including 14 children.@UNRWAspokesperson@TamaraAlrifaisays the agency “has paid the highest toll ever\" over the past eight months of Israeli attack."], "AJC": ["WATCH: Shawn SandersandOneida Oliver-Sanders were in their living room Tuesday morning, less than 48 hours after learning that their 24-year-old daughter, Spc. Kennedy Ladon Sanders, was killed in a weekend drone attack on U.S. service members in Jordan. Then President Joe", "The parents of Spc. Kennedy Ladon Sanders, one of three U.S. reservists from Georgia killed in the drone strike in Jordan, received a phone call from President Biden, offering condolencesandpromoting her posthumously to sergeant. Read more:https://bit.ly/3HGf7tJ", "Mayor Andre Dickens was in Memphis on Friday, when the water woes began,anddid not return until Saturday.\n\nHe started posting updates nearly 24 hours after many city residents started facing reduced water pressure or no service at all.\n\nA number of people have said they first", "BREAKING: Two days after massive water main breaks led to widespread outages across Atlanta, authorities announced they were investigating two new potential main breaks at EuclidandNorth avenuesandat 1190 Atlantic Drive NW.", "WATCH: Shawn Sanders and Oneida Oliver-Sanders were in their living room Tuesday morning, less than 48 hours after learning that their 24-year-old daughter, Spc. Kennedy Ladon Sanders, was killed in a weekend drone attack on U.S. service members in Jordan. Then President Joe", "BREAKING: Fulton County Chief Judge Ural Glanville will no longer be in charge of the ongoing gang and racketeering trial against Atlanta rapper Young Thug and his alleged associates.https://bit.ly/3Y3u02M", "The parents of Spc. Kennedy Ladon Sanders, one of three U.S. reservists from Georgia killed in the drone strike in Jordan, received a phone call from President Biden, offering condolences and promoting her posthumously to sergeant. Read more:https://bit.ly/3HGf7tJ", "From Atlanta Journal-Constitution cartoonist Mike Luckovich: Rosalynn’s farewell"], "gtconway3d": [".@DouglasKMurrayto@piersmorgan:\n\n“The thing that struck me, Piers, about seeing the 7th of October footage, was that even the Nazis were actually ashamed of what they did.  SS battalions who spent their days shooting Jews in the back of the headandpushing them into trenches,", "“There is no moral equivalency here. Let's be clear: Hamas shares no values with any Western academic institution. Hamas is an organization that has repeatedly pledged to annihilateIsraelandits people.\n\n“Its ideology is antithetical to the values of human lifeandthe liberal", "This powerful letter is in my view right. I am very disappointed in the response of most leading American universities, including Harvard, to the events of October 7th. Any university with an anti-bullying policy needs to consider what has gone on.\n\nThe Association of University", "Bibi:  the shekel stops anywhere but here", "STUNNING:  Netanyahu believes that the security establishment let the atrocities of Oct 7 happen in order to bring him down. \n\nThis, per@DaphnaLiel, one of Israel's most mild-mannered and no-nonsense political reporter@N12News.x.com/brown_johnbrow…", "“TheIDFissued rare public statements in recent months, warning that military deterrence was deteriorating. Netanyahuandradical members of his cabinet derided the officials as part of the protest movement,andthe protesters as ‘anarchists,’ asserting that the status quo with", "Israel amassed troops in the West Bank. Then Hamas attacked from Gaza.https://wapo.st/46HTVhr", ".@DouglasKMurrayto@piersmorgan:\n\n“The thing that struck me, Piers, about seeing the 7th of October footage, was that even the Nazis were actually ashamed of what they did.  SS battalions who spent their days shooting Jews in the back of the head and pushing them into trenches,", "“The IDF issued rare public statements in recent months, warning that military deterrence was deteriorating.Netanyahuand radical members of his cabinet derided the officials as part of the protest movement, and the protesters as ‘anarchists,’ asserting that the status quo with", "Israel amassed troops in the West Bank. Then Hamas attacked from Gaza.https://wapo.st/46HTVhr", "I apologize for using the word “fighters” here. I should have used the word “terrorists.”\n\nWe have been reading and listening to too many news reports referring toHamasmembers as “fighters” or “militants,” and it’s easy to pick up the bad habit. \n\nBut the attackers were not", "Also, proportional response doesn’t mean that Israel can’t do more damage than was done to it.  Israel is entitled to use the amount of force necessary to destroy or ameliorate the threat—Hamas.  And if Hamas puts noncombatant Gazans at risk by storing ammo and equipment and x.com/JRubinBlogger/…", "“There is no moral equivalency here. Let's be clear:Hamasshares no values with any Western academic institution.Hamasis an organization that has repeatedly pledged to annihilate Israel and its people.\n\n“Its ideology is antithetical to the values of human life and the liberal", "This powerful letter is in my view right. I am very disappointed in the response of most leading American universities, including Harvard, to the events of October 7th. Any university with an anti-bullying policy needs to consider what has gone on.\n\nThe Association of University"]}