{"anthonyzenkus": ["They release this the day we find out thatIsraelbombedandkilled 12 children from one family in a spree of bombings in Rafah last night.", "Innocent civilians have been targetedandkilled byIsrael. This has come out in Israeli press. We supplied the bombs despite this. BodenandUS gov are culpable.", "You forgot \"andforceIsraelto accept a permanent ceasefireandwithdrawal fromGazaandtheWestBankandwe must enact a weapons embargo onIsrael\".", "Retired Israeli military personnel confirm: Yes, Biden could end the genocide with one phone call.Andhe could have done it at any time whileIsraelwas slaughtering 13,000 babiesandchildren. He chose not to. This is Biden's genocide.https://motherjones.com/politics/2024/03/joe-biden-israel-gaza-war-netanyahu-rafah-palestinians/…", "Joe Biden just approved a billion dollars worth of bombsandbullets to go toIsraelso they can slaughter Palestinians in Rafah.  So all you Democrats who said \"look,  Biden is putting his foot down withIsrael\" - we know you -andyour genocidal president-  were full of shit.", "It's not a stretch that a partyanda president who allows 68K Americans to die each year so they can keep taking donations from private insurance would also allow 2 million Palestinians to be genocidedandstarved to death so they can keep taking donations from AIPAC.", "InGaza, starving children are dying of hypothermia. Newborn babies of malnourished mothers are dying after a few days. This is famine, this is genocideandit all could have been stopped with one phone call from Joe Biden.", "Instead of solving the United States' housing crisis, the Biden-Harris administration gave billions toIsrael, whose settlers are stealing homes from Palestinians in the occupiedWestBank.", "UN expert: \"Gaza is complete and utter carnage\". He said it's the worst thing he's ever seen. Israel is perpetrating the worst humanitarian crisis in modern times, aided and abetted by Joe Biden and the US government. No, a \"pause\" is not enough. We need a full#CeasefireNOW.", "Breaking: The Lancet - one of the most respected medical journals in the world - estimates that even if Israel halted hostilities immediately, the total death toll of Palestinians in Gaza would reach at least 186,000, including indirect deaths from disease, starvation, lack of", "Israel has resumed its genocidal attacks on the people of Gaza. Children are suffering the most as Israel's forces bomb close to the largest functioning hospital left standing in Gaza. Biden is complicit. It is time to#StopArmingIsrael. \n\n(report from UN - UNICEF spokesperson)", "Latest Gaza Casualty Numbers\nTotal dead: 24,285\nTotal wounded: Over 60 000\nTotal killed, injured or missing: 1/20 Palestinians\n\nGazagenocide: brought to you by Israel, sponsored by Joe Biden and the US War machine"], "jimmy_dore": ["This is AMAZING. Watch as Trumps says it is not the Palestinians blocking peace, but   Netanyahu that doesn't want to make a  deal  & is BLOCKING A PEACE DEAL. \n\nThis confirms everyone's suspicions that Netanyahu's plan all along was to wipe out the Palestinians, move those that", "The JIMMY DORE SHOW Is Live! NOW!IsraelTargeted & Killed Its Own Civilians on Oct 7!\nFrench Left Scores BIG Electoral Victory!\n\nFeaturing:\nMax Blumenthal@MaxBlumenthalStef Zamorano@miserablelibNow streaming on Rumble, YouTube & Rokfinhttps://rumble.com/v562os3-idf-targeted-israeli-civilians-on-oct.-7-french-lefts-big-electoral-victory.html…", "It’s been like this since 1948, but modern day Zionists are such depraved blood thirsty maniacs that even Americans are waking up:", "The JIMMY DORE SHOW Is Live! NOW!Israel’s Brutal Response OnGaza!\nMORE Covid Censorship!\n\nFeaturing Dr. Peter McCullough@P_McCulloughMD,\nJackson Hinkle@jacksonhinklle, \nKurt Metzger@KurtMetzger& Stef Zamorano@MiserableLibEXCLUSIVELY ON RUMBLE!https://rumble.com/v3omif6-israels-brutal-response-on-gaza-more-covid-censorship-w-jackson-hinkle-and-.html…", "This is AMAZING. Watch as Trumps says it is not the Palestinians blocking peace, butNetanyahuthat doesn't want to make a  deal  & is BLOCKING A PEACE DEAL. \n\nThis confirms everyone's suspicions thatNetanyahu's plan all along was to wipe out the Palestinians, move those that", "The JIMMY DORE SHOW Is Live! NOW!HamasStages Brazen Attack Inside Israel!NetanyahuDeclares War on Gaza! \n\nFeaturing Norman Finkelstein@normfinkelstein,\nKurt Metzger@KurtMetzger& Mischa Paullin@mickmackpaullinNow streaming on Rumble, YouTube & Rokfin!", "It’s been like this since 1948, but modern day Zionists are such depraved blood thirsty maniacs that even Americans are waking up:", "The JIMMY DORE SHOW Is Live! NOW!\n\nIsrael Targeted & Killed Its Own Civilians on Oct 7!\nFrench Left Scores BIG Electoral Victory!\n\nFeaturing:\nMax Blumenthal@MaxBlumenthalStef Zamorano@miserablelibNow streaming on Rumble, YouTube & Rokfinhttps://rumble.com/v562os3-idf-targeted-israeli-civilians-on-oct.-7-french-lefts-big-electoral-victory.html…"], "CapitolJournal": [], "DavidAFrench": ["I think about these charts quite a bit. If you want to know why people often freak out when you talk about crossing party lines, they're operating under false impressions about the other side. People consistently think their opponents are more extreme than they really are /1", "He's pro-choice.\n\nEvery single pro-life evangelical voting for him is voting for a man who is pro-choice *and* found liable for sex abuse by a jury of his peers. \n\nI never, ever thought I'd see this day. To restore the pro-life movement in the GOP, he has to lose.", "\"I think the six week is too short, there has to be more time,\" former President Trump says how he'll vote on an abortion rights amendment in Florida.", "This is incredible. A beautiful way to love your neighbor.", "A church in Tennessee recently paid off the medical debts of thousands of local people, adding up to $8 million.\n\nPartnering with@UndueMedDebt, The Altar Fellowship in Johnson City paid $50,000 to buy off debts owed by 3,921 households in 7 area counties.https://julieroys.com/tn-church-pays-off-medical-debt-for-thousands-to-bless-community/…", "Good. Institutional neutrality is far better than overt ideological posturing that can chill the expression of dissenting studentsandfaculty.", "BREAKING: The University of Pennsylvania has announced it will stop issuing official statements on social and political events.\n\n“It is not the role of the institution to render opinions—doing so risks suppressing the creativity and academic freedom of our faculty and students.", "This, from@BenSasse, is powerful and true. If you're going to make an institutional statement, this is how it is done:", "This is incredible. A beautiful way to love your neighbor.", "A church in Tennessee recently paid off the medical debts of thousands of local people, adding up to $8 million.\n\nPartnering with@UndueMedDebt, The Altar Fellowship in Johnson City paid $50,000 to buy off debts owed by 3,921 households in 7 area counties.https://julieroys.com/tn-church-pays-off-medical-debt-for-thousands-to-bless-community/…", "\"Ukraine is the enemy of this country.\" \n\n\"One of the greatest enemies of our nation right now is Ukraine.\"\n\n\"We should apologize to Russia\"\n\nJust wild, deranged material.", "Wow suddenly Tim Pool having takes like this makes way more sense.x.com/AricToler/stat…", "Horrifying.Hamasis pure evil. \n\nMay God bless the families of the fallen.", "Israel's health ministry says the six hostages recovered from the Gaza Strip overnight were killed between 48 and 72 hours before their autopsy, meaning between Thursday and Friday morning.\n\nIt says that an examination carried out by Abu Kabir Forensic Institute found that all"], "politicallyga": [], "BlackVotersMtr": ["Today, we honor the livesandlegacies of John LewisandC.T. Vivian, two powerful leaders of the Civil Rights Movement. On the 4th anniversary of their passing, we are reminded that their spirit endures in the ongoing struggle for equalityandjustice.", "“We are at ground zero for voter suppressionandso there’s always been 3 elements that have been a part of voter suppression in this country:\n\n1. Weaponizing the administrative process.\n2. Creating additional barriers to make access to the vote hard for people to participate.", "Hmmm. There seems to be a different vibe on our bus tours though.#TheyNotLikeUs", "Black Republicans for Trump organized a bus tour and got a tiny crowd of maybe 3 or 4 people to turn out for a rally in Baltimore. The Black people interviewed by the local TV station were not amused.", "Say it LOUD, I’m BLACKandI’m PROUD! Bus 1 is rolling through Nigton, Texas with our partners! Today, we came across voters who thought they were registered but removed from the voter rolls. Thankfully, we were able to assist in getting these issues fixed. This is why the", "Today we remember Tyre Nichols who was beaten by Memphis police officers and died 3 days later. Let's honor his memory by continuing to fight against racial injustice. His life mattered and he should still be here like countless others who lost their lives to police violence.", "The TN General assembly is voting on HB 1739 this bill would vacate the entire board of TN State, the ONLY public HBCU in Tennesseehttps://x.com/i/broadcasts/1YpJkwnAAVwJj…", "We are deeply concerned by the recent ruling of Louisiana Supreme Court Judge Bleich, overturning the election of Chief Henry Whitehorn as the first Black sheriff of Caddo Parish. \n\nThis decision is unjust and another attempt to suppress the power of Black voters in our country.", "Following the 2020 Election, more than 400 voter suppression bills were introduced because of HISTORIC BLACK VOTER TURNOUT, not voter fraud.\n\nWe call on Congress to pass the John Lewis Voting Rights Act and the Freedom to Vote Act.#VotingRightsOnJuneteenth#WeFightBack"], "washpost": [], "AmyMcGrathKY": ["Veterans don't want to see other veterans attacked for service. We all know what it's like to serve. You often don’t get a choice whether you “see combat” or not. We talked about@JDVanceand@Tim_Walzon@MSNBC@DeadlineWH- take a look.", "Great news. Thanks to the professional diplomatsandUS govt folks who worked behind the scenes to make this happen!", "Evan Gershkovich, Alsu Kurmasheva, Paul Whelan. Free. Amazing.#IStandWithEvan", "The vast majority of these members of Congress copyandpasting their talking point that the military strikes in the ME are “way overdue” couldn’t tell where Yemen was on a map before today.", "Yemen experts tonight", "They most certainly are not warriors. They are not victims either. They should be called insurrectionists, criminals or rioters, police attackers, traitors…", "Trump: \"Those J6 warriors. They were warriors, but they were really, more than anything else, they're victims of what happened. All they were doing is protesting a rigged election...What a setup that was.\"", "Great news. Thanks to the professional diplomats and US govt folks who worked behind the scenes to make this happen!", "Evan Gershkovich, Alsu Kurmasheva, Paul Whelan. Free. Amazing.#IStandWithEvan", "On this#MemorialDay2024, we reflect on the sacrifices of those who gave their lives in defense of freedom and our nation. We honor their sacrifice by working to make our country better and defending our democracy every day forward.", "Don’t be fooled. As tragic as this day was, the sacrifices of these men and women should not be used as a political weapon. And ask yourself this question, these politicians who are so upset about this day 3 years ago because it cost our country 13 American lives, did they give a", "This was my  favorite part of his amazing speech.", "Gov. Tim Walz: \"You know, I haven't given a lot of big speeches like this one in my life. But I've given a lot of pep talks. So let me finish with this, team. It's the fourth quarter. We're down a field goal. But we're on offense. We're driving down the field. And, boy, do we"], "texasmonthly": ["Drake has purchased a 313-acre former resort outside Brenham, Texas. \n\nHere are all the most luxurious of the property’s built-in perks.", "Party officials in several counties have adopted resolutions against the grocery store magnate for a litany of alleged offenses against the state Republican platform.", "In the wake of Hurricane Beryl, Greg AbbottandDan Patrick have doubled down on their longstanding neglectandmistreatment of Texas's largest city.", "Texas's most powerful figure isn’t an elected official. But behind the scenes, theWestTexas oilman is lavishly financing what he regards as a holy war against public education, renewable energy,andnon-Christians. An in-depth report by@russellgold", "Party officials in several counties have adopted resolutions against the grocery store magnate for a litany of alleged offenses against the state Republican platform.", "In the wake of Hurricane Beryl, Greg Abbott and Dan Patrick have doubled down on their longstanding neglect and mistreatment of Texas's largest city.", "Texas's most powerful figure isn’t an elected official. But behind the scenes, the West Texas oilman is lavishly financing what he regards as a holy war against public education, renewable energy, and non-Christians. An in-depth report by@russellgold", "Attorney General@KenPaxtonTXblamed House Speaker Dade Phelan for “doxxing” him, leading to a raid at his McKinney home on New Year's day. \n\nHowever, the story isn't adding up."], "LPCO": ["The Hamas attack was as unprovoked as the Russian invasion.", "RFK/LPCO Joint Declaration of Independence from Big Government a.k.a. The Presidential Liberty PledgeYesterday, we celebrated our Independence Day! The Founding Fathers declared independence from Britainandstated, \"that whenever any Form of Government becomes destructive of", "Probably a good idea to delete your account@WoodrowForCo", "Everything the government “gives”, it took from someone else.\n\nEverything the government “produces”, it reduced from the free market.", "TheHamasattack was as unprovoked as the Russian invasion.", "Denver is NOT laying off workers due to illegal immigrant budget cuts.\n\nDenver is just reducing their hours to ZERO. Totally not the same thing.", "RFK/LPCO Joint Declaration of Independence from Big Government a.k.a. The Presidential Liberty PledgeYesterday, we celebrated our Independence Day! The Founding Fathers declared independence from Britain and stated, \"that whenever any Form of Government becomes destructive of", "Free Ross Ulbricht to make room for Anthony Fauci."], "america1stwomen": [], "TeamWarnock": [], "GaRepublicans": ["Disqualified, dishonest, disgusting.#gapol", "Statement from Georgia’s RNC Delegation.#gapol", "We are grateful to the lawyers for David Shafer & Cathy Latham for getting a stay of all proceedings as the Court of Appeals is taking our argument to disqualify Fani Willis seriously. \n\nDonate to finally bury this phony witch hunt for good:https://secure.anedot.com/gagop/donate#gapol", "Statement from Chairman@JoshMcKoonon the decision of the Georgia Court of Appeals to take up the appeal to disqualify@FaniforDAfrom her bogus case against our Presidential Electorsandformer President@realDonaldTrump#gapol#gagop", "Disqualified, dishonest, disgusting.#gapol", "Statement from Georgia’s RNC Delegation.#gapol", "We are grateful to the lawyers for David Shafer & Cathy Latham for getting a stay of all proceedings as the Court of Appeals is taking our argument to disqualify Fani Willis seriously. \n\nDonate to finally bury this phony witch hunt for good:https://secure.anedot.com/gagop/donate#gapol", "Statement from Chairman@JoshMcKoonon the decision of the Georgia Court of Appeals to take up the appeal to disqualify@FaniforDAfrom her bogus case against our Presidential Electors and former President@realDonaldTrump#gapol#gagop"], "HumanistReport": ["Rashida Tlaib as war criminal Benjamin Netanyahu attacks the ICC.", "I'm a PROUD \"gay forGaza.\" My sexual orientation has FUCK ALL to do with the slaughter of 180,000+ people, including 14,000+ children. Benjamin Netanyahu can kiss my faggot ass.", "The same fuckwads  clutching their pearls over “violence” from student protesters haven’t said SHIT about violence from pro-Israel agitators. Also, not a peep about theIDFannihilating EVERY university inGazaandposting videos about it.\n\nVile fucking cowards.", "No, they don’t support Hamas. They’re asking their government to stop sendingIsraelbombs to drop on children. Smearing them as “extremist” to support the elimination of their families is sickening,andyou should be ashamed of yourself as a “human rights lawyer.”", "“The most reasonable people ever.” \n\nThey just happen to support Hamas, engage in extremist rhetoric and excuse the atrocities of Oct 7. x.com/HumanistReport…", "Rashida Tlaib as war criminal BenjaminNetanyahuattacks the ICC.", "While you’re picking up some candy from the senator don’t try to ask him why he won’t support a Gazaceasefireunless you want to be manhandled by his goons.", "Happy Halloween! \n\nSwing by my office for some#UnionMadecandyx.com/AFLCIO/status/…", "I'm a PROUD \"gay for Gaza.\" My sexual orientation has FUCK ALL to do with the slaughter of 180,000+ people, including 14,000+ children. BenjaminNetanyahucan kiss my faggot ass.", "The same fuckwads  clutching their pearls over “violence” from student protesters haven’t said SHIT about violence from pro-Israel agitators. Also, not a peep about the IDF annihilating EVERY university in Gaza and posting videos about it.\n\nVile fucking cowards."], "BadFaithPod": [], "JoyAnnReid": [], "RalphNader": ["Over 2 million innocent Palestinians are trapped by Netanyahu’s siege, proclaimed as prohibiting “food, water, medicine, electricity, fuel.” By shutting Egypt’s Rafah entry, humanitarian aid trucks are blockedandthe Netanyahu Gazan death camp/cemetery grows larger by the day.", "Today's NYT headlines \n\nNetanyahu vows to keep up fight, 200 targets in a day\n\nGermanandBritish officials call for ceasefire\n\nWar erases full branches of Gazan family\n\nA clan loses over 100 members, including dozens of children\n\nCampus allies of Palestinians feel muzzled\n\n-R", "...direct violation of intl. humanitarian lawanda January order from the International Court of Justice. Oxfam also reported that the conditions on the ground inGazahave deteriorated rapidly in the last two months. 1.1 million people are experiencing “catastrophic hunger.”", "Headline from the Israeli newspaper@haaretzcom: \"World Central Kitchen Fed Israelis After October 7. Now It's Bringing Food to the Starving inGaza.\" On Monday, 7 of its aid workers, including an American, were incinerated by Israeli drones. The definition of state terror. -R", "See the attached protestors' sign in Chicago at the DNC overcoming the vast undercount ofNetanyahu’s genocidal slaughter of Palestinians. It is not 40,000 fatalities, which bothHamasandNetanyahulike to cite for different political reasons. The real estimate is over 300,000", "...direct violation of intl. humanitarian law and a January order from the International Court of Justice. Oxfam also reported that the conditions on the ground in Gaza have deteriorated rapidly in the last two months. 1.1 million people are experiencing “catastrophic hunger.”", "Why do all sides for different reasons use the Hama undercount of fatalities and injuries from Israel’s war crimes in Gaza? The answer comes from my article in the current issue of Capitol Hill Citizen. The probative evidence in the article points to over 300,000 deaths and", "For the 3rd time,Netanyahu's rubber stamp Joe Biden vetoed an otherwise unanimous UN Security Council backed resolution for an immediateceasefireto stop the slaughter of children, women and other civilians in Gaza and open the gates for 100s of waiting humanitarian aid trucks."], "DCExaminer": ["Republican Senators Ted CruzandMarsha Blackburn honor the 80th anniversary of D-Day on Normandy beach\n\nREAD:http://tiny.cc/6w6fyz#Senator#Senate#TedCruz#MarshaBlackburn#Left#Democrat#Republicans#US#Politics#News#Viralvideo#ViralVideos#Explore#Explorepage", "Democratic vice presidential nominee Tim Walz, on at least five occasions, hosted aMuslimcleric who celebrated Hamas‘s Oct. 7 attackandpromoted a film popular among Neo-Nazis.\n\nDETAILS:https://trib.al/BOf59BQ#timwalz#democrats#election2024#politics#usa#explorepage", "Cruz slams Bragg for dropping charges against pro-Hamas protesters at Columbia University.\n\nREAD:http://tiny.cc/9hlsyz#TedCruz#Cruz#Columbia#college#protest#news#viral#trending#Bragg#explorepage#newyorkcity", "Sen. Rand Paul questions when did the US become the 'sugar daddy of the world?'\n\nREAD:http://tiny.cc/cy8awz#RandPaul#Senator#Palestine#Israel#Gaza#Border#Left#Democrat#Republicans#US#Politics#News#Viralvideo#ViralVideos#Explore#Explorepage", "Republican Senators Ted Cruz and Marsha Blackburn honor the 80th anniversary of D-Day on Normandy beach\n\nREAD:http://tiny.cc/6w6fyz#Senator#Senate#TedCruz#MarshaBlackburn#Left#Democrat#Republicans#US#Politics#News#Viralvideo#ViralVideos#Explore#Explorepage", "Cruz slams Bragg for dropping charges against pro-Hamasprotesters at Columbia University.\n\nREAD:http://tiny.cc/9hlsyz#TedCruz#Cruz#Columbia#college#protest#news#viral#trending#Bragg#explorepage#newyorkcity", "Sen. Rand Paul questions when did the US become the 'sugar daddy of the world?'\n\nREAD:http://tiny.cc/cy8awz#RandPaul#Senator#Palestine#Israel#Gaza#Border#Left#Democrat#Republicans#US#Politics#News#Viralvideo#ViralVideos#Explore#Explorepage", "Sen. Rand Paul (R-KY) comes out swinging against Nikki Haley ahead of Iowa Caucus\n\nREAD:http://tiny.cc/n5f0wz#RandPaul#NikkiHaley#Iowa#Caucus#Left#Democrat#Republicans#US#Politics#News#Viralvideo#ViralVideos#Explore#Explorepage"], "TenthAmendment": ["\"If Congress fails to shield the States from dangers so palpableandso imminent, the States must shield themselves,andmeet the invader foot to foot.\"\n-Thomas Jefferson (19 Jan 1821)", "nailed it! Many of the founders referred to the Constitution as a mere \"parchment barrier.\"Andparchment doesn't enforce itself.\n\nLike James Madison in Federalist 48", "Dear Federal Government,\n\nGo to hell.\n\nSincerely, \n\nYour friends at the Tenth Amendment Center", "This might come as a shock - but please don't be alarmed.\n\nMost federal acts, laws, rules, regulationsandorders on the books today are not authorized by the constitution.Andthat's a huge understatement.", "\"If Congress fails to shield the States from dangers so palpable and so imminent, the States must shield themselves, and meet the invader foot to foot.\"-Thomas Jefferson (19 Jan 1821)", "Defend the Guard passed the New Hampshire House by a vote of 187-182. \n\nShould it get signed as law, the Free State will be first to take such a strong step against unconstitutional wars since 1812 - where CT, MA, RI all refused to comply with federal requisitions of their troops", "nailed it! Many of the founders referred to the Constitution as a mere \"parchment barrier.\"\n\nAnd parchment doesn't enforce itself.\n\nLike James Madison in Federalist 48", "Dear Federal Government,\n\nGo to hell.\n\nSincerely, \n\nYour friends at the Tenth Amendment Center"], "WedgeSquared": [], "OurRevolution": ["Andmaybe ask why hedge funds are buying up all the homesandturning us all into a nation of renters — then jacking up rents because they can.", "Folks, I think WE won the veepstakes#VPWalz", "\"We all do better, when we all do better.\" — Paul Wellstone", "The Uncommitted Vote in Washington state is closing in on 50k!!\n\nThat’s with 79% reporting —andcompare to just 6,450 votes in 2020.\n\nThe national total is 425kandgrowing. The call for peace inGazaanda permanent ceasefire is getting louder.", "And maybe ask why hedge funds are buying up all the homes and turning us all into a nation of renters — then jacking up rents because they can.", "The Uncommitted Vote in Washington state is closing in on 50k!!\n\nThat’s with 79% reporting — and compare to just 6,450 votes in 2020.\n\nThe national total is 425k and growing. The call for peace in Gaza and a permanentceasefireis getting louder.", "\"The cries of Palestinian and Israeli children sound no different to me. What I want to know is why do the cries of Palestinians sound different to you all?\" Solidarity with the powerful and courageous@RashidaTlaib.#CeasefireNow", "Our Executive Director@JosephGeevmakes the case for voting Uncommitted in@USATODAY!"], "theatlantic": ["\"At a military base north ofTelAviv, theIsraelDefense Forces held a grisly matinee screening of 43 minutes of raw footage from Hamas’s October 7 attack,\"@gcawwrites. Read his full report here:https://theatln.tc/ylLP85ke", "\"Neither Israelis nor Palestinians are going anywhere,andneither will give up their national identity. Those who truly want peaceandjustice in the Holy Land should start by recognizing this reality,\"@arash_tehranwrites:", "\"Againandagain, people say they intend to murder Jews,\"@Yair_Rosenbergwrites. \n\n\"Andyet, century after century, the world produces new, tortuous justifications for why anti-Jewish bigots don’t really mean what they say—even though they do.\"", "“If Americans now have anything useful to tell Israelis,” George Packer argues, it’s this: “Don’t … Don’t imagine that overwhelming military force can solve an immensely complex historicalandpolitical problem.”", "\"Again and again, people say they intend to murder Jews,\"@Yair_Rosenbergwrites. \n\n\"And yet, century after century, the world produces new, tortuous justifications for why anti-Jewish bigots don’t really mean what they say—even though they do.\"", "“If Americans now have anything useful to tell Israelis,” George Packer argues, it’s this: “Don’t … Don’t imagine that overwhelming military force can solve an immensely complex historical and political problem.”", "\"At a military base north of Tel Aviv, the Israel Defense Forces held a grisly matinee screening of 43 minutes of raw footage fromHamas’s October 7 attack,\"@gcawwrites. Read his full report here:https://theatln.tc/ylLP85ke", "\"Neither Israelis nor Palestinians are going anywhere, and neither will give up their national identity. Those who truly want peace and justice in the Holy Land should start by recognizing this reality,\"@arash_tehranwrites:"], "IngrahamAngle": ["Anti-Israelprotesters descend upon Met Gala", "Israelis willing to do what we would do: John Ratcliffe", "Netanyahu foreign policy adviser: Hamas will be dismantled.", "Hamas attack survivor: I feel more protected inIsraelthan I feel here.", "Israel is willing to do what we would do: John Ratcliffe", "Mike Pompeo:Hamaswill be the recipient of this aid", "Netanyahuforeign policy adviser:Hamaswill be dismantled.", "Hamasattack survivor: I feel more protected in Israel than I feel here."], "NextOn9NEWS": ["May we make a recommendation? Someone stole all the copies of the latest Ouray Plaindealer. Gone. You should read it, or at least its cover story, if for no other reason than because someone doesn't want you to see it.", "This week's Word of Thanks micro-giving campaign supports the nonprofit Center on Colfaxandits free mental health program for LGBTQ+ Coloradans. \nAdults can get 12 free individual counseling sessions without insurance or a referral.", "Commentary: This isn't about gun policy... it's about human decency.", "A tenant told 9NEWS that all the national media attention has created a safety hazard at the Aurora apartment complex, with people traveling in from outside the area to harass people who live there.", "May we make a recommendation? Someone stole all the copies of the latest Ouray Plaindealer. Gone. You should read it, or at least its cover story, if for no other reason than because someone doesn't want you to see it.", "This week's Word of Thanks micro-giving campaign supports the nonprofit Center on Colfax and its free mental health program for LGBTQ+ Coloradans. \nAdults can get 12 free individual counseling sessions without insurance or a referral.", "The former Colorado county clerk was found guilty of seven out of 10 counts, including four felonies, in her election interference trial.", "Commentary: This isn't about gun policy... it's about human decency."], "theadvocatebr": [], "HuffPost": ["Shocking Mass Graves AtGazaHospitals Prompt International Calls For Investigation", "Hakeem Jeffries Calls Out Samuel Alito For 'Sympathizing' With Jan. 6 Rioters", "As The GOP Slams Biden OnIsrael, No One Mentions Trump's Dangerous Intel Leak", "Israeli Airstrikes Kill Al Jazeera Reporter’s Family InGaza", "Shocking Mass Graves At Gaza Hospitals Prompt International Calls For Investigation", "Israeli Airstrikes Kill Al Jazeera Reporter’s Family In Gaza", "Capitol Rioter Who Sprayed Police With Mace Gets 2 Years In Prison", "Chef José Andrés condemned Israel’s airstrike that killed aid workers trying to deliver food to Palestinians in Gaza: “Stop using food as a weapon.”"], "foxnation": ["Remembering a legend known for his iconic voiceandproud patriotism.#TobyKeith#RememberingTobyKeith", "A very HAPPY BIRTHDAY to the woman who does it all -@abbyhornacek!", "No holding back!@JudgeJeaninegives her unfiltered take on Kamala Harris with@KellyannePollsby her side. \n\nCatch it all on#HeresTheDealhttps://bit.ly/3S288kq", "An unknown number, a pink pacifier,anda prayer for the best.@KayleighMcEnanyremembers the exact moment she got a call from President Trump to be press secretary.#LoveMomhttps://bit.ly/4bqRzWA", "Remembering a legend known for his iconic voice and proud patriotism.#TobyKeith#RememberingTobyKeith", "No holding back!@JudgeJeaninegives her unfiltered take on Kamala Harris with@KellyannePollsby her side. \n\nCatch it all on#HeresTheDealhttps://bit.ly/3S288kq", "A very HAPPY BIRTHDAY to the woman who does it all -@abbyhornacek!", "An unknown number, a pink pacifier, and a prayer for the best.@KayleighMcEnanyremembers the exact moment she got a call from President Trump to be press secretary.#LoveMomhttps://bit.ly/4bqRzWA"], "TomFitton": ["Black for Palestine: Meet Rashida Tlaib's favoriteIsrael-hating group with terror tieshttps://washingtonexaminer.com/news/house/palestine-rashida-tlaib-israel-terror-ties-hamas…", "\"On Tuesday night, protesters vandalized the homes of Brooklyn Museum Jewish board membersandthe co-op building of museum director Anne Pasternak. The vandals marked the doors of their homes with upside down red triangles, a symbol used by the al-Qassam brigades, the military", "‘Free Palestine’ Bridge Blockers Get Free Bail—Andthe Democratic Party’s Fundraising Platform Gets a Cuthttps://freebeacon.com/democrats/free-palestine-bridge-blockers-get-free-bail-and-the-democratic-partys-fundraising-platform-gets-a-cut/…", "Israeli military kills Hamas terrorists, finds 'significant' weaponsandassets inside UNRWA headquartershttps://foxnews.com/world/israeli-military-finds-significant-amount-hamas-weapons-assets-unrwa-headquarters…#FoxNews", "Terrorists Separate Mother from Daughter in Hostage Release; Emily Hand, 9, is Freehttps://breitbart.com/middle-east/2023/11/25/hamas-separates-mother-from-daughter-in-hostage-release-emily-hand-9-is-free/…via@BreitbartNews", "HamasTerrorist Leaders: Our Goal Is Establishment Of Global Islamic Caliphate, Not Just Liberation Of Palestine#MEMRI", "America’s Invisible Hostage Crisis\n\"On Oct. 7, 2023,Hamaskilled more than 30 American citizens and took as many as a dozen Americans hostage. Of those who were taken, at least two have been murdered. Five, we pray, are still alive. Do you know any of their names? Have you seen", "UN agency \"aid\" get \"stolen\" byHamas. \n\"U.N. sources told Israel’s Walla News that the aid was stolen, and Israel’s military liaison to the Palestinians reports that 24,000 liters of fuel and medical supplies went toHamas, whose underground bases use diesel generators.\""], "PatTheSocialist": ["Human Rights watch has determined thatIsraelis intentionally destroying the food supply ofGaza. Add it to the list of war crimes.\n\nThis is genocide.", "The US must immediately pull all funding ofIsraelanddemand a ceasfire", "Read below the ICJ conclusions:", "Hell yes!!! People with a conscience speak upandcall out genocide, no matter the cost.Israelis commiting genocide\n\nThe US is enabling genocide\n\nNo peace, or votes, for anyone supporting this atrocity.", "DISGUSTING#Oscarsspeech from Jonathan Glazer blaming Israel — the VICTIM — for the October 7 massacre.\nIn the 1940s, the dehumanization of Jews led to the systematic mass murder of 6 million. In 2023, that same Jew hatred led to the mass murder of 1,200. It would have been many", "Without US support,Israelcould not get away with the genocide of 1,000 children just this week, making the US just as guilty.\n\nDon't believe Biden's bullshit sympathy for Palestinians. He has the power to stop this.", "Over 30,000 people dead\n\nOver 12,000 children killed\n\n115 journalists murdered\n\nAlmost 2 million displaced\n\nOver 200 healthcare facilities destroyed\n\nThis isgenocideJoe Biden and the Democratic Party own this", "This mother fucker is licking ice cream while a million Palestinians are starving to death thanks to him. Fuck him and anyone supporting him.", "Human Rights watch has determined that Israel is intentionally destroying the food supply of Gaza. Add it to the list of war crimes.\n\nThis isgenocide.", "It's \"weird\" to call for aceasefirebut continue fundinggenocide"], "people4liberty": [], "BillOReilly": ["Harris asked how she would get aGazadeal.  Dodges.  Says the war must end.  Had no plan.#PresidentialDebate#NoSpin", "Evil on display inGaza.  Please read the Message of the Day onhttp://BillOReilly.com.", "The corporate media has enabled far-left fanatics for years. Now, the enabling is on full antisemitic display across the country.\n\nThe#progressivemovement believesIsraelis a fascist country that practices genocide or some such stupidity.\n\nAppalling doesn't even come close.", "Minnesota@GovTimWalzis Kamala's#VPpick. Smart guy, very progressive.  Josh Shapiro didn't make it because he's Jewish.  We'll explain all on the@NoSpinNewstonight.http://BillOReilly.comhas it.", "Harris asked how she would get a Gaza deal.  Dodges.  Says the war must end.  Had no plan.#PresidentialDebate#NoSpin", "Evil on display in Gaza.  Please read the Message of the Day onhttp://BillOReilly.com.", "The corporate media has enabled far-left fanatics for years. Now, the enabling is on full antisemitic display across the country.\n\nThe#progressivemovement believes Israel is a fascist country that practicesgenocideor some such stupidity.\n\nAppalling doesn't even come close.", "After all the blood and treasure the United States extended for Iraq, it is clear that the country is not our friend."], "NHGOP": ["To clear things up, the leftandthe ACLU are mad because the Governor signed a bill to *checks notes* make sure only citizens vote.\n\nUsed to be common sense prevailed across political lines, but now the far-left \"Democratic\" party demonizes secure, Constitutional elections.", "Big news: This newly signed voting law in N.H. requires proof of citizenship to register to vote and photo ID to cast a ballot. It eliminates an affidavit system that allowed people to vote by attesting to their qualifications.https://bostonglobe.com/2024/09/12/metro/new-hampshire-law-proof-of-citizenship-register-vote/…@Globe_NH", "Congratulations to Manchester’s@JayRuaison his BIG win tonight!#nhpolitics", "Since it's in the news again: should 1.4 million NH taxpayers be forced to subsidize commuter rail to Boston for a few thousand riders?"], "wvhouse": [], "brad_polumbo": ["“You’re not the next MLK Jr. or Rosa Parks. You’re an unemployed they/them who didn’t know the difference betweenGazaandtheWestBankuntil a few months ago.”\n\nMy message to the lunatics on#freepalestineTikTok who keep blocking traffic.", "Anti-Semites are so strange.\n\nLike, the Jews aren't the reason this wasn't you.Youare the reason this wasn't you.", "51% of 18 to 24-year-olds say Hamas's slaughter of Israeli citizens was justified. \n\nYet 62% also say it was a genocide.\n\nSo, a sizeable number of young Americansthink genocide against Israelis is justified.What the actual fuck?", "\"There are no innocent Palestinian people in theGazaStrip.\"\n\nWRONG!\n\nEven if you think 100% of the adults inGazasupport Hamas -- which is absolutely not true -- there are hundreds of thousands of CHILDREN in theGazaStrip. \n\nThey are absolutely innocent parties in this.", "I’m sorry, but there are no innocent Palestinian people in the Gaza Strip. I’ve seen them celebrating. They want blood they will get blood.\n\nAnd as for the people celebrating in the United States, with Palestinian flags in our streets, you are just as disgusting.\n\nAnd the people x.com/HikindDov/stat…", "“You’re not the next MLK Jr. or Rosa Parks. You’re an unemployed they/them who didn’t know the difference between Gaza and the West Bank until a few months ago.”\n\nMy message to the lunatics on#freepalestineTikTok who keep blocking traffic.", "You're literally more pressed about language than the dead American woman.", "51% of 18 to 24-year-olds sayHamas's slaughter of Israeli citizens was justified. \n\nYet 62% also say it was agenocide.\n\nSo, a sizeable number of young Americans thinkgenocideagainst Israelis is justified.\n\nWhat the actual fuck?", "I find the pro-Hamasprotests happening in US cities unimaginably vile. \n\nBut to those calling on them to be shut down… nope. That’s not how free speech works."], "BernardKerik": ["Federal hate crime,andterroristic threats! Start locking them up!", "Philadelphia, PA - four masked men walked into Cafe Ole (Huntingdon) and proceeded to tear off the Israeli flag, while yelling “Free Palestine” as they left. \n\nPolice are investigating.", "WE’RE NEXT!\n\nYou give our enemies $6 Billion while letting close to 5 million illegals into our country, unvettedandunmonitored!\n\nIt’s coming… mark my words!https://x.com/leslibless/status/1710690561269649904/video/1…", "No one is perfect, but you cannot break the law to enforce it! \n\nYou cannot politically targetandpersecute the opposition,andattempt to deprive them of their freedom wrongfully!", "“You Cannot Expect Black Women to be Perfect” – Fani Willis Plays Race Card After Allegations of ‘Improper’ Relationship with Top Trump Prosecutor (VIDEO) via@gatewaypundithttps://thegatewaypundit.com/2024/01/you-cannot-expect-black-women-be-perfect-fani/?utm_source=rss&utm_medium=rss&utm_campaign=you-cannot-expect-black-women-be-perfect-fani…", "It’s amazing to hear@metpoliceukCommissioner Sir Mark Rowley,and@ThierryBretonthreaten@elonmuskin an attempt to suppress President Donald@realDonaldTrumpTrump’s interview.\n\nPerhaps they should focus on the tens of thousands of violent radical Muslimsandillegals tearing", "Hey@BrianKempGAand@GaSecofState!!!!\n\nThat's some perfect election!\n\nYou lied, then concealedandsuppressed the truth,andthen supported the Fulton County DA's targeting of Trump, Giuliani,andnumerous Georgians who were trying to expose the real fraudandimproprieties.", "Georgia 2020 Trust DeficitNo forensic ballot audit permitted\n100 drop boxes lacked surveillance videos\n20K ballot images - vanished\n13 election routers - vanished\n10 Dominion tabulators - vanished\nAudit report on voting machines - vanished\nAnd more-https://uncoverdc.com/2023/08/25/georgia-ttv-says-they-have-the-goods-on-state-voter-rolls-in-2020/…", "I said it would come to this over a year ago!\n\nThey can’t beat him at the polls, they’ve  tried to imprison and bankrupt him, and now this!\n\nI blame Joe Biden, the Department of Justice, the Democratic Party and their propaganda machine in the mainstream media. \n\nThey did this!", "Under the capital police’s use of force curriculum, Byrd had no justification to use, deadly physical force in this scenario. Babbitt posed, no physical threat, was unarmed, and wish shot point blank by Byrd. Any cop anywhere in this country would be in prison for doing anything", "\"At 2:45 p.m., or within one minute after shooting Ashli, Lt. Byrd made the following radio call:405B. We got shots fired in the lobby. We got shots shots fired in the lobby of the House chamber. Shots are being fired at us and we’re sh, uhh, prepared to fire back at them. We x.com/TomFitton/stat…", "No one is perfect, but you cannot break the law to enforce it! \n\nYou cannot politically target and persecute the opposition, and attempt to deprive them of their freedom wrongfully!", "“You Cannot Expect Black Women to be Perfect” – Fani Willis Plays Race Card After Allegations of ‘Improper’ Relationship with Top Trump Prosecutor (VIDEO) via@gatewaypundithttps://thegatewaypundit.com/2024/01/you-cannot-expect-black-women-be-perfect-fani/?utm_source=rss&utm_medium=rss&utm_campaign=you-cannot-expect-black-women-be-perfect-fani…", "This proves the point that I've made for years!\n\nIt can be fixed. It can be cleaned up and secure, if they want it to be, so the question is, why not? \n\nWhy are you allowing it in the first place?", "REPORT: The San Francisco homeless population has \"miraculously\" gone missing as President Biden & Chinese President Xi Jinping are set to meet in the liberal city.\n\nRemarkable!\n\nThe typical drug addicts & homeless who wander the city like zombies have disappeared as 20,000"], "spann": ["From Paige Northcutt “Found a temporary solution to the no running water issue”…", "ON THIS DATE IN 2010: Many North Alabama communities experienced their first “White Christmas” (accumulating snow on December 25) on record. Parts of Madison County had over 5 inches of snow.\n\nOddly enough, at Birmingham-Shuttlesworth Airport, where the records are kept, there", "A Kroger in Huntsvile this afternoon… photo from Sean Mullikin", "BERYL NOW A CATEGORY FIVE: Beryl is now packing sustained winds of 160 mph, making it a very dangerous category five hurricane.\n\nIt will move through the Caribbean over the next few days with slow weakening due to shearanddry air. It will be close to Jamaica Wednesday,and", "I really don’t know what triggers school closings these days… but if I had to guess it was related to this enhanced risk outlook issued yesterday morning by SPC. Obviously, this one didn’t verify…\n\nOur friends at SPC are the absolute best… But even they can get it wrong", "Did schools in Birmingham need to cancel for this weather? It’s barely drizzling in Vestavia Hills.", "I took this photo earlier this morning, looking southwest from our home in northern Shelby County. On this date three years ago an EF-3 tornado slammed into our neighborhood down this path and hit our home. \n\nThe damage was horrible, but we were blessed. My wife was fine (she was", "ON THIS DATE IN 1974: Today is the 50th anniversary of the “Superoutbreak” of tornadoes the night of April 3, 1974. The event lasted into the early morning hours of April 4. In all, 148 tornadoes touched down across the eastern and southern U.S. Of them, 95 were rated F2 or", "From Jordan Green “My brother who works in Yosemite, delivered supplies to the high camps”\n\nGotta love a good August snow…", "FRIGID: Here are some temperatures across Alabama just before sunrise...\n\nHaleyville 2\nMuscle Shoals 4\nGadsden 6\nTuckers Chapel 6\nHeflin 8\nMorris 8\nBessemer 8\nHuntsville 9\nChelsea 9\nTrussville 9\nAshville 9\nLeeds 9\nHueytown 9\nBirmingham 11\nAnniston 11\nAuburn 11\nTuscaloosa 13", "For those asking, I’m just getting started. Some as they get older slow down, I speed up. No retirement for me anytime soon. Full speed ahead…\n\nI feel better physically and mentally than I did 30 years ago. We have much work to do in mitigating loss of life during tornadoes…", "@spannYou better not be the next announcement. I’m not mentally prepared for that…", "DeSoto Falls today… video from Aaron McKenzie", "The view from Section looking down toward Scottsboro… Video from James Keel", "Alabama Power’s Plant Gadsden was demolished this morning, including the boilers and tower. The plant provided steam-generated electricity to the surrounding area for more than a century.\n\nWhen the plant was decommissioned in 2023, the majority of its workers either retired or"], "NancyAFrench": ["The@williamsontngop, after all that's been revealed by@NC5PhilWilliamsabout 2 of their candidates (Nazi bodyguards, resume lies, threats to shoot kids, fake supporters, prostitution facilitation), wrote this incomprehensible word salad: /1", "Since adopting from Ethiopia, critics sexualize their insults to humiliate us, insinuating our baby was created thru infidelity. They say we're 'raising the enemy.'\n\nMy new memoir (https://shorturl.at/bklzH) digs into this, but here's a recent example of the CONSTANT evil/racism:", "*David French chairx.com/NancyAFrench/s…", "For all of you Kansas City fans,  including@TaylorSwift, cheer them on! \n\nBut please hold Kanakuk’s celebrity endorsers accountable too.  \n\nThis isn't a game for the hundreds of victims.  /END", "You told me to bring a casserole to the potluck.\n\nYou told me to volunteer for the church nursery.\n\nYou told me to tithe.\n\nYou told me you’d changed.\n\nYou told me to sit downandbe quiet, because God loves obedient children. /END", "This is so rudeandawful. I can't imagine mocking a woman for her lack of children... or why the GOP thinks this is a good idea.", "Sarah Huckabee Sanders mocks VP Kamala Harris for not having biological children:\n\nMy kids keep me humble. Unfortunately, Kamala Harris doesn't have anything keeping her humble", "Bell?  Rung.\nBody? Worn out.\nEmotions?  All over the place.\n\nBut...  it's over.  \n\nThank you to@DavidAFrenchfor 28 years of care, love, and support (esp the last one). \n\nAnd thanks to all of you for hoping and encouraging me through the darkness.", "", "Y'all, I'm only 3 days removed from the red devil chemo, and I have been fighting nausea and hot flashes all day.  RIGHT before I went on AYMAN's show, I realized I'd sweated through my dress. I had 2 minutes to change. /1", "TONIGHT AT 8: The radicalization of the Republican Party, as seen through the eyes of@NancyAFrench. She speaks to@AymanMabout how her life was turned upside down after her family began being targeted by alt-right trolls in 2015.", "I deleted my request for y'all to report the guy who wished my cancer would return. Since he blocked me, I couldn't tell he also had a diagnosis that might be terminal (thanks for letting me know) -- so instead I'm asking for prayers for this man as he faces whatever he's facing.", "'Democrats should answer the GOP men’s night with a men’s night of their own — one that features heroes instead of bullies and showmen, a night that answers the Republican appeal to men’s basest instincts with an appeal to their highest ideals.' -@DavidAFrench", ".@Kanakukis covering up the 'the worst Christian sex abuse scandal you’ve never heard of' -- the prosecutor estimated 'hundreds' of campers were abused by ONE predator -- and there were MANY predators. /2", "Some of you hate the NYT so much you cancel your subscriptions every month!", "You guys…. I am in the plane coming home and these types of messages make me feel i could fly home without the plane. Thank you so much!!", "I’m a third of the way into it and it is utterly fantastic."], "womenfortrump": [], "SabbySabs2": ["This is what I've been saying for months. It's double speak when you hear Kamala say she wants a ceasefire but she won't stop or condition aid toIsrael. The ceasefire rhetoric is just a campaign sale to get your vote.", "Ilhan Omar: \"If you really wanted a ceasefire, you'd just stop sending the weapons. It is that simple\"\n\nSpot on.", "For years, Palestinians have been treated like animals,andour government was silent. Occupied ppl have the right to resist!", "“Palestinians have been murdered by the thousands & we say nothing. And suddenly Joe Biden pops up & starts teaching us about morality & humanity. Well screw your morality!”\n\n—Dr. Osama Abu Irshaid at DC Rally to#FreePalestineEnd#IsraeliApartheid", "They were not Israelis. They were Arab Druze. You need to issue a retraction.", "What's laughable is that you choose to prioritize the oppressor instead of the people being BOMBED! How they hell do you BOTH SIDES a genocide? How the hell do you attack protesters calling out a genocidal supremacist state? You're an opportunist.", "It is laughable.\n\nWe can mobilize to end the atrocities in Gaza and combat the rise of antisemitism at the same time. Bigotry in organizing spaces imperils everyone’s work. \n\nI work to end the war, protect ALL my constituents, and fight AIPAC. Believe it or not, you can do all 3. x.com/Yair_Rosenberg…", "You're not working tirelessly to secure a ceasefire if you're still sendingIsraelweapons. Not to mention, the Democratic Party 2024 Agenda has an entire section aboutIsraelandGazaandfavorsIsraelanddoesn't mention anything about torture or assault of Palestinians.", "Rep. Alexandria Ocasio-Cortez says Kamala Harris is \"working tirelessly to secure a ceasefire in Gaza and bringing hostages home.\"#DNC", "Where's@DanaBashCNNat? You can spread info about Hamas sexual assault, which was debunked...but you're silent about theIDFsexually assaulting Palestinian women!", "‘Women in Gaza are being raped and this is not being investigated or reported’\n\nCanadian doctors volunteering in Gaza have reported women being sexually humiliated by Israeli occupation forces in front of their families, one woman was raped for 2 days until she was unable to", "You support the state ofIsraelremoving Palestinians from their home, taking their landandputting them in a concentration camp! You support the oppressors! You stand for oppression. Just admit that!", "HAARETZ  finally admitting IDF was ordered to use Hannibal Directive on October 7th!", "ISRAEL ORDERS ALL PALESTINIANS TO LEAVE GAZA. They have nowhere to go. Along with the approval of the annexation of the West Bank, this is full-scale ethnic cleansing. And our government is funding it.", "BREAKING NEWS: ICJ SAYS ISRAEL MUST HALT MILITARY OPERATION IN RAFAH!", "Israel vows to continue war after hostages are released. As I said before they want to ethnically cleanse the land."], "donwinslow": ["Shame on anyone who called this awful person a hero.\n\nWhy has no reporter ever asked her:\n\n1. Where are these babies being killed?\n2. What hospital is this happening at?\n3. What doctors/nurses committed these murders?\n\nDisgusting. Foul. Not a hero.", "Adam Kinzinger did not sacrifice ANYTHING.\n\nHe was REDISTRICTEDandQUIT.\n\nGoogle: Adam Kinzinger Redistricted.\n\nMillions of Democrats fellfor a completely BS narrative just asthey did with Steve Schmidt.\n\nThis is ALL FOR PROFIT.", "Imagine calling someone who spread this evil lie for YEARS a hero.\n\nThis is not a hero.\n\nNot of one thing.\n\nNot of anything.", "I need your help.\n\nToday is the last day of first week sales. \n\nThis is my final novel. I'm 70andI've given readers my very best.\n\nI hope you will consider ordering the best reviewed book of my career#CityInRuinsAmazon:https://bit.ly/42T9MZ8B&N:https://bit.ly/3MnUOTI", "Shame on anyone who called this awful person a hero.\n\nWhy has no reporter ever asked her:\n\n1. Where are these babies being killed?\n2. What hospital is this happening at?\n3. What doctors/nurses committed these murders?\n\nDisgusting. Foul. Not a hero.", "Adam Kinzinger did not sacrifice ANYTHING.\n\nHe was REDISTRICTEDand QUIT.Google: Adam Kinzinger Redistricted.Millions of Democrats fell for a completely BS narrative just as they did withSteve Schmidt.This is ALL FOR PROFIT.", "Imagine calling someone who spread this evil lie for YEARS a hero.\n\nThis is not a hero.\n\nNot of one thing.\n\nNot of anything.", "This@NikkiHaley\"civil war\" interview is from2010!Ask yourself why not one single journalist asked Nikki Haley about this in 2023.Not one."], "PunchUpPod": [], "NRSC": ["Meet San Francisco Radical Kamala Harris\n\nKamala wants to Abolish Ice, Defund the Police, and destroy the American Economy.\n\nReject San Francisco Radical Kamala Harris", "FLASHBACK: Kamala Harris tells Jake Tapper she endorses universal healthcare and Medicare-for-all for illegal immigrants.", "Fake News EXPOSED!!\n\nMSNBC & the liberal media are caught ERASING previous TRUE reports about Harris’ record.\n\nThey are the ENEMY of the people & will STOP at nothing to destroy President Trump.\n\nGo on the record: Do you think the media is fair to President Trump? >>", "Joe Biden apologizing to Laken Riley’s killer is disgusting"], "ReasonFdn": [], "JohnArchibald": ["I wish I knew which you you are, Katie Britt.", "Some things to think about, as my state spends billions of dollars to lock people up.", "Alabama is well on its way to being a full-blown theocracy. The \"frozen embryos are children\" ruling is just another step on the path.", "This is an amazing honorandI'm still pinching myself. Looking so forward to being a part of this board.", ".@JohnArchibaldof@aldotcom,@GinaSKChuaof@semaforand@NTretheweyof@NorthwesternUhave been elected to the#PulitzerPrize Board! Click below to read more.https://pulitzer.org/news/archibald-chua-trethewey-join-pulitzer-board…", "I wish I knew which you you are, Katie Britt.", "Some things to think about, as my state spends billions of dollars to lock people up.", "Alabama is well on its way to being a full-blown theocracy. The \"frozen embryos are children\" ruling is just another step on the path.", "This is an amazing honor and I'm still pinching myself. Looking so forward to being a part of this board.", ".@JohnArchibaldof@aldotcom,@GinaSKChuaof@semaforand@NTretheweyof@NorthwesternUhave been elected to the#PulitzerPrize Board! Click below to read more.https://pulitzer.org/news/archibald-chua-trethewey-join-pulitzer-board…"], "nprpolitics": [], "ACTforAmerica": ["Stop US Aid Funding Palestinian Terrorismhttps://bit.ly/48y0bJO", "ALERT: Hamas has 'Lost Control ofGaza' Israeli defense minister says.", "Hamas’ Saleh al-Arouri killed in Israeli drone strike in Beirut", "If you're pro-Hamas, you're pro-terrorism.", "Hamas’ Saleh al-Arouri killed in Israeli drone strike in Beirut", "ALERT:Hamashas 'Lost Control of Gaza' Israeli defense minister says.", "The attacks fromHamasare barbaric and heinous. There must be severe consequences.", "ALERT FROM GAZA CITY: Israel goes on offensive and reportedly takes out over 1,500Hamasterrorists after long night of explosions."], "PatrickSvitek": ["Paxton whistleblower attorney Tom Nesbitt says lawsuit isn’t over:", "Statement from another Paxton whistleblower attorney, TJ Turner:", "Federal prosecutors announce a superseding indictment of Nate Paul with new wire-fraud charges#txlege", "Just in: House approves Raney amendment stripping ESA provision out of#HB1. The vote was 84-63.#txlege", "Paxton whistleblower case: 3rd Court of Appeals denies Paxton’s request to immediately halt Travis Co. judge’s ruling ordering depositions:https://search.txcourts.gov/SearchMedia.aspx?MediaVersionID=c7beff37-df2c-46f0-9da5-bfb57d152bda&coa=coa03&DT=MT%20TEMP%20RELIEF%20DISP&MediaID=d16a2c11-7e6d-4bcd-8137-dbabecec2f08…COA sets Jan. 3 deadline to respond\n\nWhistleblowers have replied to Paxton’s original filing:", "Retiring Republican state Sen.@DrewSpringer, who voted to acquit@KenPaxtonTXin impeachment trial, asks@DanPatrickandcolleagues if there’s a way to “reopen” the proceedings after Paxton decided to not contest whistleblower lawsuit#txlege", "Just in: After two-hour hearing, Travis County district judge agrees to order@KenPaxtonTX, three top aides to be deposed in whistleblower case#txlege", "Biden: I believe my record and vision \"merited a second term, but nothing — nothing — can come in the way of saving our democracy. That includes personal ambition.\"", "Harris: \"In many ways, Donald Trump is an unserious man. But the consequences of putting Donald Trump back in the White House are extremely serious.\"", "Harris after meetingNetanyahu:\n- Israel has right to defend self \"and how it does so matters\"\n- I expressed \"serious concern about the scale of human suffering in Gaza\" & \"dire humanitarian situation\" \n- \"I will not be silent\" about that suffering", ".@McConaugheyis headlining a fundraiser for@TonyGonzales4TXon Nov. 2 in Houston. They got to know one another after the school shooting in Uvalde. Gonzales represents the city and McConaughey spent most of his childhood there.#TX23", "New: Jeff Yass, the national GOP megadonor whose top issue is school vouchers, gave@GregAbbott_TXa $6 million check on Dec. 18, per Abbott’s just-filed campaign finance report.#txlege", "Harris: \"To everyone who has been calling for aceasefire, and to everyone who yearns for peace, I see you and I hear you. Let’s get the deal done.\"", "“Absolutely the president’s in this race,” Biden campaign chair Jen O’Malley Dillon says on MSNBC. He’s “more committed than ever” to beating Trump.", "Trump in Michigan: \"I’m announcing today, in a major statement, that under the Trump administration, your government will pay for — or your insurance company will be mandated to pay for — all costs associated with IVF treatment. ... We want more babies, to put it very nicely.\"", "Kennedy says he's suspending his campaign but leaving his name on the ballot in some non-competitive states:\n\"In about 10 battleground states where my presence would be a spoiler, I’m going to remove my name, & I’ve already started that process & urge voters not to vote for me.\"", "3rd Court of Appeals rejects Paxton’s latest attempt to shut down whistleblower lawsuit in Travis County#txlege", "3rd Court of Appeals rejects Paxton’s arguments to shut down whistleblower lawsuit in Travis County#txlege", ".@DadePhelangoes direct-to-camera about@KenPaxtonTXin a new reelection campaign ad, running on TV and digital.  \n\n\"If Paxton will break an oath to his wife and God, why would he tell Trump — or you — the truth?\"#HD21#txlege", "Federal prosecutors announce a superseding indictment of Nate Paul with new wire-fraud charges#txlege"], "benshapiroshow": ["Elon Musk is the most creative entrepreneur of our time,anda singular figure in modern Western life. What we are watching right now is a political bias against Elon Musk turn into a legal bias against Elon Musk. This is a perversion of the legal system.", "Ben Shapiro Reacts to Biden’s Supreme Court Remarks\n\nWatch the full video here:https://dwplus.watch/l1y3s2gi", "Well said@elonmusk. A little historical context goes a long way.", "The attempt to silence Trump will actually help him.", "Congressman Greg Murphy, M.D., joined the show to discuss his bill, the EDUCATE Act, which would end DEI programs in medical schools.@RepGregMurphy", "Elon Musk is the most creative entrepreneur of our time, and a singular figure in modern Western life. What we are watching right now is a political bias against Elon Musk turn into a legal bias against Elon Musk. This is a perversion of the legal system.", "The attempt to silence Trump will actually help him.", "Ben Shapiro Reacts to Biden’s Supreme Court Remarks\n\nWatch the full video here:https://dwplus.watch/l1y3s2gi", "Congressman Greg Murphy, M.D., joined the show to discuss his bill, the EDUCATE Act, which would end DEI programs in medical schools.@RepGregMurphy", "The Decline of Religion in America With Bishop Robert Barron@BishopBarron"], "action_4assange": [], "emcollective": [], "LifeNewsHQ": ["BREAKING: Planned Parenthood Abortion Biz inGazaDestroyed asIsraelResponds to Hamas Attackhttps://lifenews.com/2023/10/13/planned-parenthood-abortion-biz-in-gaza-destroyed-as-israel-responds-to-hamas-attack/…", "Abortion is NOT health care!\nAbortion is NOT health care!\nAbortion is NOT health care!\nAbortion is NOT health care!\nAbortion is NOT health care!\nAbortion is NOT health care!\n\nAbortion Clinic Injures Three Women in Two Months in Botched Abortions", "Hamas kills babiesandeveryone condemns it.\n\nAbortions kill babiesandthey call it \"reproductive rights.\"", "Maybe if Biden's people weren't so focused on putting pro-life Americans in prison, they would have known about the attack onIsrael.", "Hamas crushes the skulls of babies after birth.\n\nAbortion crushes the skulls of babies before birth.", "BREAKING: Jezebel, the radical leftist rag that literally celebrated killing babies in abortions, is going out of business.", "“I saw this blasphemous statueandwas outraged,” Cassidy said. “My conscience is held captive to the word of God, not to bureaucratic decree.Andso I acted.”", "Not sure we understand your question.\n\nBut there's a big difference between defending yourself from acts of terrorandpurposefully killing a little baby.", "On National Day of Prayer, Pray to End Abortionhttps://buff.ly/3UohTtB", "Five Babies Were Killed in Infanticides or Late-Term Abortions. They Deserve Justicehttps://buff.ly/3SEKmdT", "Born 1 Week Before Abortion Limit, His Parents Refused to Turn Off His Life Support. Then He Went Homehttps://buff.ly/3GufzKB", "I Was Conceived in Rape But I’m Glad I Wasn’t Aborted. I Did Not Deserve Death for My Father’s Crimehttps://buff.ly/2EC3Bj5", "Pro-Life High School Students Pray in Front of Planned Parenthood Every Week to Save Babies From Abortionhttps://buff.ly/3K36vNM", "Five Babies Were Killed in Infanticides or Late-Term Abortions. They Deserve Justicehttps://buff.ly/3SEKmdT", "Baby Isaac Was Saved When His Mom Changed Her Mind in the Middle of the Abortionhttps://buff.ly/4dtfhmE", "Doctor Calls Abortion the “Greatest UniversalGenocide” Facing Humanityhttps://buff.ly/2Vu9w1B", "Baby Isaac Was Saved When His Mom Changed Her Mind in the Middle of the Abortionhttps://buff.ly/4dtfhmE"], "bshelburne": ["Wanting people in prison to be seen as humanandtreated humanely is not woke. If you think that, read the Bible.", "Demonstrators in downtown Birmingham opposed to Alabama’s execution of#KennethSmithby nitrogen hypoxia.#deathpenalty", "There are political photo ops & then there’s this. Next level hypocrisy. Thankfully the comments on FB didn’t disappoint.", "Of all the dystopian shit proposed by Alabama lawmakers, this might be the most fucked up. Most violent prisons, poorest schools, least mental health & substance use services, high poverty.Andyet, jailing librarians is the priority.https://bit.ly/3HYh4lq", "Sick to hear Jim George died in Donaldson prison's infirmary. Jim had Parkinson's, in a wheelchair, yet still no relief from his LWOP sentence for burglaries. He had a girlfriend who built a wheelchair ramp at her house and still no. Locked up 42 years. Alafuckingbama. Rip Jim.", "We need something hopeful & here is Michael Schumacher, once condemned to life without parole in Alabama. He is now free and just became a grandfather. This is Mike with his grandson, Akari. Although in short supply, redemption, hope & love are alive. Thank you@Shoe142195x!  1/3", "Demonstrators in downtown Birmingham opposed to Alabama’s execution of#KennethSmithby nitrogen hypoxia.#deathpenalty", "There are political photo ops & then there’s this. Next level hypocrisy. Thankfully the comments on FB didn’t disappoint."], "lbjfoundation": ["It was our privilege to honor@POTUSwith the LBJ Liberty & Justice for All Award, our highest recognition, for his commitment to preservingandstrengthening democracy—what he has called \"the central cause\" of his administration.http://lbjaward.org", "We were honored to present@POTUSwith our highest honor, the LBJ Liberty & Justice for All Award. This award recognizes those who carry on#PresidentJohnson's legacyandcommitment to providing opportunity for all.", "President Lyndon B. Johnson fought like hell to give everyone a shot. He changed the way we live.\n \nNo one is more honored to receive an award in his name than me.", "It was our privilege to honor@POTUSwith the LBJ Liberty & Justice for All Award, our highest recognition, for his commitment to preserving and strengthening democracy—what he has called \"the central cause\" of his administration.http://lbjaward.org", "We were honored to present@POTUSwith our highest honor, the LBJ Liberty & Justice for All Award. This award recognizes those who carry on#PresidentJohnson's legacy and commitment to providing opportunity for all.", "President Lyndon B. Johnson fought like hell to give everyone a shot. He changed the way we live.\n \nNo one is more honored to receive an award in his name than me."], "ReallyAmerican1": ["BREAKING: A man just set himself on fire, on live TV, moments after the announcement was made that the final alternate jurors have been seated.\n\nPeople in the area quickly moved to extinguish the fire,andreporters have noted that the man who was on fire is now moving his", "On January 6th, the disgraced former President did nothing for 187 minutes after inciting an angry mob to descend upon the US Capitolandinterfere with the peaceful transfer of power.\n\nNow, he appears to be against Americans exercising their 1st Amendment rights to protest.", "BREAKING:A Trump supporter has been arrested after targeting Attorney General Letitia JamesandJustice Arthur Engoron with threats of extreme violence.\n\n\"Mark my words I will kill you\" he wrote.\n\n26-year-old Tyler Vogel was charged with two counts of making a terroristic", "It is absolutely DISGRACEFUL to see so many members of Wisconsin law enforcement \"bend the knee\" to a convicted felon who still faces dozens of indictments.\n\n\"Lawandorder\" is now chaosanddisorder.", "BREAKING:New York Attorney General Letitia James is not wasting a second, already lining up possible Trump properties to be seized when the deadline for him to produce a $464 million bond expires on Monday, March 25.\n\nBloomberg News reports that \"New York state’s $454 million", "You can watch the video of the full news story here on our Youtube channel:", "Sadly, an evergreen tweet in America.\nThe cities, states,andnumber of victims change.\n\nThe accomplices remain the same: half of Congress, its radical right wing Speaker,andthe NRA.", "ANOTHER mass shooting just occurred in Half Moon Bay, California.\n\nThe shooter did not act alone. He was aided by half of Congress and the NRA.", "FRIENDS! Can we get 1,000 fast replies using the hashtag#BidenFightsPriceGougingso we can draw attention to how President Biden is pushing to make billionairesandcorporations pay their fair share while the GOP lets them price gouge us?", "trump: \"Hezbollah's very smart. They're all very smart.\" \n\nPresident Biden: \"Our nation’s support for Israel is resolute and unwavering. And the right time to praise the terrorists who seek to destroy them is never.\"\n\nPresident Biden is right again.", "With all of the tragedy unfolding in Israel, of course Donald Trump found a way to make it all about him. He's spent the past few days attackingNetanyahuand praising Hezbollah.\n\nIt's objectively clear Trump remains unfit to serve.", "The grieving father of 11-year-old Aiden Clark, pleads with Republican politicians like Trump, JD Vance, and Chip Roy to STOP invoking the name of his son to invoke hatred towards Haitian immigrants in Springfield, OH.\n\n“This needs to stop now!”", "As soon as terrorists attacked Israel, GOP ghouls tried to capitalize off of it politically. Doing that rewards fiendish terrorists likeHamas, and helps neither America nor our allies in Israel.\n\nRepublicans need to stop the disgusting lies and rally around our President."], "NYPost": ["Israelraids terrorists’ luxury homes, take over parliamentandpolice HQs inGazahttps://trib.al/4cjWvt5", "Netanyahu rejects Hamas cease-fire demands, vows to fight until ‘absolute victory’https://trib.al/whlVLAa", "TheGazaWar has become a war on Jewish booksandauthorshttps://trib.al/XAUt3i8", "Israeli strikes on southernGazacity of Rafah kill 22, mostly children, as US advances aid packagehttps://trib.al/umLd0uq", "Netanyahu:Gazamust be ‘deradicalized’ like Germany, Japan post-World War IIhttps://trib.al/e3cKXrm", "Israelattacked by Hamas live updates:Israelcuts off electricity supply toGazaStriphttps://trib.al/qaqMFE8", "Hamasleader IsmailHaniyehassassinated in Tehran, Iran sayshttps://trib.al/fCIFdVo", "Israeli forces wipe outHamascommander in full-blown military operationhttps://trib.al/HPOlKaH", "Israeli forces wipe outHamascommander in full-blown military operationhttps://trib.al/xRA2XbD", "Israel saysHamashas been destroyed in north Gazahttps://trib.al/RBaFHsg"], "NoSpinNews": ["Last Monday#NYPDofficer#JonathanDillerwas slain by a 21-time offender. Also, a commuter was pushed in front of a subway car and killed. The killer's out roaming the street on $2K bail! \"NYC mayor#EricAdamsis in way over his head.#NYCis a disaster\"", "Newt on the#BidenCrimeFamilly: \"They were willing to sell out the United States ... you now have, in effect, a Chinese-Russian paid agent sitting in the Oval Office\"", "Former Trump aide Stephen Miller accuses Joe Biden of outright criminality.", "\"$7.7B in student loans will be forgiven. This brings it up to a whopping $167B ... so we have to pay for that, the taxpayers have to pay for that\"", "Bill theorizes that Kamala Harris' granting an interview indicates panic at the White House.", "As Bill advised Donald Trump, JD Vance hit back hard when pressed by CNN's Dana Bash about Springfield, Ohio."], "jeff_poor": ["Checking the Georgia elder abuse statute, just in case any laws are being broken...", "Who do y'all think David Muir is voting for?", "So, I guess the question is who is really running the country?", "Checking the Georgia elder abuse statute, just in case any laws are being broken...", "Who do y'all think David Muir is voting for?", "So, I guess the question is who is really running the country?"], "MsLaToshaBrown": ["Words cannot capture the full foolishness of this video. I thought it was a parody. So much to unpack here….", "Oh my god this Republican National Convention Rap video that was just played to the entire Republican National Convention was embarrassing... and the audience was silent afterwards.", "We knew he would go racistandsexist on this campaign. He can’t even help himself. But I’m so glad I that I have a great “Black job” that will help keep his behind out of office forever. Let’s Go!#ImWithHer#WeAintGoingBack#Harris2024", "Donald Trump: “Would you rather have the Black president or the white president…?\nI think they want the white guy.”\n(February 2024)", "PennsylvaniaWe are in the streets. Door to door, street corner to street corner, person to person! Our team is doing the work to make sure that Black voters understand the importance of the upcoming election. When our rights are under attack. We ORGANIZEandFIGHT back!", "Day one of our#WeFightBackBus Tour in Pennsylvania dove headfirst into mobilizing the youngest members of the community. Partnering with the Institute for the Development of African American Youth (IDDAY), the team launched a robust canvassing and phone banking effort across", "Happy Juneteenth! Today we call for voting rights. I’m so happy to be in this photo with@BarackObama. I am standing right behind@MichelleObamaandSasha with the black sweater on.", "Yes, this is going to be a tough election cycle. But we will win!Watch this documentary on@MSNBCtonight about the Georgia electionsandhow we got the vote out.  Airs on this Sunday, May 26th at 9pmCental/10pmEST.#WeFightBack@BlackVotersMtr**NOTE time change. Its 10pmEST.", "Presented by@msnbc_filmsand co-produced by TIME Studios, “Battleground Georgia” breaks down the complex history of voting across the South and how Georgia came to lead the charge in this pivotal political moment. \n\nTune in tonight at 9pm ET on@MSNBC", "This wasn’t a debate. This was a declaration of leadership.", "Great news! This is why we must always fight back.", "BREAKING: A state court in Pennsylvania ruled that excluding mail ballots from eligible voters based on a missing or incorrect handwritten date on the return envelope violates the state constitution. Thousands of voters were excluded in prior elections on the basis of this", "Join us! I’m joining in my personal capacity. Register here:", "Rep. Sheila Jackson Lee Remembered: Opposed Iraq War, Advocated for Juneteenth, Reparations & Morehttps://democracynow.org/2024/7/22/latosha_brown_sheila_jackson_lee…via@democracynow"], "FBI": ["The#FBIandits partners spent nearly two decades hunting down a lone wolf bomber the world would know as Ted Kaczynski upon his arrest at a Montana cabin in April 1996. A replica can be found at the FBI Experience in Washington, D.C. Read more at:http://fbi.gov/history/artifacts/unabomber-cabin…", "#OTDin 1975, an explosion rocked the HQ of the@StateDeptin Washington, D.C. A domestic terrorist group known as the Weather Underground claimed responsibility. The#FBIpursued these terrorists for decades until they were brought to justice. Learn more:https://fbi.gov/history/famous-cases/weather-underground-bombings…", "Lamor Whitehead, Brooklyn Church Leader, Sentenced To Nine Years In Prison For Fraud, Extortion,AndFalse Statements@NewYorkFBI", "St. George Businessman Sentenced to 29 Months’ Imprisonment for Fraudulently Receiving Over $685,000 in COVID-Relief Funds@FBISaltLakeCity", "Long Beach Man Sentenced to Life in Prison for Bombing Aliso Viejo Spa in Attack that Killed His Ex-GirlfriendandInjured Two Others@FBILosAngeles", "RepeatBankRobber Sentenced to Twelveanda Half Years in Federal Prison After Robbing Four More Banks in Two-Weeks While on Parole@FBIIndianapolis", "#DYKThe#FBI’s Weapons of Mass Destruction Directorate leads the Bureaus’s efforts to mitigate chemical, biological, radiological, nuclear,andexplosive threats?#FBIWMDDLearn more:https://fbi.gov/investigate/wmd", "#ICYMI: The#FBI's Weapons of Mass Destruction Directorate (WMDD) facilitated a training exercise with the Indonesian National Police Mobile Brigade Gegana Regiment to exchange informationandstrengthen our partnership. Learn more about WMDD athttp://fbi.gov/investigate/wmd#FBIWMDD", "The#FBIhonors Special Agent Barry Lee Bush, who died#OTDin 2007 during an investigation into a series of armedbankrobberies in New Jersey.#WallofHonorhttps://fbi.gov/history/wall-of-honor/barry-lee-bush…", "The#FBIhonors Special Agent L. Douglas Abram, who was shotandkilled#OTDin 1990 while executing a search warrant for weaponsanddrugs in St. Louis County, Missouri.#WallofHonorhttps://fbi.gov/history/wall-of-honor/l-douglas-abram…", "The#FBIsends our condolences to the family, friends, and colleagues of Corporal Mohamed Said. Corporal Said had served with the Melvindale Police Department for 14 months.", "The#FBIsends our condolences to the family, friends, and colleagues of Deputy Constable Maher Husseini. DC Husseini had served with the Harris County Constable Office, Precinct 4, for more than three years.", "During today's Senate Committee on Homeland Security and Governmental Affairs hearing,#FBIDirector Christopher Wray discussed the Bureau's efforts to protect Americans and support Israeli partners in the wake ofHamas' terrorist attacks in Israel.", "The#FBIhonors Assistant Director Percy E. Foxworth of the New York Office and Special Agent Harold Dennis Haberfeld, who were killed#OTDin 1943 in a military airplane accident near Paramaribo, Surinam.#WallofHonorhttps://fbi.gov/history/wall-of-honor/percy-e-foxworth…"], "Niemanfdn": ["We're thrilled to announce that journalist Sally Buzbee (@SallyBuzbee), former executive editor of both@washingtonpostand@AP,  will join the Nieman Foundation as a Visiting Nieman Fellow for two months this fall, beginning in mid-September."], "evanasmith": ["every year at this time i’m like, yeah we actually did that#txlege", "I was rattled this week when I read the local news crisis is accelerating. How much worse can it get? Well, by next year — a year earlier than predicted — we'll hit a gruesome benchmark: 1/3 of U.S. newspapers shut down since 2005https://axios.com/2023/11/16/newspapers-decline-hedge-funds-research…#txlege", "Every year on this day — the anniversary of Charles Whitman’s\nshooting spree at the Unversity of Texas — I post a link to the best story I ever edited:@pamelacolloff’s “96 Minutes.” It’s still the best read,andPam is stillandalways thehttps://texasmonthly.com/true-crime/96-minutes/…#txlege", "This is why we need a robust independent press that holds power to account. Big thanks to ⁦@TexasTribune⁩ ⁦@propublica⁩andall the other news orgs who wouldn’t give up#txlege", "I was rattled this week when I read the local news crisis is accelerating. How much worse can it get? Well, by next year — a year earlier than predicted — we'll hit a gruesome benchmark: 1/3 of U.S. newspapers shut down since 2005https://axios.com/2023/11/16/newspapers-decline-hedge-funds-research…#txlege", "every year at this time i’m like, yeah we actually did that#txlege", "This is why we need a robust independent press that holds power to account. Big thanks to ⁦@TexasTribune⁩ ⁦@propublica⁩ and all the other news orgs who wouldn’t give up#txlege", "Every year on this day — the anniversary of Charles Whitman’s\nshooting spree at the Unversity of Texas — I post a link to the best story I ever edited:@pamelacolloff’s “96 Minutes.” It’s still the best read, and Pam is still and always thehttps://texasmonthly.com/true-crime/96-minutes/…#txlege", "NEW from@eklib@TexasTribune: Two women have filed federal complaints against Texas hospitals they say refused to treat their ectopic pregnancies, leading both to lose their fallopian tubes and endanger their future fertilityhttps://texastribune.org/2024/08/12/texas-abortion-law-ectopic-pregnancies/?utm_campaign=trib-social&utm_content=1723475693&utm_medium=social&utm_source=facebook,twitter…#txlege"], "EliasLawGroup": [], "davidhogg111": ["WILLIAMANDMARY STUDENTS- \nCome get FREE FOOD across from Barrett Hall at the corner of JamesandGriffin! \n\nIt’s Election Dayandwe wanna make sure young voters are fedandready to vote!", "Go tohttp://theshotline.orgto call your representative using a voice of a victim of gun violence to demand action on gun violence. All you need to do is put in your zip codeandhit call. Already today over 5,000 calls have been made.", "I love many of the names being floated but@GovTimWalzis the best choice for VP here’s why#WeWantWalzWHAT HE’S DONE:\nHe’s Americas most successful Democratic governor. (Long list below)\n\n- universal free school meals\n- legal weed\n- carbon free electricity by 2040\n- tax", "I have my disagreements with Osteen but no place of worship should be a murder scene. All Americans have the right to domestic tranquility.", "Gov./CSM (Ret.) Walz is stating facts. If you take issue with this then maybe you should ask yourself why a fmr President who did nothing for 4 hours while the Capitol building was under siege by his own supporters should be reelected?", "Today, as I reflect on the horrific attack on Pearl Harbor, I find myself reflecting on the sacrifices made by millions of Americans, including my grandfather, in the fight against authoritarianism. Although he was fortunate enough to survive the war, he endured significant", "The people in the comments of this post proudly celebrating shooting peaceful protesters is a new low. There’s video of this. It’s clear this was not any act of self defense this was senseless murder. There is no justification for shooting peaceful protesters.https://x.com/EndWokeness/st/EndWokeness/status/1722615994903044530…", "If you keep talking about the assassination attempt don’t you dare tell the kids who survive school shootings and their families to “just get over it”\n\nWhat happened today is unacceptable and what happens every day to kids who aren’t the president and don’t survive isn’t either."], "RacePowerPolicy": [], "AmyKremer": ["The corruption in GA is deeper than anyone could have imagined. \n\nGabriel Sterling & Brad Raffensperger should resign immediatelyandboth prosecuted to the full extent of the law.\n\nWe are not a serious state until we hold people accountable.", "I'm calling on the immediate resignation or firing of@GabrielSterlingfrom the GASOS Office. State Election Board case 2023-025 was recently heard on May 7, 2024 and confirmed around 3,000 fake double scanned ballot images from Fulton County 2020. These 3,000 were from just one", "We are being destroyed from within. \n\nThe call is coming from inside the house…", "The vote is at 12 PM\n\nYou know what to do…MELT the LINESDon Bacon@repdonbacon202-225-4155\n\nMario Diaz-Balart@MarioDB202-225-4211\n\nCarlos Giménez@RepCarlos202-225-2778 \n\nFrank Lucas@RepFrankLucas202-225-5565\n\nJohn Rutherford@RepRutherfordFL202-225-2501", "People are saying@JeffDeWitAZis a constitutional conservativeandis just the messenger, but I disagree\n\nHe’s as corrupt as the people “backeast”\n\nThe corrupt people backEastwouldn’t go to someone outside of their circle to attempt to bribe a candidate\n\nThey would only go to", "BREAKING: Arizona Republican Party chair Jeff DeWit caught on secret recording trying to bribe Kari Lake not to run for the Senate.\n\nHoly s***!\n\n\"There are very powerful people who want to keep you out,\" he said.\n\nAt one point during the secret recording, Lake was asked to name", "This court hearing in Atlanta concerning Fani WillisandNathan Wade isNathan Wade testified that Fani reimbursed him for her travelandpaid him with cash\n\nHe says he has no receipts\n\nThey are going down…", "Wow. \n\nIndiana, your Senator@SenToddYoungjust voted against Senator Mike Lee’s motion to allow more debate on the foreign aid funding bill.\n\nTodd Young is doing the bidding of Chuck Schumer.\n\nEven Bernie Sanders voted yes. \n\nShameful and disgraceful.\n\nSenator Young is", "Please lift Harmeet and her family up in prayer.To lose your husband and love  of your life is one of the most painful losses one could ever experience. \n\nPraying for strength, comfort and peace in the days ahead.\n\nMay Sarv RIP.", "The love of my life, my soulmate, my heart, Sarvjit Singh Randhawa left this world today after a long struggle with Parkinson’s and cancer. He passed away peacefully with his son and I holding his hands. He gave me a joyous life ever since we met, and I will always love him.", "CALL NOWContact these members & tell them to support@Jim_JordanIf no answer in DC, call the district officeAnn Wagner (MO)\n202-225-1621Austin Scott (GA)\n202-225-6531Mike Rogers (AL)\n202-225-3261Frank Lucas (OK)\n202-225-5565Carlos Giménez", "UPDATE#JordanForSpeakerRallies#NE02@RepDonBacon@DonJBaconTomorrow 10/19 @ 10 AM, Omaha#GA03@RepDrewFerguson@DrewFergusonGAFRI, 10/20 @ 12 Noon, Newnan#CO04@RepKenBuckDetails announced in the morning.#NY01,#NY02,#NY04@RepLaLota", "Looking for rally / sign waving organizers for#JordanForSpeakerin the following districts…\n\nIf you can help, DM me & we’ll help connect you w/others. \n\nNE & GA are already planned!#AR03- Womack \nFt. Smith or Rogers, Arkansas#CA01- LaMalfa\nYuba City, Chico, or Redding,", "North Carolina!!!!\n\nYour Senator@SenThomTillisis doing the bidding of Biden & Schumer\n\nHe voted to shut down amendments & debate on the $95 BILLION foreign aid bill\n\nI know this isn’t what y’all voted for & y’all deserve better.\n\nSenator Tillis is#AmericaLast@NCGOP", "Please keep Harmeet in your prayers. \n\nShe has experienced tremendous loss over the last couple of months.\n\n\"The Lord is near to the brokenhearted and saves the crushed in spirit\". Psalm 34:18\n\nMay you find peace and comfort knowing your dad is no longer suffering.", "My father, who gave me life and made that life so much better for our family in America, left this earth today. Dad passed away in Raleigh surrounded by family, after a long struggle with pulmonary fibrosis. He was an incredible man and father. I will share more later.", "On this day we learn OJ has met his maker\n\nLet’s remember Ron & Nicole\n\nLifting their families and loved ones up in prayer today\n\nI hope they are able to finally have some peace in their lives\n\nMay Ron & Nicole RIP", "Senator Mike Lee is STILL speaking on the floor of the US Senate\n\nAlmost 4 hrs now &\n\nDemocrats have objected to every amendment he has offered\n\nHe is fighting for#AmericaFirstand to make sure our tax dollars don’t go to killing Israelis and paying Ukraine pensions"], "natsechobbyist": ["If you say this was staged or condone violence, you’re blocked. No tolerance.", "I live 45 minutes away from himand3 days ago I filled up my carandI thought the pump shut off before it was full because the cost was several dollars less than it had been.", "Eric Trump: It cost me $130 to fill up my SUV two days ago. People can’t afford life anymore", "I wholeheartedly agree. He has given people permission to be their worst selves.", "They incite violence against others—even admitting it was based on LIES—andliterally say they take no responsibility. They have taxpayer funded protection unlike the people whose lives they endanger.", "I agree. Imagine if she had carried on in the same wayandnot married someone who has participated in so much damage.", "We’ve already been working on thisandtoday’s events won’t change anything", "I live an hour away from there. Dark rooms with heavy curtainsandcandelabras should be illegal! It’s the SUNSHINE STATEandit’s too beautiful not to highlight that.", "You know who doesn’t need to facilitate the antisemitism discussion: You.", "Maybe the voters just didn't want to be represented by an antisemitic idiots?", "I have sat awake many nights wondering who might be outside. \n\nI have known the instant fear of receiving an unknown package or letter. \n\nI have had my child ask me if we were safeandif someone was going to hurt our family.", "Here’s JD’s tl;dr:\n\n“Sure there are many things that happen that I don’t like but if the choice is between sacrificing women’s rightsandchildren’s lives, I’ll choose myselfandmy fellow white men every time.”", "I grew up in a town that was grocery stores, gas stations,andchurches...so many different churches because, as it happens, not all Christians agree so...yeah.", "Speaker Mike Johnson tonight: “Someone asked me today in the media, ‘People are curious, what does Mike Johnson think about any issue?’ I said, ‘Well, go pick up a Bible off your shelf and read it. That’s my worldview.”", "WE ARE NOT GOING BACK!#WeAreNotGoingBack", "Andit's nothing new. They've been doing this stuff for many years. Ask me how I know...", "How about we stop limiting what targets they can strike with the weapons we give them. Do we want them to win or just do this forever?", "Any journalist, media company, or publication who doesn’t cover this widely is irresponsible at bestandnegligent at worst.", "Trump in Doral: \"Mothers will never again be forced to watch their children overdosing and hosp--lee. And we will never allow mothers to watch their child hopelessly dying in their arms, screaming, 'What can I do? What can I do? Help me God, what can I do?' We are a nation whose", "You know what also causes division? Fascism. Authoritarianism. Because if you don’t agree with the leader, they punish you. I sincerely thought he was intelligent but I have dispelled of that opinion.", "Dwayne Johnson regrets endorsing Joe Biden for president in 2020 because \"what that caused was something that tears me up in my guts — which is division.\"\n\n\"It caused an incredible amount of division. I realize now going into this election, I will not do that. My goal is to bring", "Israel has good leaders but Bibi is fighting for his life so he doesn’t go to prison for corruption. I wonder why he likes Trump so much?", "Lapid: Netanyahu's speech was a disgrace. We heard him talk about Oct 7 like he had no idea who was prime minister & who was responsible for the disaster. He could have accepted the deal & brought the hostages back before they die in tunnels. He didn't.\"", "I despise Bibi.\n\nI don’t think it’s agenocide.\n\nI guarantee if they invited a Palestinian American to speak neither side would be satisfied.\n\nAll the speakers are in support of the nominee, not special interests.", "Important context from someone who KNOWS:", "Over the course of my grandfather's lifetime, he gifted and \"loaned\" Donald $413 million. And Donald still declared bankruptcy 6 times. He failed so badly that the banks needed to put him on a $425,000-a-month allowance.", "Bibi isn’t dong enough and you can see from the Israelis protesting right now they agree."], "overheardpbs": [], "OnStrikeShow": [], "BobMurphyEcon": ["I am making a simple observation here. I'm not \"picking sides\" except for the side of \"Killing innocent people is always wrong.\"\n\nThe people responsible for the attack onIsrael*want* the response to be \"over the top.\" They want the propaganda to then turn public opinionand", "tfw when I say it's wrong to drop bombs on kidsanda lady with \"ProLife\" in her bio literally lol's meandasks if it was wrong to firebomb dresden", "\"The part that is backed up by Israeli newspaper accounts is what Dave actually said, the other career-destroying smears I pulled out of my ass.\"\n--The impressiveandmuch smarter than@ComicDaveSmithHarsanyi", "As@scotthortonshowhas explained in various speechesandbooks, it is documented that Osama bin Laden's official strategy was to provoke the United States into bleeding itself dry inMiddleEast. You say, \"That wouldn't work!\" Well, it did when Osama went against the Soviets.", "I bet after today's ruling Obama is relieved that he won't do any time for blowing up a US citizen with a killer robot without a trial", "I am making a simple observation here. I'm not \"picking sides\" except for the side of \"Killing innocent people is always wrong.\"\n\nThe people responsible for the attack on Israel *want* the response to be \"over the top.\" They want the propaganda to then turn public opinion and", "\"The part that is backed up by Israeli newspaper accounts is what Dave actually said, the other career-destroying smears I pulled out of my ass.\"\n--The impressive and much smarter than@ComicDaveSmithHarsanyi", "As@scotthortonshowhas explained in various speeches and books, it is documented that Osama bin Laden's official strategy was to provoke the United States into bleeding itself dry in Middle East. You say, \"That wouldn't work!\" Well, it did when Osama went against the Soviets.", "I get it; it's funny. But not only did God not kill kids Cain hid behind, and not only did God not even kill Cain, but He actually placed a mark on him so that nobody ELSE would kill him.\n\nI.e. God agreed to aceasefireafter this crime.", "Cain Calls For Ceasefire After Killing Abelhttps://buff.ly/3SH1nFN", "this message has been brought to you by every terrorist who ever targeted civilians", "Fuck Gaza. \n\nI don’t give a shit about Gaza. There are consequences for voting for Hamas to be your representatives and there’s consequences for October 7. \n\nFuck Gaza and Fuck everyone who supports Gaza. x.com/WillWestWins/s…", "I'm not saying this to be a smarta$$, I'm pleading with people to remember their own value system right now in this awful moment.\n\nMany on this site are pro-life, even in cases of rape and incest. \"I know a crime has occurred, but I'm sorry you can't take it out on an unborn", "I can’t recall a single occasion where Jesus or Paul disagreed with the leadership of Israel", "Speaker Mike Johnson, on NEWSMAX promoting his war funding bill: \"For those of us who are believers, it's a Biblical admonition to stand with Israel\"", "oh so you want to crush palestinian kids with Man Economy and State\n\ngot it"], "BarbMcQuade": ["One of the drivers of disinformation is careerism. Some people will say anythingandsupport anyone to advance their own interests. Liz CheneyandAdam Kinzinger paid the price for their integrity. We the voters have the power to stand up to lies.", "I just endorsed Donald Trump. \n\nWhether you like Trump or not, Americans face a binary choice.\n\nBiden refuses to enforce our border, prosecutes his opponents, & embraces policies that make life unaffordable for hardworking Americans.\n\nI’ll take the mean tweets. \n\nI choose Trump. x.com/MAGAIncWarRoom…", "I am confident that the judge can find a jury of people who can be fair in this case, just as they did for the E Jean Carroll caseandthe case against the Trump Org /END.", "Political rhetoric is radicalizing Americans to engage in violence. We need to lower the temperature. My thoughts in@Bloomberg.", "Gag orders are necessary to stop Trump from using threatsanddisinformation as a legal strategy. As the Supreme Court once said, the Constitution is not a suicide pact. My thoughts in@TIME.", "Trump’s past use of the pardon power would embolden an era of lawlessness in a second administration. My thoughts in @MSNBDaily.", "Here’s an old disinformation tactic. Say something outrageous to distract from unfavorable press coverageandstoke division in society.", "The attack on government experts is complete, as the Supreme Court overrules Chevron, and says courts no longer should defer to federal agencies in interpreting statutes.https://supremecourt.gov/opinions/23pdf/22-451_7m58.pdf…", "The strategy is to divide and conquer. We can defeat it with decency and unity.", "Can someone please explain the strategy here?? Is the idea that if Blacks see Kamala embracing the Indian side of her family, they will abandon her?? I’m just confused", "Trump has dragged out accountability in all 4 criminal cases past the election. A victory will certainly mean the end of the 2 federal cases now that SCOTUS has said he is immune from prosecution for orders to DOJ. Only a Harris victory stops that outcome", "This conduct crosses the line of free speech and is a crime. Universities and law enforcement agencies have a duty to protect people and property.https://cbsnews.com/video/eye-opener-protestors-break-into-a-building-at-columbia-university/…", "President Joe Biden says he will not use pardon power for son Hunter Biden if he is convicted as trial on gun charges continues. I will discuss with@jdbalartat 11 am ET on@MSNBC.", "Here’s an old disinformation tactic. Say something outrageous to distract from unfavorable press coverage and stoke division in society."], "TristanSnell": ["Donald Trump held a SUMMIT with Israeli Prime Minister Netanyahu.\n\nAs a private citizen. At Mar-a-Lago. \n\nThe Logan Act is a federal law forbidding private citizens from negotiating with foreign governments.\n\nTRUMP IS BREAKING THE LAW — YET AGAIN", "Trump usually spends the summer in Bedminster, New Jersey.\n\nYet he met with Netanyahu at Mar-a-Lago.\n\nWHY?\n\nBecause he KNEW it was a violation of the Logan Act —andwanted to avoid being prosecuted by the Feds in New Jersey — whereas in Florida he could draw Aileen Cannon again.", "BREAKING -- Joe Biden announces CEASEFIRE framework, with release of hostages,andwith bothIsraelandHamas in agreement.\n\nCulmination of months of work by Bidenandthe State Department.\n\nBut sure, go aheadandtell me how Biden has declinedandshould quit the race.", "BREAKING — CEASEFIRE APPROVED byIsraelandHamas, with mutual releasesanda 4-day pause in fighting, which could be extended.\n\nThe deal was brokered by the USandQatar, including personal involvement by President Biden.", "I’ve seen enough. I just ENDED my New York Times subscription. I’m DONE with their both-sides-ismandappeasement of fascismandAmerica’s enemies. \n\nWhat about you?", "The Rainbow Bridge crash was NOT a terrorist attack. \n\nAnyone who says otherwise is LYING.\n\nAnyone who continues to leave posts up saying otherwise is a purposeful trafficker of the drug of disinformation.", "Donald Trump should be INDICTED — AGAIN.\n\nPBS now reports Trump told Israeli Prime Minster Netanyahu to NOT agree to a cease fire because it would help Kamala Harris.\n\nThis is a violation of the Logan Actandshould be investigatedandprosecuted to the fullest extent of the law.", "BREAKING -- Joe Biden announcesCEASEFIREframework, with release of hostages, and with both Israel andHamasin agreement.\n\nCulmination of months of work by Biden and the State Department.\n\nBut sure, go ahead and tell me how Biden has declined and should quit the race.", "BIG NEWS -- Big cities' murder rates are down 19% compared with last year -- this comes directly from police data from 236 major cities.", "Donald Trump should be INDICTED — AGAIN.\n\nPBS now reports Trump told Israeli Prime MinsterNetanyahuto NOT agree to a cease fire because it would help Kamala Harris.\n\nThis is a violation of the Logan Act and should be investigated and prosecuted to the fullest extent of the law.", "BREAKING —CEASEFIREAPPROVED by Israel andHamas, with mutual releases and a 4-day pause in fighting, which could be extended.\n\nThe deal was brokered by the US and Qatar, including personal involvement by President Biden."], "NPR": [], "CPRNews": [], "texastribune": ["Water is bursting from another abandonedWestTexas oil well, continuing a troubling trend \n\nVia@insideclimate:", "More than 80 music artistsandmultiple panelists have canceled appearances at SXSW over the U.S. Army’s sponsorship of the event.", "Update: The five fires in the Texas Panhandle have burned 975,000 acres — more than double the landmass of Houston — as residents have fled or sheltered in place.", "Beryl did between $1.2 billionand$1.3 billion worth of damage to CenterPoint's electricity infrastructure, the company said Tuesday.\n\nThose costs will likely be passed on to customers, who could see a 2% increase on their bills for the next 15 years.", "NEW: Texas firefighters have completely contained the Smokehouse Creek fire in the Panhandle after battling the deadly and destructive inferno for nearly three weeks.https://bit.ly/48Vi3xL", "Judge rejects Attorney General Ken Paxton’s attempt to shut down Houston immigrant rights group\n\nPaxton’s office claimed the group broke rules prohibiting political activity by nonprofits, but the judge rejected the case outright.", "El Paso judge blocks Ken Paxton’s efforts to subpoena Annunciation House, suggesting the attorney general may want to shut down the network of migrant shelters for political reasons.", "More than 80 music artists and multiple panelists have canceled appearances at SXSW over the U.S. Army’s sponsorship of the event."], "RonFilipkowski": ["Trump, 4 days after the Hamas attack onIsrael, decided to rip Netanyahu over the Soleimani strike: “I’ll never forget that Bibi Netanyahu let us down. That was a very terrible thing .. We were disappointed by that - very disappointed. Then Bibi tried to take credit for it.”", "How odd for Trump to Blame America First for an act of terrorism inIsrael, without a word of accountability instead for his good friend Benjamin Netanyahu, who actually runs that country.", "The Republican Party wants to give Benjamin Netanyahu a blank check to do whatever he wants inGazawith no oversight or questions asked. The fact that most Democrats disagree with that does not make them anti-Semitic. A large percentage of Jewish Democrats disagree with that.", "MAGA, Trump & Vance have been telling us that the U.S. shouldn’t police the worldandsolve issues happening in other countries. But I guess this attack insideIsraelis now America’s fault,andnot Benjamin Netanyahu’s. I’m struggling to understand this ‘America First’ thing.", "Trump, 4 days after theHamasattack on Israel, decided to ripNetanyahuover the Soleimani strike: “I’ll never forget that BibiNetanyahulet us down. That was a very terrible thing .. We were disappointed by that - very disappointed. Then Bibi tried to take credit for it.”", "Trump toNetanyahutoday: “No president has done what I’ve done for Israel.”", "The Republican Party wants to give BenjaminNetanyahua blank check to do whatever he wants in Gaza with no oversight or questions asked. The fact that most Democrats disagree with that does not make them anti-Semitic. A large percentage of Jewish Democrats disagree with that.", "How odd for Trump to Blame America First for an act of terrorism in Israel, without a word of accountability instead for his good friend BenjaminNetanyahu, who actually runs that country."], "benshapiro": ["What is the proposal for this magical \"end state\"? The US should expend zero resources inGaza. The Europeans aren't going to provide a security force there. The Saudis won't. UAE won't. Jordan won't. Egypt won't. The PA isn't even capable of controlling theWestBank.", "Good news, then: theIDFwill have security control,andthe current government is a unity government including his opposition. The post-Hamas plans forGazahave literally nothing to do with Netanyahu personally.", "\"I don’t know, frankly, who should control Gaza when or if Hamas is wiped out. But I do know it can't be Benjamin Netanyahu.\"\n\nPiers Morgan criticises the Israeli Prime Minister's plans to occupy Gaza after the bombing is done.@piersmorgan|@TalkTV|#PMU", "Israel: Here are the terms of our proposed ceasefire.\nHamas: No. We will fire rockets at your soldiers at a humanitarian aid entry.Israel: Okay, we're going into Rafah.\nHamas: We accept a ceasefire we negotiated with ourselves.\nMedia: Hamas accepts ceasefire! They want peace!", "The word \"evil\" is not descriptive enough for Hamas. They murdered in cold blood six people they had taken hostage almost a year ago, including an American, just days ago -- all in an attempt to sow seeds of political chaos. A few points:\n\n1. Hamas must be extirpated. It is the", "They said this BEFOREIsraeltook Rafah. They said this BEFOREIsraeltook the Philadelphia Corridor. They said this BEFOREIsraelkilled Deif, Haniyeh,andShukr. So I'd take their military opinions with a Dead Sea-worth of salt.", "Remember, the obstacle to peace in theMiddleEastis very simple: Palestinian rejection ofIsrael,andheartfelt support for murderous terrorism. The supposedly \"moderate\" Palestinian Authority has now formed a unity government with HAMAS.", "This is an absurd comparison on every single level. Hamas is a tyrannical fascist group.Israelhas tried for three decades to do a peace deal with entities calling for its destruction, including the supposedly \"moderate\" PA. Meanwhile, even the \"dreaded\" Netanyahu signed land", "a two state solution remains the only way forward for peace. \n\nthat means hamas leadership must be permanently removed from gaza. \n\nand netanyahu government has to be voted out of office in israel.", "Israel: Here are the terms of our proposedceasefire.Hamas: No. We will fire rockets at your soldiers at a humanitarian aid entry.\nIsrael: Okay, we're going into Rafah.Hamas: We accept aceasefirewe negotiated with ourselves.\nMedia:Hamasacceptsceasefire! They want peace!", "The word \"evil\" is not descriptive enough forHamas. They murdered in cold blood six people they had taken hostage almost a year ago, including an American, just days ago -- all in an attempt to sow seeds of political chaos. A few points:\n\n1.Hamasmust be extirpated. It is the", "They said this BEFORE Israel took Rafah. They said this BEFORE Israel took the Philadelphia Corridor. They said this BEFORE Israel killedDeif,Haniyeh, and Shukr. So I'd take their military opinions with a Dead Sea-worth of salt.", "Now that he's the political leader ofHamas, that means when his obituary is written, we'll learn he was actually a moderate voice in favor of aceasefireaccording to WaPo and NYT", "NEW \n\nHxmas has just announced that Yahya Sinwar, the terror group's leader in Gaza, was selected as the head of its political bureau, succeeding the assassinated leader Ismail Haniyeh."], "reason": ["Tim Walz’s coronavirus policies were extremely heavy-handedandrestrictive; causing the state to endure the pandemic in a fundamentally anti-libertarian fashion.\n\nRead more:https://reason.pub/3MaXTGZ", "TARIFFS NOT ONLY IMPOSE IMMENSE ECONOMIC COSTS BUT ALSO FAIL TO ACHIEVE THEIR PRIMARY POLICY AIMSANDFOSTER POLITICAL DYSFUNCTION ALONG THE WAY.", "Offensive speech, hate speech,andyes, even yelling “fire” in a crowded theater are all protected free speech. Reason will always defend your right to free speech, even if we don’t like what you’re saying.https://reason.pub/3uzckPM", "Reason spoke with@SenRandPaulabout his quest to uncover the origins of COVID-19andhold Anthony Fauci accountable.", "Republicans and Democrats host a post-game press conference:", "Harvard President Claudine Gay resigned yesterday, setting a record for the shortest tenure in the formerly esteemed university's nearly 400-year history.https://reason.pub/3S5LpEr", "Communism is a failed ideology that rules only through the use of force, which is why it should never be tried again.", "Offensive speech, hate speech, and yes, even yelling “fire” in a crowded theater are all protected free speech. Reason will always defend your right to free speech, even if we don’t like what you’re saying.https://reason.pub/3uzckPM"], "Jaybefaunt": ["All Out for Palestine Rally in Orlando Florida!#FreePalestine", "If I say that I want to be like Nelson Mandela, Malcolm XandKwamé Turé; many people will applaud me for it. But if I take their same stance on Palestine, then I'm demonized for it. Make it make sense.", "I not only condemnIsrael... I condemn the UNITED STATES.", "\"Donald Trump would genocide even worse\"\n\nTell that to the dead people in Rafah today... \nBidenandTrump would take identical genocidal actions.", "I was at this rally (we just left)andcops only started pepper spraying because the protesters started using a bullhorn. All this over a BULLHORN in a public park?! There were little kidsandinfants with us! We live in a police state!", "Whelp... Looks like some friends on Facebook are not liking my position on supporting Palestine. I may lose more friends today because I don't want more Palestinians to die. It's wild because we've been friends for years. It's sad, honestly.", "Bro, it's literally happening on TikTok. Black AmericansandPalestinians are now fighting with each other which is what the corporate parasitesandZionists want. They want us to fight each other instead of fighting FOR liberation. It's sad to see, TBH.", "They wantNetanyahuto resign. Interesting", "Thousands of demonstrators in Tel Aviv are demanding Netanyahu's resignation.", "Watch them lie in 20 years about how they \"had no idea\" they were supportinggenocide.", "Forget Russiagate... Israel is actually meddling in our elections/politicians to fund agenocide.", "AIPAC is planning on spending $100 million dollars in order to meddle in our elections \n\nEverything Democrats claimed Russia was doing meddling with our elections is actually true of Israel", "See how Zionism is linked to imperialism? Bob basically spoon-fed it to ya.", "Robert F. Kennedy Jr says the quiet part out loud & fully destroys his campaign. \n\n“Israel is a bulwark for us... it’s almost like having an aircraft carrier in the Middle East. If Israel disappears, Russia, China, and BRICS+ countries will control 90% of the oil in the world and", "She's RIGHT. Maybe she can talk to George Clooney and Julia Roberts about their fundraiser for agenocideenabler."], "HoodtotheHoller": [], "KyleClark": ["NEW: Denver Mayor@MikeJohnstonCOvetoes city council's ban on homeless camp sweeps in freezing cold weather. Council does not appear to have 9 votes to override the veto.#copolitics", "Denver City Councilwoman Shontel Lewis says the city is removing racist anti-Kamala Harrisandanti-migrant signs posted at a busy intersection in Denver.#copolitics", "I wish I could say I were surprised, but in a year when a Black woman could become POTUS those with hate in their heart are going to coordinate these kind of atrocious, expensive campaigns to stir division.", "Anti-trans initiatives have failed to make the Colorado ballot. Organizer@Erin4Parentsdescribes a \"spiritual battle\" for kids to \"cover them in the blood of Jesus.\"@ProtectKidsCOwas founded \"under the guidance\" of self-proclaimed Christian nationalist prophet Lance Wallnau.", "Gov@jaredpoliswins the self awareness Olympics with this response to@DanaBashCNN, who asked Polis if he’d serve as Kamala Harris’ VP: “If they do the pollingandit turns out they need a 49-year-old balding gayJewfrom Boulder Colorado, they’ve got my number.”", "NEW:@AuroraMayorMikeandCouncilwoman@DaniJurinskyrelease a joint statement on Venezuelan gang activity, saying, \"overstated claims fueled by social mediaandthrough select news organizations are simply not true.\" Statement says \"a select few properties\" affected.#copolitics", "NEW: Hells Angels Denver is condemning far-right claims that bikers are coming to Aurora to fight a Venezuelan gang. \"Social media rumors like this only serve to perpetuate a falseandirresponsible narrative... for the sole purpose of driving trafficandclicks.\"#copolitics", "GOP State Rep Scott Bottoms, who said Jewish hostages held byHamasneeded to find Jesus, now says there's no such thing as the Palestinian people, they're all just terrorists.#coleg#copolitics", "NEW: The Salvation Army is finally taking questions after seven deaths at its homeless hotel shelter near Quebec and I-70 in Denver. The Salvation Army says it didn't spend $800,000 tax dollars allocated for security because it was \"researching\" options.", "COMMENTARY: The rhetoric stoking political violence reminds me of the 1950s roadside safety signs reading \"Drive Carefully. The Life You Save May Be Your Own.\" We're on this road together - where self-interest and care for others can be one and the same.", "COMMENTARY: 40 years after Neo-Nazis murdered legendary radio host Alan Berg, the hate they harbored persists", "They ask us to never forget the 13. And to celebrate their lives.https://9news.com/mobile/article/news/local/columbine-25-years-family-friends-remember/73-8d56ac8e-5e6a-4611-af55-ffa97b3f8739…", "Oltmann, who calls for the executions of his political opponents, hinted at coming violence in November. “November is going to be the start of something very very very very very very kinetic. Now do I want that to happen? No. But I don’t want my children to be groomed either.”"], "LibertarianPol": [], "majorityfm": ["UPDATE: Thank you to everyone contributing to help evacuate this family fromGaza. You can still donate to help Mohammad herehttps://gofund.me/ffdba44f", "Please help Mohammad evacuate his family from Gaza:http://tinyurl.com/7zb4hujt", "lmao the garbage truck pulling up in the background is such a nice touch", "“Go pick up a Bible off your shelfandread it. That’s my worldview.”", "Great clip of@_michaelbrookstaking a call from a pro-Israellistener 6 years ago", "UPDATE: Thank you to everyone contributing to help evacuate this family from Gaza. You can still donate to help Mohammad herehttps://gofund.me/ffdba44f", "Please help Mohammad evacuate his family from Gaza:http://tinyurl.com/7zb4hujt", "lmao the garbage truck pulling up in the background is such a nice touch", "When having contempt for the base of your party isn’t working out for you", "Great clip of@_michaelbrookstaking a call from a pro-Israel listener 6 years ago", "Folks! Don’t miss out on our super mega limited edition WHOOPSIE! shirt available now athttps://shop.majorityreportradio.com/products/the-majority-report-whoopsie-t-shirt-heather-gray…@Lavernecox@iamcardib"], "ThomasEWoods": ["Some excerpts from Javier Milei's speech at the World Economic Forum's Davos meeting.\n\n(Milei delivered his remarks in Spanish, of course, so an interpreter did simultaneous translation. That means the text I'm quoting from is choppyandimperfect, but it's good enough to give", "I realize it's anti-Semitic to refer toIsraelas a foreign country", "I wonder how many people in Israeli intelligence will be fired", "I'm sure the media will say: \"All the ridiculous, over-the-topandabsurd hatredandHitler comparisonsandassociated stupidity led to this act of violence\"", "I wonder how many people in Israeli intelligence will be fired", "I'm sure the media will say: \"All the ridiculous, over-the-top and absurd hatred and Hitler comparisons and associated stupidity led to this act of violence\"", "Some excerpts from Javier Milei's speech at the World Economic Forum's Davos meeting.\n\n(Milei delivered his remarks in Spanish, of course, so an interpreter did simultaneous translation. That means the text I'm quoting from is choppy and imperfect, but it's good enough to give", "I'm not denouncing backward and barbaricHamasenough for you, so we all know what that must mean!\n\nYou sound like a leftist\n\n\"Uhhhhhhhhhh you disagree with me so I bet you're motivated by hate\"\n\nPlease wipe up the drool you left on the floor", "Just a question on my mind dear professor as to what is really driving you?"], "People4Bernie": ["8 yrs ago Bernie spoke in this parkandI was in the crowd that day -@AOC", "\"Forty-five thousand dead, you're arresting kids instead\"", "\"I'm tired of hearing about how a two bit union buster thinks of himself as more of a patriot than the woman who fights every single day to lift working people out from under the boots of greed trampling on our way of life\"@AOC", "Unionize Tesla worldwide.#SolidaritySeason", "Elon Musk picked a fight with Nordic workers. We’re gonna make him lose. Help us get the message out: Dear@elonmusk- Get unionized or get out!", "8 yrs ago Bernie spoke in this park and I was in the crowd that day -@AOC", "\"Forty-five thousand dead, you're arresting kids instead\"", "Democrats in California quietly killed a bill (#CalCare) that was supported by 250+ organizations, including major unions representing millions of workers, which would have transitioned the state to a single-pqyer health care system. A complete surrender to corporate health care.", "Fixed your subtitle. That's all that has to be said."], "latimes": ["Thousands chant “Cease Fire Now” at a demonstration in Downtown LA.", "About 150 actors gathered at a bar in L.A. Wednesday night to celebrate the end of the#actorsstrike. With drinks in hand, they chanted “When we fight, we win\" into the night air. Go inside the#sagaftracelebrations:https://latimes.com/entertainment-arts/business/story/2023-11-09/sag-aftra-strike-ends-party…@PamelaChelin", "The march is ending at Pershing Square in downtown LA. \nIt had a festive atmosphere. Demonstrators held signs that said “Free Palestine”and“Cease Fire Now”", ".@ramyYoussef on#Artists4Ceasefire's presence at the#Oscars: \"Let's just stop killing children.\"\n\nRead more:https://latimes.com/entertainment-arts/awards/story/2024-03-10/oscars-2024-academy-awards-red-carpet-buttons-artists-for-ceasefire…", "Thousands chant “Cease Fire Now” at a demonstration in Downtown LA.", "The march is ending at Pershing Square in downtown LA. \nIt had a festive atmosphere. Demonstrators held signs that said “Free Palestine” and “Cease Fire Now”", ".@ramyYoussef on#Artists4Ceasefire's presence at the#Oscars: \"Let's just stop killing children.\"\n\nRead more:https://latimes.com/entertainment-arts/awards/story/2024-03-10/oscars-2024-academy-awards-red-carpet-buttons-artists-for-ceasefire…", "“The strike officially ends at 12:01 a.m. on Thursday, November 9,”#sagaftrasaid in a statement after the Hollywood actors’ union negotiating committee approved a a tentative deal with the major studios.https://latimes.com/entertainment-arts/business/story/2023-11-08/actors-strike-sag-aftra-amptp-contract-deal-ai-streaming…#AMPTP"], "WSJ": ["Palestinian militants launched the biggest attack onIsraelin years, sending fighters over the borderandfiring rockets.Israelsaid it was prepared for war.", "Breaking: Iran helped plan Hamas’s attack onIsraelandgave the green light for the assault at a meeting last Mondayhttps://on.wsj.com/46AJThW", "AGazachief's private messages reveal a brutal strategy: Civilian bloodshed will help Hamashttps://on.wsj.com/3XeM2yAhttps://on.wsj.com/3XeM2yA", "The New York Police Department has deployed additional resources to Jewish communitiesandhouses of worship in New York City following militants' attack onIsrael, Mayor Eric Adams said", "Breaking: Iran helped planHamas’s attack on Israel and gave the green light for the assault at a meeting last Mondayhttps://on.wsj.com/46AJThW", "Palestinian militants launched the biggest attack on Israel in years, sending fighters over the border and firing rockets. Israel said it was prepared for war.", "A Gaza chief's private messages reveal a brutal strategy: Civilian bloodshed will helpHamashttps://on.wsj.com/3XeM2yAhttps://on.wsj.com/3XeM2yA", "Imran Khan, the Pakistani opposition leader whose supporters have come to refer to him as prisoner No. 804, delivered a stinging defeat to the country’s militaryhttps://on.wsj.com/3SK2H9p"]}