{"RevBlackNetwork": ["“There have also been hundreds of Greens elected across the nation, from state legislatures & mayors down to local zoning boards.”\n\nYou can criticize the Green Party without LYING. They have built power, especially locally as Democrats sued them & establishment runs neg coverage!", "To all you Biden-isn’t-in-cognitive-decline,\n\nWelcome to dementia.\n\nWell done.", "Please report billionaires, trying to overthrow democratically elected foreign leaders might be a sign of…", "You only won because of our grassroots money & organizing.\n\nNow you weaponize OUR victory not to challenge the system as an outsider but to punch down as an insider at the very ppl whose platform you plagiarized then swiftly betrayed, you performative genocidal liberal sellout.", "Please report billionaires, trying to overthrow democratically elected foreign leaders might be a sign of…", "“There have also been hundreds of Greens elected across the nation, from state legislatures & mayors down to local zoning boards.”\n\nYou can criticize the Green Party without LYING. They have built power, especially locally as Democrats sued them & establishment runs neg coverage!", "CONGRATULATIONS to our very own@SabbySabs2for reaching 100k subscribers! We at RBN are so proud of herandwish her a continued success in informing people & fighting for liberation for all!", "You only won because of our grassroots money & organizing.\n\nNow you weaponize OUR victory not to challenge the system as an outsider but to punch down as an insider at the very ppl whose platform you plagiarized then swiftly betrayed, you performative genocidal liberal sellout."], "TheDemocrats": ["For too long, junk fees have caught Americans by surprise.\n\nPresident@JoeBidenis taking on price gouging by:Cutting credit cardandoverdraft feesRequiring companies to tell you the total price upfrontCracking down on surprise rental fees", "On Missing or Murdered Indigenous Persons Awareness Day, we acknowledge the tragic injustices NativeandIndigenous communities have faced.\n\nDemocrats are working across jurisdictions to stop this cycle of violenceandprovide communities with the resources necessary to keep", "Eleven years ago, we lost 20 studentsand6 staff members at Sandy Hook Elementary School. We honor the memories of the lives lost in this tragedyandwill not rest in our fight to pass gun safety reforms. Every child deserves to feel safe in school.", "In the aftermath of last night’s mass shooting in Lewiston, Maine, we mourn for those who have lost loved ones.\n\nWe are praying for the safety of everyone in Maine as they continue to search for the gunman.", ".@JoeBidenhas the pro-worker record Trump wishes he could claim:Made history by joining UAW workers on the picket line in solidarityHelped save the auto industry in 2009 as vice presidentandrevitalized DetroitHelped create a historic manufacturing boom", "The Biden-Harris administration is ensuring a safer future for the next generation.\n\nThe first-ever Office of Gun Violence Prevention, overseen by Vice President Harris, has played a crucial role in passing the most comprehensive gun control legislation in 30 years.", "The Biden-Harris administration has fought for the American people:Protected marriage for LGBTQI+andinterracial couplesEnding our failed approach to marijuanaThe first meaningful gun violence reduction legislation in 30 yearsHistoric student debt relief", "President@JoeBidenis traveling toIsraelto stand in solidarity with its people in the face ofHamas’ brutal terrorist attack.", "“Despite how painful this is ... the outrageandjust the sheer painandshock of what’s happening, I’m still going to keep doing what I’m doing—focus on fighting against hateandantisemitismandIslamophobia.” —Second Gentleman@DouglasEmhoff", "Tonight at 8 p.m. ET, President@JoeBidenwill address the nation on our response toHamas’ terrorist attack againstIsraelandRussia’s war in Ukraine.", "Last year, President@JoeBidenand@DrBidenunveiled the White House menorah, the first-ever permanent Jewish artifact in the White House collection.\n\nChag urim sameach!", "Humanitarian assistance has arrived inGazaandreached Palestinians in need.\n\nPresident@JoeBidenis committed to ensuring that civilians inGazawill continue to have access to food, water, medical care,andother assistance without diversion byHamas.", "Second Gentleman@DouglasEmhoffwas born in Brooklyn, New York. He spent most of his childhood in New Jersey with his parentsandsiblings before his family moved to California. He went on to become an attorney who practiced law for over 30 years.\n\nDoug met Vice President Kamala", "Seven years ago today, Trump announced his unconstitutionalMuslimtravel ban.\n\nNow he’s vowing to “restoreandexpand” his ban if reelected.", "We’re standing up for families like Latorya Beasley’s, who used the miracle of IVF to start her family—only to have that right taken away when she wanted a second child.\n\nWe won’t allow MAGA Republicans to tell families that their dream has to wait."], "msnbc": [".@rafsanchezon the latest death toll after Hamas’ attack inIsrael: “Israeli Emergency Services are now saying 40 Israelis confirmed dead, some 800 wounded… The Palestinian Health Ministry is saying 200 people are dead inside ofGaza, 1600 wounded.”", "\"In a very constructive meeting with Prime Minister Netanyahu today, he confirmed to me thatIsraelaccepts the bridging proposal. He supports it.\"\n\nSecretary Blinken says Israeli PM Netanyahu accepted the bridging proposal for a cease-fire that the U.S. put forward last week.", "InsideGaza's overrun hospitals, scenes of chaosandhorror. An NBC News crew visited a hospital on the brink of collapse, finding young children with bloody limbsandinjured people awaiting treatment on the floor.", "InTelAviv, Biden backsIsrael, says 'terrorist group inGaza’ apparently responsible for hospital blast", "-Israeli fighter jets have struck 450 targets in northernGazain 24 hours\n\n-AnIDFspokesman said that \"fighting will intensify\"andwarned that scenes coming out ofGazawould be \"difficult to understandandcope with.\"https://nbcnews.com/news/world/live-blog/israel-news-live-updates-scale-atrocities-emerges-gaza-bombardment-goe-rcna119855…", "Israeldenies responsibility for hospital attack.IDF: “Intelligence from multiple sources we have in our hands indicates that IslamicJihadis responsible for the failed rocket launch which hit the hospital inGaza.”", "Six hostages were found dead inGazaon Saturday, including Israeli American, Hersh Goldberg-Polin, whose parents have been outspoken advocates for bringing Hamas captives home.", "BREAKING: President Joe Biden outlines a new three-phase proposal designed to end fighting betweenIsraelandHamas, including a total cease-fire, return of hostagesandrebuilding ofGaza.", "“We are now preparing for a ground war here.”  \n\nNBC News Chief Foreign Correspondent Richard Engel reports from near theGazaborder inIsrael.", "Pres. Biden on Hamas terror attack: “The deadliest day for Jews since the Holocaust...Silence is complicity…I refuse to be silent.”"], "FoxNews": ["Average Palestinian inGazasurviving on only 2 pieces of bread per day: UN human rights official", "Jewish mother, family attacked at elementary school graduation by agitators yelling 'Death toIsrael': report", "Israelset to counter Hezbollah following terror attack: 'response will be swift, harshandpainful'", "Israelbegrudgingly accepts Biden’sGazadeal: ‘Not a good plan’", "Israel'outright rejects' foreign efforts to create Palestinian state after Hamas war, Netanyahu declares", "Blinken delivers strongest public rebuke ofIsraelyet: 'Get out ofGaza'", "TAKING ACTION: MMA-trainedrabbiteaches self-defense to Jewish community as Jews across the world subject to rising violence in wake ofHamasattack on civilians.https://trib.al/SFDF3YC", "'WE'LL MURDER YOU': The protester made terroristic threats toward city leaders after they did not back a cease-fire resolution againstIsrael.https://trib.al/XmW3HaN", "'HELL TO PAY':@NikkiHaleywrote a clear message toHamason anIDFartillery shell during her visit toIsraelwhere she met with October 7 survivorsandmilitary leaders. Details about her tour:https://trib.al/Noax8El"], "TheAtlantic": [], "aldotcom": ["The University of Alabama at Birmingham health system has paused in vitro fertilization procedures following an Alabama Supreme Court decision due to fear of criminal prosecutionandlawsuits, a spokeswoman said.\n\nRead more:https://al.com/news/2024/02/uab-pauses-in-vitro-fertilization-due-to-fear-of-prosecution-officials-say.html?utm_campaign=aldotcom_sf&utm_medium=social&utm_source=twitter…", "The Alabama Senate on Thursday approved legislation banning the sale of meat produced from cultured animal cells. The bill goes to the House.\n\n“I don’t want Alabamians eating that,\" Sen. Jack Williams, the bill's sponsor, told Alabama Daily News.", "A 12-year-old grill master from Alabama has been crowned winner of@MasterChefJrFOX. Congratulations, Bryson \"Cheese Curd\" McGlynn!https://al.com/life/2024/05/alabamas-bryson-mcglynn-wins-masterchef-junior-impresses-gordon-ramsay-you-did-it-man.html…", "After days of lengthy debate, an effort to ban diversity, equityandinclusion programs in Alabama state institutions will now head to the governor’s desk.\n\nRead more here:https://al.com/educationlab/2024/03/alabama-sends-bill-banning-college-dei-programs-training-to-governors-desk.html?utm_campaign=aldotcom_sf&utm_medium=social&utm_source=twitter…", "The Alabama Senate on Thursday approved legislation banning the sale of meat produced from cultured animal cells. The bill goes to the House.\n\n“I don’t want Alabamians eating that,\" Sen. Jack Williams, the bill's sponsor, told Alabama Daily News.", "A 12-year-old grill master from Alabama has been crowned winner of@MasterChefJrFOX. Congratulations, Bryson \"Cheese Curd\" McGlynn!https://al.com/life/2024/05/alabamas-bryson-mcglynn-wins-masterchef-junior-impresses-gordon-ramsay-you-did-it-man.html…", "U.S.@SenKatieBrittdelivered the Republican rebuttal to President Joe Biden’s 2024 State of the Union address from her home in Enterprise, Alabama. Here's what she said:", "After days of lengthy debate, an effort to ban diversity, equityandinclusion programs in Alabama state institutions will now head to the governor’s desk.\n\nRead more here:https://al.com/educationlab/2024/03/alabama-sends-bill-banning-college-dei-programs-training-to-governors-desk.html?utm_campaign=aldotcom_sf&utm_medium=social&utm_source=twitter…"], "JudiciaryGOP": ["We're coming to Arizona. \n\nWHAT: Field hearing, \"The Biden Border Crisis: Arizona Perspectives.”\n\nWHEN: Friday, May 10, 2024, at 10:00 a.m. MST\n\nWHERE: Sahuarita Council Chambers at 375WestSahuarita Way, Sahuarita, Arizona\n\nWITNESSES: \n\n-Chris Clem, Retired Chief Border Patrol", "House GOP lawmakers uncover evidence of coordination between Democrat J6 panel, Georgia prosecutor", "Cover up? \n\n“Ex-disinformation chief told to ‘be as vague as possible’ amid board collapse”", "We are LIVE today in Philadelphia for a field hearing examining violent crime in the Democrat-run city. \n\nTune in here:", "-The Biden “brand.”  \n-10% for the Big Guy  \n-50% of earnings  \n-Shakedowns  \n-Fake Names  \n-Shell companies   \n-Multiple family members getting paid  \n-Multiple times the White House changed their story  \n-Dinners  \n-Meetings \n-Checks\n\nBut sure, HunterandJoe did nothing wrong!", "#BREAKING:@Jim_JordanSubpoenas BlackRockandState Street in ESG Investigation\n\nRead more here"], "MSNBC": ["“The defense ofIsraelis still critical,” President Joe Biden tells Jonathan Capehart. “But there's red lines that if he crosses…cannot have 30,000 more Palestinians dead.”", "Defense Secretary Austin gives update onIsrael:\n\n“As President Biden has said, for any country, for any organization, for anyone thinking of trying to take advantage of the agony inIsraelto tryandwiden this conflict or to spill more blood, we have just one word: don’t.”", "NEW: Pres. Biden was asked how he could be sure the Israelis weren’t behind theGazahospital strike.\n\n“The data I was shown by my Defense Department,” he said.", "President Biden calls Hamas terrorist attacks “sheer evil”andvows “we stand withIsrael” as 14 Americans killed. \n\n\"There are moments in this life... when the pure, unadulterated evil is unleashed on this world. The people ofIsraellived through one such moment this weekend.\"", "The death toll for Americans from Hamas' terror attack onIsraelandthe subsequent war now stands at 30, per State Department spokesperson. 13 Americans are missing.", "BREAKING: State Department confirms at least 22 Americans killed inIsrael", "Lawmakers were told at a  briefing tonight there had been four American fatalities as a result of the Hamas attacks inIsrael, a number they were told is expected to rise.", "Hamassays it’s willing to release all civilian hostages immediately “if the bombing stops” inGaza.@RichardEngelreports.", "Six hostages were found dead inGazaon Saturday, including Israeli American, Hersh Goldberg-Polin, whose parents have been outspoken advocates for bringingHamascaptives home.", "A senior Israeli official who gave NBC News details on a tentative agreement withHamassays there is an option to extend a ceasefire for extra days in return for 10 hostages per day.\n\nNBC News Foreign Correspondent@rafsanchezhas more on the outlines of the possible deal.", ".@RichardEngelreports from Sderot,Israelamid a “barrage” of incoming mortar fire, some also “appear to be rockets.” Engel reports on new infiltrations, ofHamassending more fighters through breaches in the border fence.", "\"In a very constructive meeting with Prime Minister Netanyahu today, he confirmed to me thatIsraelaccepts the bridging proposal. He supports it.\"\n\nSecretary Blinken says Israeli PM Netanyahu accepted the bridging proposal for a cease-fire that the U.S. put forward last week.", "NBC News Exclusive:\n'Top secret'Hamasdocuments show that terrorists intentionally targeted elementary schoolsanda youth center", "BREAKING: VP Harris speaks after meeting with Israeli PM Netanyahu\n\nHarris calling for an immediate cease-fire deal to free the hostages. \n\nThe VP saying she “will not be silent\" about the suffering inGaza, the \"devastating\" loss of lifeandthe \"dire\" humanitarian crisis.", "Israeli Prime Minister Benjamin Netanyahu says it’s a time for “moral clarity”andthanks Secretary of State Blinken for being inIsrael.\n“Thank you America for standing withIsraeltoday, tomorrow,andalways.”", "BREAKING: President Joe Biden outlines a new three-phase proposal designed to end fighting betweenIsraelandHamas, including a total cease-fire, return of hostagesandrebuilding ofGaza.", "NEW: A convoy of 17 aid trucks has entered the Rafah border crossingandappears to be headed intoGaza, as the U.S. military increases its presence in the region.@JoshNBCNewsreports."], "NBCNews": ["LIVE UPDATES:Israel-Hamas war\n\n• Hostages were holding a white cloth when they were killed by Israeli soldiers, theIDFsays.\n\n• Protest erupts inTelAvivafter theIDFadmits it mistakenly killed 3 Israeli hostages.", "BREAKING: Prime Minister Netanyahu saysIsraelis at war, ordering retaliation against Hamas militants who launched an unprecedented attack from theGazaStrip.https://nbcnews.com/news/world/live-blog/live-updates-hamas-israel-gaza-attack-rockets-gunmen-palestinian-rcna119316?cid=sm_npd_nn_tw_ma&taid=6521331c7810a500012bc754&utm_campaign=trueanthem&utm_medium=social&utm_source=twitter…", "Israelis line up to donate blood at a medical center inTelAvivafter Hamas' attack.Amir Levy / Getty Imageshttp://nbcnews.app.link/fYHmYp3GHDb", "LIVE UPDATES:Israelsays it has retaken control of border withGaza:\n\n• At least 900 dead inIsrael,IDFsays\n\n• At least 770 dead inGaza, according to theGazaHealth Ministry\n\n• Hamas says it will not discuss prisoner swap as active battle continues", "BREAKING:Israelsays it is back in control of all territory near theGazaborder 48 hours after the surprise Hamas attack, but warns militants may still be at largehttps://nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna119435?cid=sm_npd_nn_tw_ma&taid=6523c3e97810a500012c3603&utm_campaign=trueanthem&utm_medium=social&utm_source=twitter…", "Israelis line up to donate blood at a medical center inTelAvivafterHamas' attack.Amir Levy / Getty Imageshttp://nbcnews.app.link/fYHmYp3GHDb", "ISRAEL-HAMASWAR LIVE UPDATES:\n\n• 1,300+ Israelis killed. 1,400+ people killed inGaza•Israelsays \"complete siege\" will not be lifted untilHamasreleases hostages \n• Israeli military preparing for potential ground assault onGaza•Gazahospitals operating without power", "BREAKING: Prime Minister Netanyahu saysIsraelis at war, ordering retaliation againstHamasmilitants who launched an unprecedented attack from theGazaStrip.https://nbcnews.com/news/world/live-blog/live-updates-hamas-israel-gaza-attack-rockets-gunmen-palestinian-rcna119316?cid=sm_npd_nn_tw_ma&taid=6521331c7810a500012bc754&utm_campaign=trueanthem&utm_medium=social&utm_source=twitter…", "LIVE UPDATES:Israelsays it has retaken control of border withGaza:\n\n• At least 900 dead inIsrael,IDFsays\n\n• At least 770 dead inGaza, according to theGazaHealth Ministry\n\n•Hamassays it will not discuss prisoner swap as active battle continues", "BREAKING:Israelsays it is back in control of all territory near theGazaborder 48 hours after the surpriseHamasattack, but warns militants may still be at largehttps://nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna119435?cid=sm_npd_nn_tw_ma&taid=6523c3e97810a500012c3603&utm_campaign=trueanthem&utm_medium=social&utm_source=twitter…"], "RandPaul": ["America must demand a change, a change in behavior from those who do not acceptIsrael's right to exist from those who actively seek the destruction of the State ofIsraelandmurder innocent Israelis. Today I offered an amendment to do just that.", "My thoughtsandprayers are with the people ofIsrael. These horrificandviolent acts of terrorism should be universally condemned.", "‘Black Swan’ author Nassim Taleb, who correctly called the 2008 financial crisis, says the U.S. is in a ‘death spiral’ over government debt", "The media is clamoring to know what Biden will do to punish Iran or its proxies for killing our soldiers. \n\nThe question not being asked is what Biden could have done to prevent the tragic deaths of 3 of our soldiers in Jordan.", "5. Untracked Humanitarian Aid: Brace yourselves for this one, too - the Swamp allocated over $5.6 billion for humanitarian needs inIsraelandUkraine, with little to no assurances it won't end up in the hands of Hamas. The bill merely requires the State Dept.andUSAID to", "America must demand a change, a change in behavior from those who do not acceptIsrael's right to exist from those who actively seek the destruction of the State ofIsraelandmurder innocent Israelis. Today I offered an amendment to do just that.", "My thoughtsandprayers are with the people ofIsrael. These horrificandviolent acts of terrorism should be universally condemned.", "‘Black Swan’ author Nassim Taleb, who correctly called the 2008 financial crisis, says the U.S. is in a ‘death spiral’ over government debt", "The media is clamoring to know what Biden will do to punish Iran or its proxies for killing our soldiers. \n\nThe question not being asked is what Biden could have done to prevent the tragic deaths of 3 of our soldiers in Jordan.", "5. Untracked Humanitarian Aid: Brace yourselves for this one, too - the Swamp allocated over $5.6 billion for humanitarian needs inIsraelandUkraine, with little to no assurances it won't end up in the hands ofHamas. The bill merely requires the State Dept.andUSAID to"], "politico": ["Swing-stateMuslimleaders launch campaign to ‘abandon’ Biden in 2024", "Biden administration thinks Netanyahu may not last politically", "Lindsey Graham: Time to designate Russia a state sponsor of terrorism", "Centrist GOP effort to reinstate McCarthy picks up steam afterIsraelattacks", "Stefanik wants ‘consequences’ for colleges over antisemitism after her questions goes viral", "Donald Trump escalated his attacks on Jewish Dems today, saying “any Jewish person that voted for [Harris] or [Biden] … should have their head examined.”"], "joncoopertweets": ["Yesterday, two Ukrainian soldiers ran out of ammunitionandsurrendered. Instead of taking them as POWs, Russian troops EXECUTED them in cold blood.\n\nIf House Republicans fail to approve more military aid to Ukraine, murders like that will be repeated thousands of times over.", "Putin sacrificed Russia to save himself.\n\nNetanyahu sacrificedIsraelto save himself.\n\nTrump is happily sacrificing America to save himself.", "Putin killed Navalny. TrumpandJohnson are doing Putin’s bidding to deny military aid to Ukraine. Not a coincidence. \n\nWake up, you fucking GOP cowards — the blood of an allied nation will be on your hands if you fail to act.#UKRAINEAID NOW!!!", "Below is a current list of House members who’ve signed the discharge petition to force a vote on the Senate's bipartisan Ukraine-Israel-Taiwan aid bill. 218 signatures are needed.If your rep isn’t listed, call 202-224-3121 TODAYandurge them to sign!", "It’s a fact:@SpeakerJohnsonandthe House Republican caucus are protecting fentanyl smugglers, child sex traffickersandterrorists. \n\nIf they think that will be a winning election message, they’re going to have a very rude awakening when the GOP gets decimated in November.", "During the DNC, Tim Walz’s son Gus cried from the loveandpride he felt while watching his dad give a speech, saying “That’s my Dad!” \n\nMAGA bullies mockedandbelittled Gus, who is neurodivergent.\n\nSIGN HERE to demand an apology for these GOP attacks!", "To be fair, I’m pretty sure I count 20 vehicles — if you include the bus!", "Yes, you’re right, Judd. Although the summary of the ActBlue receipt says Pittsburghanddoes not list the street address, the actual FEC filing does list the street address in Bethel Park. I deleted my tweet 45 minutes ago as soon as this was brought to my attention. My error.", "I totally agree with you. It’s such a shame —andmoreover, I think it’s a disservice to justice in the broadest sense.", "All the pundits spending endless time debating whether Trump literally committed insurrection conveniently forget the “or given aid or comfort” part of the 14th amendment. Trump is guilty of both, but at least don’t forget about the second part. \n\nIt’s insane how many people who", "Yesterday, two Ukrainian soldiers ran out of ammunitionandsurrendered. Instead of taking them as POWs, Russian troops EXECUTED them in cold blood.\n\nIf House Republicans fail to approve more military aid to Ukraine, murders like that will be repeated thousands of times over.", "It’s increasingly likely Iranian President Raisi was KILLED in today’s helicopter crash. They haven’t even found the crash site in the mountainous forests, in the darkandheavy rain. Raisi was a hardliner long seen as a potential successor to supreme leader Ayatollah Khamenei.", "Military aid toIsraelandUkraine should be coupled together. Putin apologist Mike Johnson can go screw himself.", "Putin killed Navalny. TrumpandJohnson are doing Putin’s bidding to deny military aid to Ukraine. Not a coincidence. \n\nWake up, you fucking GOP cowards — the blood of an allied nation will be on your hands if you fail to act.#UKRAINEAID NOW!!!", ".@PolitiFact: \"Joe Biden is correct that violent crime is near a 50-year low. Despite a spike in murder in 2020 amidst the emergence of  COVID, even homicides have declined.'\"\n\n𝗪𝗵𝘆 𝘄𝗼𝗻’𝘁 𝗺𝗮𝗶𝗻𝘀𝘁𝗿𝗲𝗮𝗺 𝗺𝗲𝗱𝗶𝗮 𝗿𝗲𝗽𝗼𝗿𝘁 𝘁𝗵𝗶𝘀?", "URGENT: Call@SpeakerJohnsonTODAY at 202-225-4000anddemand that he bring the bipartisan#Ukrainefunding bill to the House floor for a vote. The war situation in Ukraine is dire. EACH DAY OF DELAY IS COSTING INNOCENT LIVES — THEIR BLOOD IS ON HIS HANDS!#SlavaUkraïni", "Seizing $5 billion to $6 billion in frozen Russian assets for Ukraine aid is definitely a great start. Let’s do this!!", "I’m so terribly sorry to learn of the tragic loss of your two friends. Sheer barbarism by Russia — we will never forget!!!"], "HomelandDems": ["AGAIN: Extreme MAGA Republicans are NOT serious about fixing our broken immigration system.\n\nThey’re only concerned with political gamesandpolitical pain.", "Murphy: If you are serious about getting results, you have to be working across the aisle. My impression is that Speaker Johnson has not spent one minute trying to work across the aisle trying to get a deal on immigration.", "JUST IN: Congressman@BennieGThompsonintroduced legislation to ensure no Secret Service protection for convicted felons sentenced to prison.\n\nREAD MORE HERE:https://bit.ly/3UrLt2J", "Even Republicans’ favorite witness agrees that impeaching Secretary Mayorkas is baselessandnot founded in the Constitution", "Jonathan Turley on Fox & Friends dumps on the GOP push to impeach Mayorkas: \"I just don't believe they have a cognizable basis here for impeachment.\"", "Nope. \n\nCBP has told us timeandagain that need more resources (andstaffing). \n\nThe Speaker,andextreme MAGA Republicans, are gleefully standing in the way of the President’s request to get more $andstaff to CBP.", "Tapper: Some people are saying why not pass the $14 billion supplemental \n\nJohnson: That won’t help\n\nTapper: I’m sure the CBP agents think it might do something\n\nJohnson: Nope\n\nTapper: They don’t want the $14 billion?", "Republicans agree: Republicans don’t want to actually fix the problems at the border.", "Roy: In 2018 we had the House, we had the Senate, we had The White House  and we had a bigger majority than we have today and we utterly failed to secure the border. Totally dropped the ball. Didn’t do it.", "Fun fact: Republicans voted against legislation for more CBP OfficersandAgents.\n\nThey also said “not another dime” for CBP for more resourcesandstaffing.", "Kirby: So just by the sheer numbers in the votes the House Republicans have said they don't favor increasing the number of border agents and you heard Johnson that they are not interested in moving forward on the president's national security supplemental..", "Nope. \n\nCBP has told us timeandagain that need more resources (andstaffing). \n\nThe Speaker,andextreme MAGA Republicans, are gleefully standing in the way of the President’s request to get more $andstaff to CBP.", "Tapper: Some people are saying why not pass the $14 billion supplemental \n\nJohnson: That won’t help\n\nTapper: I’m sure the CBP agents think it might do something\n\nJohnson: Nope\n\nTapper: They don’t want the $14 billion?", "WATCH: Ranking Member@RepSwalwelldelivers his opening statement during today’s hearing on@DHSgov’sand@CISAgov’s role in securing AI.\n\n “As we promote advancements in AI, we must remain cognizant that it is a potent dual-use technology.”"], "HouseJudiciary": [], "RepSwalwell": ["Juneteenth is a celebration of freedom.\n\nIt is also a reminder of how far our country has progressedandof the work we are still doing to ensure equality for all.", "GOP's hypocrisy exposed: Blocking IVF access,andbetraying their 'pro-family' stance.\n\nDenying countless Americans the right to build families.#SOTU", "The president is too nice. The guy who blows off his own subpoena (Jordan)andthe guy who has a shady business deal with his brother (Comer) are probably not worthy of a response. But Joe Biden is a better man than most.", "Thank you for a few friends who just reminded me, gay men use IVF to start families too. This is a war on parents. A war on families.", "For two years now Ukrainians have valiantly defended their homeland. But they still need our support. \n\nAid for Ukraine is more important than the MAGA movement’s desire to please their leader, Donald Trump. Now is not the time to walk away from this fight by being soft on Putin.", "On this#WorldAIDSDay, I am joining my colleagues in the@EqualityCaucusto encourage testing, promote education,andend stigmas about HIV & AIDS. Let’s#StopHIVTogether.", "Thanks to@POTUS, $138 billion in student loans have been forgiven!#SOTU"], "NPR": [], "CNN": [], "LPMisesCaucus": [], "RealSpikeCohen": ["Absolutely.Andthe groups funded in Iraq which later formed ISIS.AndHussein,andNoriega.\n\nThe US government has a long history of creating its next enemies.", "The man was walking down the street, neither harming nor threatening anyone.\n\nRename yourselves @KARENS_organdthen delete your account.", "RFK has been a welcome voice on many issues.\n\nHe's also not a Libertarian,andhis take onIsraelandPalestine has been about as bad as it gets. \n\nIf he seeks our nomination, I'll see to it that he loses.", "RFK Jr. on CNN: My campaign is “looking at” seeking the Libertarian Party nomination to get ballot access in all 50 states\n\n“We have a really good relationship with the Libertarian Party. I’m going to be speaking at the California LP Convention… and we’re talking about me", "\"There is not a single abolitionist who would not grab a feasible method, or a gradual gain, if it came his way. The difference is that the abolitionist always holds high the banner of his ultimate goal, never hides his basic principles,andwishes to get to his goal as fast as", "\"We don't want our club to be burned to the ground, so we've given in to the demands of violent people.\"", "This is Cheyenne Benthin, with her son Heston. \n\nHeston died one night, the autopsy found it was caused by natural causes, but the@GilbertPolicetook Cheyenne's daughter from her anyway, and now she's living every parent's worst nightmare. \n\nWe're going to get her daughter back,", "The government helped create the unstable conditions around the world that are causing a surge of people to come here. \n\nThe government offers free food, housing, phones and more to anyone who enters, but in most cases doesn't allow them to work.\n\nThe government makes it", "\"Oh huh huh I guess that means Israel too!\"\n\nYes. That means Israel too.\n\nYou must be new here. Welcome.", "\"The first atomic bomb was an unnecessary experiment ... It was a mistake to ever drop it ... the scientists had this toy and they wanted to try it out, so they dropped it. \"\n\n— Fleet Admiral William Halsey Jr.", "Haley was governor of my state. \n\nShe ran on many promises: reigning in spending, ending the backroom deals in Columbia, signing permitless carry of firearms into law, and many other very good promises.\n\nShe did exactly 0% of them.\n\nShe then became Trump's chief neocon at the UN.", "Barack Obama murdered a 16 year old American citizen.\n\nHe claimed absolute immunity for it, and the courts dismissed the case against him.\n\nYou were Vice President when it happened.\n\nWell anyway you probably don't remember."], "YATPOfficial": ["Joslyn Sanders was expecting to go into court last Wednesday in Denton, TX to hear the news that she would be given her son, Josiah Sanders, back from the state’s care. As we’ve come to expect, the state isn’t wanting to give up their control so easily.\n\nIn the courtroom, Texas", "This is JoslynandJosiah Sanders.\n\nJosiah was a healthy baby boy born in May of 2021.\n\nAfter Joslyn stopped breastfeeding Josiah in March of 2023, he experienced some eating difficultiesandhad a minor seizure. A visit to the ER revealed Josiah had a mild calcium deficiency. A", "Meet the Hernandez family. That's MattandTuckey smiling with their beautiful young daughters.\n\nOver the past few months, the Georgia state government has ripped this family apart, because one of their daughters has a medical condition that the court refuses to acknowledge.", "Meet the Williams.\n\nAfter growing up with four foster brothers, Jennifer was looking forward to following in that tradition with her own home. While dating Jonathon, he was all-in on doing the same. \n\nThey have always believed it was their job to not only protect the children in", "Joslyn Sanders was expecting to go into court last Wednesday in Denton, TX to hear the news that she would be given her son, Josiah Sanders, back from the state’s care. As we’ve come to expect, the state isn’t wanting to give up their control so easily.\n\nIn the courtroom, Texas", "This is Joslyn and Josiah Sanders.\n\nJosiah was a healthy baby boy born in May of 2021.\n\nAfter Joslyn stopped breastfeeding Josiah in March of 2023, he experienced some eating difficulties and had a minor seizure. A visit to the ER revealed Josiah had a mild calcium deficiency. A", "Meet the Hernandez family. That's Matt and Tuckey smiling with their beautiful young daughters.\n\nOver the past few months, the Georgia state government has ripped this family apart, because one of their daughters has a medical condition that the court refuses to acknowledge.", "Meet the Williams.\n\nAfter growing up with four foster brothers, Jennifer was looking forward to following in that tradition with her own home. While dating Jonathon, he was all-in on doing the same. \n\nThey have always believed it was their job to not only protect the children in"], "justinamash": ["I’m the only candidate in this U.S. Senate race who consistently supportsanddefends the First Amendment—the freedom of religion, speech, press, peaceable assembly,andexpression of every kind.", "“I don’t believe that we shall ever have a good money again before we take the thing out of the hands of government. [Since] we can’t take [it] violently out of the hands of government, all we can do is by some sly, roundabout way introduce something they can’t stop.”\n—F.A. Hayek", "Wishing you a blessed Good Friday (andsecond Friday of Lent to my fellow Orthodox Christians).", "Rememberingandhonoring those who sacrificed everything to liberate people from tyranny 80 years ago today.", "Follow the Constitution.\nRead the bills.\nStop governing by emergency.\nEnd the forever war.\nCut taxes & spending.\nStop borrowing trillions.\nNo CBDC.\nProtect free speech.\nRepeal the Patriot Act & FISA 702.\nNo qualified immunity for government officials.\nEnd civil asset forfeiture.", "Offensive military operations without congressional authorization—in Syria, Iraq, or elsewhere—are unconstitutionalandunlawful. Before ordering acts of war, a president needs the express approval of the people’s representatives in Congress. Any order that disregards this", "End the Patriot Act.\nEnd FISA 702.\nEnd no-conviction watchlists.\nEnd NDAA indefinite detention.\nEnd the 2001 AUMF.\nEnd the illegal wars.", "President Biden needs to stop demanding that Americans fund other countries’ wars. Congress hasn’t declared war in aid of any other country. Biden wants it both ways: Financing the wars—andurging Americans to support the war efforts—while taking no responsibility for the wars.", "Prayers for those injured in the shooting at the Rochester Hills splash padandfor their families.", "We must prevent adoption of a centralbankdigital currency but then also take the next step of denationalizing money. Bitcoin is the most promising money innovation in our lifetime. We need a wall of separation between moneyandstate. Click here to help:https://secure.justinamash.com/donate?source_code=x…", "What the U.S. government is doing to Julian Assange puts all journalists at riskandundermines press freedom. He faces prosecution for journalism—for publishing materials exposing war crimesandother horrors in AfghanistanandIraq. Uphold the 1st Amendment. Free or pardon him.", "In approving unconstitutional, warrantless surveillance of Americans, so many members of the House betrayed the American people—disregarding the Fourth Amendmentandtrashing our rights—that the list of yeas barely fits legibly on a screen.\n\nThe attached images show the", "President Biden needs to stop demanding that Americans fund other countries’ wars. Congress hasn’t declared war in aid of any other country. Biden wants it both ways: Financing the wars—andurging Americans to support the war efforts—while taking no responsibility for the wars.", "Follow the Constitution.\nRead the bills.\nStop governing by emergency.\nEnd the forever war.\nStop borrowing trillions.\nNo centralbankdigital currency.\nProtect free speech.\nStop the surveillance state.\nEnd civil asset forfeiture.\n\nSupport my effort herehttps://secure.justinamash.com/donate?source_code=x…", "Follow the Constitution.\nRead the bills.\nStop governing by emergency.\nEnd the forever war.\nStop borrowing trillions.\nNo centralbankdigital currency.\nProtect free speech.\nRepeal Patriot Act/FISA 702.\nEnd civil asset forfeiture.\n\nLet’s do it!\nDONATE herehttps://secure.justinamash.com/donate?source_code=x…", "The way to know a “deal” in Washington is a bad one for the American people is when the bipartisan establishment rush out their press releases about how great it is.\n\nCongressional leaders shouldn’t be making “deals.” Members of Congress should be voting on fully amendable pieces", "The Senate supplemental spends $118 billion we don’t have, doesn’t offset the funds,andsends over half the money to Ukraine for a war Congress hasn’t declared. It’s arrogant, reckless,andcompletely typical of the oligarchs running DC. Tell your members of Congress to vote no!", "Attempts to limit speech to the thoughtsandbeliefs of some majority, or to the conclusions of a group of state-designated “experts,” impedes the spreadanddevelopment of knowledge, undermining social cooperationandimperiling civilization itself.\n\nI’ll always defend the First", "The idea from this or any administration that retaliatory military action—casually delivered “at a timeandin a manner of our choosing”—is flatly justified under Article II as “self-defense” is so bananas you can’t even believe people deliver this argument with a straight face.", "The point is not what kind of police force or military force would be required to conduct an operation or whether assailants should be peacefully arrested. The point is that our Constitution empowers Congress alone to green-light the use of offensive force.\n\nNobody has questioned"], "tedlieu": ["God created clouds.\n\nGod created lightning.\n\nLightning struck the Statue of Liberty.\n\nYes clouds are predictableandlightning happens, however God created all of these thingsanduses them to be signs for those of us who believe.\n\nI’m way ahead of@mtgreeneein seeing signs.", "Many have mocked and scoffed at this post and even put community notes.\n\nJesus talked about that in Luke 12:54-56.\n\nYes eclipses are predictable and earthquakes happen and we know when comets are passing by, however God created all of these things and uses them to be signs for x.com/mtgreenee/stat…", "Honored to accept an award from Canadian Ambassador Hillmanand@CanEmbUSAon behalf of the 36th Congressional District. Our district exports over $368 million to Canada.\n\nAlso, I had some amazing poutine. I was told the calories don’t count if I ate it at the Embassy.", "Honored to join State Senator Dave Min at a community event tonight. Dave is a terrific State Senatorandwill be a terrific Member of Congress. He is part of the prestigious Red to Blue program.\n\nYou can help Dave or learn more about him here:https://davemin.com", "1. Voters are not voting for Hunter Biden.\n\n2. Sustained unemployment rate at 50 year lows.\n\n3. GDP above expectations.\n\n4. Wages rising.\n\n5. Stock market at record highs.\n\n6. Unlike Trump, Americans don’t want to punish women for having an abortion.#truth", "Hamasis a homicidal, genocidal, religiously fanatical terrorist organization.Hamaskidnapped and murdered many hostages, including most recently six hostages. Israel has the absolute right to dismantleHamas.", "The killing of these hostages only further confirms Hamas’s depravity. It should release all the hostages immediately. We will continue to work with our partners in the region to secure an agreement without delay that frees the remaining hostages.", "Targeting a synagogue, or targeting the members of a synagogue, is anti-Semitic. I strongly condemn the Pro-Palestinian demonstrators who engaged in anti-Semitism by targeting Adas Torah Synagogue and/or its congregants. Anyone who engaged in violence should be prosecuted.", "Violent clash outside West L.A. synagogue; 1 carrying 'spiked flag' arrested, police sayhttps://latimes.com/california/story/2024-06-23/pro-palestinian-protesters-and-supporters-of-israel-engage-in-violent-clash-outside-a-west-l-a-synagogue…", "Hezbollah has been launching unprovoked rocket attacks at Israel for ten months, killing civilians and destroying property.\n\nWhy is The NY Times calling this a preemptive attack by Israel? Why not call it a response to Hezbollah raining down missiles on Israel for ten months?", "New York Times: \"Israel’s preemptive attack was aimed at missile launchers in Lebanon that had been programmed to be fired at 5 a.m. in the direction of Tel Aviv, according to a Western intelligence official.\"https://nytimes.com/live/2024/08/24/world/israel-hamas-gaza-war/855d427d-9493-504c-ad51-37e1def842f1?smid=url-share…", "This Columbia letter downplaysHamas’ barbaric murders by describing the slaughter of Jewish civilians as a “military action.” This was terrorism and torture.Hamasbutchered children, raped women and burned families alive. Academics should not falsely sanitizeHamas’ terrorism.", "The published version of the Columbia faculty letter supporting our students and the principle that situating the war in Israel/Gaza in the history of the region ≠ antisemitism, citing prominent authority for doing so, please go here:https://docs.google.com/document/u/1/d/e/2PACX-1vSxEIf0j1H6v3R4549yxfetSBy1ioc6VHyJa3vKfvgyVFX9TAluk_1laTuSBKAyzqjF3hJT9EVw0P7a/pub…", "1.Hamasmurdered entire families, including babies.\n\n2. Some of the babies were decapitated.\n\nWhat I don’t understand is why some people had trouble accepting fact #2. Was fact #1 not horrific enough? Would your view ofHamassomehow change if fact #2 wasn’t true? (It is true).", "The Jerusalem Post can now confirm based on verified photos of the bodies that the reports of babies being burnt and decapitated in Hamas's assault on Kfar Aza are correct.\n\nMay their memory be a blessing.https://jpost.com/israel-news/defense-news/2023-10-12/live-updates-767856…", "Even before news broke of (1) Russia hostingHamasand (2) Russia’s Wagner group potentially supporting Hezbollah, Russia had already met the elements of being a state sponsor of terrorism.\n\nThe@StateDeptshould designate Russia as a state sponsor of terrorism.", "Breaking: The U.S. says it has intelligence that the Russian paramilitary group Wagner may send an air defense system to the Iran-backed Lebanese militia Hezbollahhttps://on.wsj.com/3sqGwf7https://on.wsj.com/3sqGwf7", "Dear@realDonaldTrump: You are wrong. The U.S. should not be friendly with Iran. The Iranian regime fundsHamasand Hezbollah. Iran attacked Israel. Iran wants to destroy Israel and America.\n\nThe right answer is maximum pressure until the Iranian people change the regime.", "Donald Trump: \"We're going to be friendly, I hope, with Iran. Maybe. But maybe not. But we're going to be friendly, I hope, we're going to be friendly.\"\n\n\"But they can't have a nuclear weapon...because once they do, it's a whole different world.\"", "The State Department has designatedHamasas a foreign terrorist organization. It is undisputed thatHamastargets civilians, including babies and the elderly. News media who don’t callHamaswhat it is—a terrorist organization—are being misleading and injecting their own biases.", "Scoop: Dozens of Alden-owned newspapers (@baltimoresun@denverpost@SunSentineletc) running an editorial urging media to call Hamas a terrorist group \n- Company ownership was involved in the decision \nStory on@axioshttps://axios.com/2023/10/18/alden-newspapers-israel-hamas-war-terrorism…"], "LPNational": ["Why do you need a license to cut hair, but not to send people to war? \n\nThe real danger isn't a barber with scissors—it's a government with bombs.", "The CIA props up military dictatorships throughout the world,andis responsible for oppressive psychological operations like Operation MockingbirdandMKUltra.\n\nIt's the world's most dangerous organized crime syndicate.\n\nAbolish it.", "Amendment I\n\nCongress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble,andto petition the Government for a redress of", "The Fed is actively waging a war against your wealth.\n\nIt's why gasandfood costs have skyrocketed.\n\nIt's why the dollar is worth 3% of what it was in 1913. \n\nIt's why Americans suffer.\n\nEnd the Fed, repeal all legal tender laws,andlet liberty thrive.", "We would disband NATO.\n\nWe would withdraw from the UN.\n\nWe would terminate all involvement in the WEF.\n\nWe would leave the WorldBankto rot. \n\nWe reject globalism on every level because we seek to bring political power closer to the individual. \n\nNo exceptions.", "No. \n\nNo more aid,@ZelenskyyUa. \n\nThe Ukrainian government should have never been given aid by the US in the first place.\n\nEnd all foreign aid now.", "You are most certainly not. Even as Americans languish, you send billions of dollars to UkraineandIsrael.\n\nAll while the IRS seizes our wealth,andthe Fed destroys what's left of it through the money printers.", "Joslyn Sanders was expecting to go into court last Wednesday in Denton, TX to hear the news that she would be given her son, Josiah Sanders, back from the state’s care. As we’ve come to expect, the state isn’t wanting to give up their control so easily.\n\nIn the courtroom, Texas", "This is Joslyn and Josiah Sanders.\n\nJosiah was a healthy baby boy born in May of 2021.\n\nAfter Joslyn stopped breastfeeding Josiah in March of 2023, he experienced some eating difficulties and had a minor seizure. A visit to the ER revealed Josiah had a mild calcium deficiency. A", "Meet the Hernandez family. That's Matt and Tuckey smiling with their beautiful young daughters.\n\nOver the past few months, the Georgia state government has ripped this family apart, because one of their daughters has a medical condition that the court refuses to acknowledge.", "Meet the Williams.\n\nAfter growing up with four foster brothers, Jennifer was looking forward to following in that tradition with her own home. While dating Jonathon, he was all-in on doing the same. \n\nThey have always believed it was their job to not only protect the children in"], "ToddHagopian": ["Redpath wins Treasurer\n\n(and, with that, I am officially UNEMPLOYED!!!!)#LibertarianConvention", "Name something the Federal Government does better than the Free Market", ".@RobertKennedyJris the first non-libertarian presidential candidate, since@RonPaul, who has accurately described government’s assault on the Bill of Rights#LibertarianConvention", "Congratulations to@realDonaldTrumpfor getting 6 out of 800+ votes, after begging the Libertarian National Convention to nominate him#LibertarianConvention", "Biden just blanket pardoned all marijuana possession cases, even in cases where there has been no charge or conviction.\n\nGive credit where credit is due\n\nA bunch of former Presidents could have,andshould have, taken this step but did not.\n\nThank you,@POTUS!", "Terrible strategic mistake for@RobertKennedyJrto limp inandmake a half-ass run for the Libertarian Presidential nomination\n\nWow, just a terrible move.  He should have ran early,andran hard, if he wanted any chance to win#LibertarianConvention", "In 1895, the Supreme Court declared the income tax unconstitutional. In a 5-4 ruling, the high court decided that the income tax was forbidden by Article I, Section 9, of the Constitution\n\nThe Founders did NOT want this!", "The US Government could raise everyone’s taxes by about 40%andbarely balance the budget, if we are lucky\n\nWe do not have a tax problem, we have a spending problem\n\nAsk the candidates about THAT!", "I think MaineandColorado are wrong for kicking Trump off the ballot…\n\nBut, hearing the Trumpsters squeal about ballot fairness is hysterical after they (andthe democrats) have done everything they can to keep third parties off the ballotanddebate stages for YEARS!", "Biden just proposed a two year annual tax credit of $4,800/year for all homeowners\n\nThat’s the equivalent of giving about $1 trillion to the richest members of the economy", "Trump commits to name multiple Libertarians to his cabinet, if elected#LibertarianConvention", "Trump commits to name multiple Libertarians to his cabinet, if elected#LibertarianConvention", "It’s adorable that people think “woke” teachers can brainwash children, but they don’t believe that bigoted politicians/parents can do the exact same thing…", "Congratulations to@realDonaldTrumpfor getting 6 out of 800+ votes, after begging the Libertarian National Convention to nominate him#LibertarianConvention", "Biden just blanket pardoned all marijuana possession cases, even in cases where there has been no charge or conviction.\n\nGive credit where credit is due\n\nA bunch of former Presidents could have, and should have, taken this step but did not.\n\nThank you,@POTUS!", "Terrible strategic mistake for@RobertKennedyJrto limp in and make a half-ass run for the Libertarian Presidential nomination\n\nWow, just a terrible move.  He should have ran early, and ran hard, if he wanted any chance to win#LibertarianConvention", "Most of us would be on the streets if we were not allowed to get a job\n\nMake it legal for people to work", "Many “Libertarian” accounts have figured out if they align with a duopoly candidate, they can get more followers, more engagement & make a few bucks\n\nMy account is staying true\n\nBoth major candidates are terrible\n\nI will continue to attack them both\n\nI’m not here for the money", "The US Government could raise everyone’s taxes by about 40% and barely balance the budget, if we are lucky\n\nWe do not have a tax problem, we have a spending problem\n\nAsk the candidates about THAT!", "If you made $14,000 (today’s equivalent of $175K) in 1949, you would’ve paid $140 in social security tax ($1,740 in today’s dollars)\n\nIf you make $175,000 in 2024, you will pay over $10,000 in social security\n\nThey have raised the tax over 600% & told you it was for your own good", "Can’t wait to see Biden lose in Colorado when the Trump ballot removal backfires\n\nNot because I like Trump, I actually hate him, but because I hate people who use ballot access to restrict electoral choice"], "theintercept": ["As theIDFsays it does not “have time” to confirm the reports of beheaded babies, the level of misinformation around events inIsrael“seems near unprecedented.”\n\nClick the image below to read our reporting.", "“It’s not too late to change your stanceandstand on the righteous side of history.”\n\nSixteen former campaign staffers for Sen. John Fetterman penned an open letter urging him to support anIsrael-Hamas ceasefire.\n\nRead more here.", "“What’s of greatest concern is not really my 20-year-plus career at Columbia, but what this says about peaceful protest on our campuses, around the livesanddignity of Palestinians,” Franke said.https://interc.pt/460JJl8", "Hundreds of Palestinian Doctors Disappeared Into Israeli Detentionhttps://interc.pt/3KcoSB8by@KaviChek", "Kathy Hochul’sIsraeltrip bankrolled by group funneling tax-exempt money to illegal settlementshttps://interc.pt/3SqvFN4by@akela_lacy,@chrisgelardi", "American Medical Missions Trapped InGaza, Facing Death by Dehydration as Population Clings to Lifehttps://interc.pt/3UDG0o7by@ryangrim,@Hind_Gaza", "The revenge that Israel will now exact will be hideous, as was that taken by the U.S., writes@schwarz. There is nothing on earth like the fury of the powerful when they believe they have been defied by their inferiors.", "This Republican congressman denies the existence of ‘innocent Palestinian civilians.” Now he’s attempting to hobble humanitarian aid to Gaza.\n\nRead our story below.", "Senate kills measure to scrutinize Israeli human rights record as condition for aidhttps://interc.pt/48HmzAUby@prem_thakker", "The revenge that Israel will now exact will be hideous, as was that taken by the U.S., writes@schwarz. There is nothing on earth like the fury of the powerful when they believe they have been defied by their inferiors.", "On Friday, the U.S. Senate passed a unanimous resolution condemning what it called “anti-Israel, pro-Hamasstudent groups” across the country following a day of walkouts.\n\nRead more from@MazMHussain."]}