{"PatTheSocialist": ["What a fucking dirtbag this dude is. Masks work asshole.", "At Warriors game. Looks like 1 person didn’t get the memo masks don’t work.", "Counterpoint: The villain should GTFO immediately", "Leave Feinstein alone. Let her go out with grace. She's earned it.#SanFranciscohttps://sfchronicle.com/politics/article/dianne-feinstein-calls-resignation-17891779.php…", "Jezus, now they're pushing \"Medium Covid.\" Anything to minimize the ugly truth that Biden is dooming generations to vastly shorter lives.", "I've lost all respect for most podcasters. If you have a platform and aren't reporting on our government coverup of Covid, you're complicit.", "Reducing the deficit while not protecting the public from a pandemic is cruelty. Bragging about it is stupidity.", "We are on track to reduce the deficit by more than $1 trillion this year – and that's on top of a $350 billion deficit reduction last year. Don't let anyone tell you we can't afford to invest in America’s families.", "It's official. Personally, I can't wait to not vote for him.", "President Biden to NBC News: \"I plan on running\" for re-election.", "So that's at least 3 times she's gotten Covid. Biden's \"Vax and Relax\" bullshit is gonna end so many lives early that I have zero compassion for her. None.https://cnn.com/2023/09/04/politics/jill-biden-covid/index.html…", "Jezus. They're starting the propaganda earlier every election cycle.", "Third party could result in Trump 2024 win: think tankhttps://trib.al/Tvx9xf1", "No, he would become speaker only by giving concessions, meaning it has already worked", "CANDIDATE BIDEN: promised to makeMohammedbin Salman a pariah.\n\nPRESIDENT BIDEN:\nfist bumped him and granted him immunity.\n\nNothing Biden says matters.", "\"bUt wHat CoNceSsiOns?\" scream the Dem apologists. Either he's ousted and the FTV folks win, or they get concessions and win. Some of you pea brains have absolutely no ability to use logic.", "A government that doesn't even try to protect the public in a plague should not exist. We can't vote our way out of this mess.", "Really fucking sad to say, but we'd be safer from Covid if Trump had won. At least the press wouldn't be such fucking propagandists. Gaslighting the public into thinking you can just \"Vax and Relax\" has killed over a million people and is disabling millions as we speak."], "SabbySabs2": ["Down With War, War Economy, & War Government. PROTEST THIS SATURDAY IN BOSTON! 1pm ET Park Street Station.", "Every resident inEastPalestine, OH should receive Medicare For All. Libby, Montana, was able to do this due to asbestos. Their property value has also decreased and they've experienced pain and suffering. \nFYI, Norfolk Southern donates to BOTH parties!", "What's happening to Omali Yeshitela is wrong!\nYou think you have rights. But you don't have rights in this country. You don't even have free speech. Look at what they did to Julian Assange. Look at what they're doing to Matt Taibbi.http://youtube.com/live/hHUleQ4NOBI…", "Israel's right to exist? Here we go again.", "Every resident in East Palestine, OH should receive Medicare For All. Libby, Montana, was able to do this due to asbestos. Their property value has also decreased and they've experienced pain and suffering. \nFYI, Norfolk Southern donates to BOTH parties!", "Censorship didn't start with Assange. We must also remember Daniel Hale & Mumia Abu Jamal. Where do our representatives stand on Julian Assange & free speech?https://youtu.be/uKEmLuV8bgc", "One of the principles of Justice Democrats is to ABOLISH ICE. Yet today... Cori Bush & Ilhan Omar voted to send $8.42 billion for ICE. Rashida voted present. AOC voted against it She's the \"hero\" this time. Collectively, the squad is useless.", "What's happening to Omali Yeshitela is wrong!\nYou think you have rights. But you don't have rights in this country. You don't even have free speech. Look at what they did to Julian Assange. Look at what they're doing to Matt Taibbi.http://youtube.com/live/hHUleQ4NOBI…"], "TristanSnell": ["Fox News just threw Trump under the bus (or in this case, train) — pinning him with responsibility for theEastPalestine disaster.", "Republican leaders are telling 2 big lies aboutEastPalestine — here’s the truth:", "BREAKING: Yusef Salaam of Exonerated 5 wins primary for NYC City Council seat, likely to win general and then join council next year.\n\nDonald Trump wanted Salaam executed and has still never apologized or retracted his statements — in fact he doubled down in 2019.", "Funny how certain people crow about \"free speech\" but support Putin's Russia even when they jail journalists like Wall Street Journal reporter Evan Gershkovich.\n\nPick a side.#IStandWithEvan", "Fox News just threw Trump under the bus (or in this case, train) — pinning him with responsibility for the East Palestine disaster.", "Republican leaders are telling 2 big lies about East Palestine — here’s the truth:", "BREAKING: Yusef Salaam of Exonerated 5 wins primary for NYC City Council seat, likely to win general and then join council next year.\n\nDonald Trump wanted Salaam executed and has still never apologized or retracted his statements — in fact he doubled down in 2019.", "If Russia wants peace talks so badly now, then they can un-invade Ukraine. There can be no good-faith talks until that happens."], "BernardKerik": ["#NeverForget#NeverForgiveNo plea deals for 9/11 terrorists!", "Yes, I STAND WITH RUDY, the former Associate Attorney, General of the United States, the former US Attorney, for the Southern District of New York. America’s Mayor, that reduced violent crime by 65%, and murder by 70% in the largest city in the United States, an unparalleled", "12 years ago today, 24 US Navy SEALS paid retribution to the scum responsible for the most deadly terror attack in world history. \n\nWe, especially those of us that we’re in New York City on that day, owe, them a debt of gratitude.#GODBLESSAMERICA#USA", "As U.S. prosecutors consider plea deals for Khalid Sheikh Mohammed and other suspects in the 9/11 terror attacks,@JoeBidenabandons NYC, Shanksville, and the Pentagon, traveling to Alaska.\n\nIt is a slap in the face to every surviving 9/11 family member and first responder.", "Start with failure to disperse, riot, arson, resisting arrest, and I could think of a multitude of other charges, but the governor and mayor of Atlanta better arrest every damn one of them, and seek the most substantial penalties under the law where this is going to continue tohttps://x.com/officer_Lew/st/officer_Lew/status/1632530128218517504…", "Why are they in solitary?\n\nSolitary confinement should be used only in certain circumstances: a substantial threat to staff, or the institution, an escape risk, or a national security risk.\n\nWhy is someone that attended a protest, and walked peacefully around the inside of a", "Merrick Garland says that J6 prisoners being locked up for two years in the DC gulag WITHOUT TRIAL is not necessarily a violation of the “speedy trial” requirement of the Sixth Amendment . Good to know.x.com/Rep_Clyde/stat…", "This is fucking sickening. \n\nChristopher Wray should be removed for cause immediately and prosecuted for violating the civil rights of Donald Trump, and those targeted by the FBI for political reasons, including FBI, Special Agent, Garrett or Boyle.\n\n“The only thing necessary for", "The attacks on@RepMattGaetzby Republicans are concerning.\n\nIn January,@SpeakerMcCarthyagreed to address out of control spending, a corrupt White House, 87,000 IRS agents, a weaponized DOJ/FBI and border security, and more.\n\nNothing changed since he took office. He had to go!", "Where is@SpeakerMcCarthy,@LeaderMcConnell, @GOPChairwoman and the@GOP? \n\nIf the Democrats are allowed to get away with this political persecution, this country, as it was founded, is finished, and it will be the fault of those above for allowing it to happen.", "Feds inform Trump he is target likely to be indicted as DOJ rebuffs prosecutorial misconduct claim | Just The Newshttps://justthenews.com/politics-policy/all-things-trump/feds-inform-trump-he-target-likely-be-indicted-doj-rebuffs…", "No one should stop talking about the election of 2020, until there are laws and policies in place to ensure that it never happens again!@FoxNewsis part of that problem. They want people to stop reminding people what happened and why.", "Laura Ingraham Calls President Trump “Whiner”, Urges Him to Stop Talking About the 2020 Election: “Please for the Love of God, Stop Talking About 2020” (VIDEO)https://thegatewaypundit.com/2023/07/laura-ingraham-calls-president-trump-whiner-urges-him/?utm_source=rss&utm_medium=rss&utm_campaign=laura-ingraham-calls-president-trump-whiner-urges-him…"], "spann": ["Damage at Boaz… video from Shannon Brown", "From White City, in Autauga Countywestof I-65 earlier this afternoon… photo from Daniel McCord", "Looking NW from the Pine Level exit along I-65 earlier… video from Karson Scott", "This was taken at White City, north of Prattville in Autauga County yesterday by Jessica Lawley. This is where six people were killed, between U.S. 82 and I-65.", "Damage at Boaz… video from Shannon Brown", "From White City, in Autauga County west of I-65 earlier this afternoon… photo from Daniel McCord", "This was taken at White City, north of Prattville in Autauga County yesterday by Jessica Lawley. This is where six people were killed, between U.S. 82 and I-65.", "Impressive mammatus display over Arab earlier this afternoon… video from Dawn Sparks"], "jeff_poor": ["Inbox:@ALGOPSteering Committee Votes No Confidence on Leadership of RNC Chair Ronna McDaniel#alpolitics", "Today on The@JeffPoorShowon Mobile, AL's@fmtalk1065(times CT):\n\n9:30 am\n\nState Rep. Jennifer Fidler\n\n10:30 am@WVNN's@TheDaleJackson11:30 am\n\nU.S.@RepJerryCarlhttp://FMTalk1065.com#alpolitics", "Inbox:@ALGOPSteering Committee Votes No Confidence on Leadership of RNC Chair Ronna McDaniel#alpolitics", "Today on The@JeffPoorShowon Mobile, AL's@fmtalk1065(times CT):\n\n9:30 am\n\nState Rep. Jennifer Fidler\n\n10:30 am@WVNN's@TheDaleJackson11:30 am\n\nU.S.@RepJerryCarlhttp://FMTalk1065.com#alpolitics"], "DavidAFrench": ["Horrifying. Evil. God bless the victims and their families.", "Enraging, sickening news. Club Q is a gathering place for gay and trans people who need community in a town where that doesn’t always come easy. If anyplace should be safe it is there. Love to everyone in the springs. F the people responsible for this continued carnage.", "As I left Kyiv this evening, there was one final, poignant image from my week in this extraordinary city--a line of ambulances carrying wounded men from the front. It was a potent reminder of the horrific toll of Russia's aggression and the courage of the people who confront it.", "\"That sound you hear is 40 million right-wing evangelical fingers going into 40 million right-wing evangelical ears and 20 million grimly pious mouths chanting, 'Nah! Nah! I can’t hear you!' Kevin Williamson, telling it like it is:", "First, this is not a counterinsurgency fight. It’s a force-on-force encounter between advanced militaries in pitched battle. It’s more like WWI or WWII than Iraq or Afghanistan. The risk of immediate civilian casualties at the front is much lower. /2", "The aggressor nation sleeps soundly while citizens of Ukraine spend night after night under air attack, all part of an effort to exhaust the population and destroy civilian infrastructure. /3", "Remembering:\n\nMAJ Andrew Olmsted, CPT Thomas Casey, SGT Corey Spates, CPT Torre Mallard, SGT Phillip Anderson, SPC Donald Burkett, Mr. Albert Haroutounian, SGT Gregory Unruh, SPC Matthew Morris, CPT Ulises Burgos-Cruz, SPC Andre Mitchell, and CPT Michael Medders.\n\nRest in Peace.", "Horrifying. Evil. God bless the victims and their families.", "Enraging, sickening news. Club Q is a gathering place for gay and trans people who need community in a town where that doesn’t always come easy. If anyplace should be safe it is there. Love to everyone in the springs. F the people responsible for this continued carnage.", "PEPFAR is one of the most consequential, compassionate, and effective programs in the history of American foreign policy and American foreign aid.https://t.co/d7ZJM0EFPU"], "NancyAFrench": ["After I first reported on@Kanakuk's inadequate response to the systematic sex abuse that happened at their Branson camp (& across the US and globe), they created a hotline for victims. Note it would report BACK to Kanakuk and not the police.  \n\nOne February day, I called it. /1", "When a@Kanakukdirector raped and abused  'hundreds' of campers, the camp covered it up with NDAs.  \n\nWhy point out the sins of this Christian institution?@DavidAFrenchdoesn't mince words in his conversation with@drmoore,@curtischangRB, andhttps://tinyurl.com/yckwjcb6", "David and I walked by the Only Murders In the Building building and it was glorious.@DavidAFrench", "In this full video, Phil asks Feldman about a social media post he allegedly posted in a Westhaven FB group threatening to shoot neighborhood teenagers!! (We have 1 of the only Black teens in the neighborhood and this is CHILLING) /2", "After I first reported on@Kanakuk's inadequate response to the systematic sex abuse that happened at their Branson camp (& across the US and globe), they created a hotline for victims. Note it would report BACK to Kanakuk and not the police.  \n\nOne February day, I called it. /1", "When a@Kanakukdirector raped and abused  'hundreds' of campers, the camp covered it up with NDAs.  \n\nWhy point out the sins of this Christian institution?@DavidAFrenchdoesn't mince words in his conversation with@drmoore,@curtischangRB, andhttps://tinyurl.com/yckwjcb6", "David and I walked by the Only Murders In the Building building and it was glorious.@DavidAFrench", "Every now and then, I think of this@MittRomneyspeech and am inspired by his courage and moral clarity."], "BillOReilly": ["If you shop in thehttp://BillOReilly.comChristmas/Hanukkah store, I get extra treats!  So let's get on it, people!", "On this day forty-two years ago, John Lennon was shot outside his NYC apartment. Learn more about Lennon’s decline before the end of his life in KILLING THE LEGENDS—on sale now.https://bit.ly/Order-KillingTheLegends…", "Evil rising in America.  Please check out my new column just posted onhttp://BillOReilly.com.", "Will Ukraine wind up hurting America?  Please read my new column onhttp://BillOReilly.com.", "\"Killing the Witches\" frightened the Terror Dog so I have to console her.  Two dogs were actually executed in Salem!  Book out September 26. Preorders get it first.", "(1) The Supreme Court is now running border security because President Biden will not. In a stunning rebuke of Biden policy, the Court ruled that Title 42 cannot be banished by the administration. So, the undocumented can be removed immediately on health grounds.", "Two left wing media operations, The New York Times and Politico, are reporting that U. S. Attorney David Weiss, now the Special Counsel, did not want to charge Hunter Biden with anything.  This signals the liberal press is turning against the Biden's.  Best analysis on", "Putin is finished. Please read the Message of the Day onhttp://BillOReilly.com."], "Jaybefaunt": ["What right does thewesthave to say anything? Their credibility is shot. The US has has been a major hypocrite for hundreds of years.", "Y'all cry about \"illegals\" (refugees) and yet you allow George W Bush to roam the streets?! A mass murderer?! WTF is wrong with you?", "I'm sorry but the Democrats you voted for are the reason for the Crime Bill... The Dems You voted for are the reason for the funding for more cops... The Dems you voted for are funding the Palestinian genocide.\nThe GOP doesn't care and funded it, too. None of them care.", "Watch them bail thisbankout and actually do what a \"progressive\" asks. This says more about the Dems and Ro Khanna. They will bail out thisbankbut not the people in Jackson, MS; Flint, MI orEastPalestine, OH and they expect us to support them?! The duopoly is a waste!", "\"Only a fool lets somebody else tell him who his enemy is\"-Assata Shakur#AssataShakur", "What right does the west have to say anything? Their credibility is shot. The US has has been a major hypocrite for hundreds of years.", "Hey@MarkHamillif you listened to more of the anti-war voices then you would know to not take sides in this proxy war pushed by Raytheon, Northrop Grumman, Lockheed Martin, Boeing, etc. Also, NAZIS are bad. \nPlease research first.", "Y'all cry about \"illegals\" (refugees) and yet you allow George W Bush to roam the streets?! A mass murderer?! WTF is wrong with you?"], "donwinslow": ["If you live or work nearEastPalentine, Ohio I urge you to leave for your own safety and for the safety of your family.\n\nI do not believe the full truth has been told about this horror and its long term effects on the health of resident in the area.", "Watch@jaketapper's very powerful video today about the murder of Jamal Khashoggi.", "#CityOnFireA BEST BOOK OF THE YEAR@washingtonpost@amazon@BNBuzz@TheTimesBooks#CityOnFireAmazonhttps://amzn.to/33kV2rUB&Nhttps://bit.ly/3schAFXSequel#CityOfDreamsout April 18, 2023#CityOfDreamsAmazon:https://amzn.to/3zz6D3WB&N:https://bit.ly/3sTe9TC", "Everybody...@ShimonProhas done remarkable work reporting on the#UvaldeMassacreand the COWARDS that were part of the police department and the HEROES that were part of families and friends of the victims who were senselessly killed because so many FAILED.  Thank you@ShimonPro!", "One year later, much is still unresolved for the parents and children of Uvalde, TX.@ShimonProis with the families who are fighting for answers on a powerful new episode of#TheWholeStorywith@AndersonCooper. Sunday at 8 p.m. ET/PT on CNNhttps://cnn.it/42F4Bfk", "Two years after the crime, NONE have been indicted or arrested.\n\nAnd in addition to walking free, most were re-elected.", "Watch.\n\nThe hard truth about the January 6 anniversary is that after two full years#TheyAllWalkedFree.", "If you live or work near East Palentine, Ohio I urge you to leave for your own safety and for the safety of your family.\n\nI do not believe the full truth has been told about this horror and its long term effects on the health of resident in the area.", ".@ChiefSundwarned them before Jan 6.\n\nThey forced him to resign.\n\nThen blamed him for their failures  \n\nRead#CourageUnderFire: Under Siege and OutNumbered 58-1 on January 6 by#StevenSund. \n\nAmazon:https://amzn.to/3g2zAOYB&N:https://bit.ly/3EBnnLg"], "KyleClark": ["#HeyNextCommentary:EastHigh School's second shooting in two months is a reminder that we are asking too much of young people and giving them too little in return.", "Apologies for the long thread. Too often, especially it seems at the national level, bad faith faux outrage is treated seriously by the media when it’s very easily debunked. In this case, it took about 10 minutes and one post it note worth of basic math.", "Denver-based Fox News reporter@aacuna1sees and embraces her son as he leavesEastHigh school after today’s shooting.", "Realized I’d never set foot on the old Park Hill Golf Course, a huge election flashpoint over development. So I ran it this morning. That is one enormous piece of land in the city. Voters will decide what happens to it.#copolitics", "#HeyNextCommentary: The Clear Creek County Sheriff's weak apology for the senseless killing of Christian Glass is the kind of response you'd expect after a bad meal or a slow checkout line, not the death of a human being.", "#HeyNextCommentary: Denver Mayor Hancock's acts of personal selfishness will be part of his yet-to-be-determined legacy#copolitics", "#HeyNextCommentary: It's not fair to expect law enforcement to be perfect - or to predict the future. It is fair to expect law enforcement to use the tools at their disposal to keep people from getting predictably massacred.", "#HeyNextCommentary: East High School's second shooting in two months is a reminder that we are asking too much of young people and giving them too little in return."], "BobMurphyEcon": ["Why does@JoshEaklewant to murder 6 million religious folk?", "remember when the white house and media embarked on a long campaign to get americans on board with a preemptive strike on saddam hussein, even though most of their reasons were total BS?\n\nno reason, just asking", "let's see what the new twitter rules allow:\n\nhey guys, guess what? a jewish guy with a huge media presence just orchestrated a takeover of the 3rd largest political party in america, but he used gentiles as his fronts", "It's ironic that we still use the phrases \"gold standard\" and \"holy grail\" even though our culture is now based on atheism and fiat money.", "In response to my map of NATO's expansion over time, many told me it was voluntary and some even objected to my use of the word \"expansion.\" \n\nWestern officials repeatedly assured Gorbachev NATO wouldn't expand. They understood the word, and why it would provoke (now) Russians.", "Why does@JoshEaklewant to murder 6 million religious folk?", "remember when the white house and media embarked on a long campaign to get americans on board with a preemptive strike on saddam hussein, even though most of their reasons were total BS?\n\nno reason, just asking", "let's see what the new twitter rules allow:\n\nhey guys, guess what? a jewish guy with a huge media presence just orchestrated a takeover of the 3rd largest political party in america, but he used gentiles as his fronts"], "ThomasEWoods": ["Here's the woman calling for us to just forgive and forget", "Ayn Rand Institute chairman calls me \"anti-American\"; he and his institute urge governments to show no restraint against civilian populationshttps://tomwoods.com/aynrandinstitute…", "After three years of unrelenting bullshit from the so-called authorities, anyone who thinks any issue is off the table for reexamination is a hopeless moron", "Imagine having two+ years of your life taken from you for what you now have to know accomplished nothing, and not caring at all", "Here's the woman calling for us to just forgive and forget", "Ayn Rand Institute chairman calls me \"anti-American\"; he and his institute urge governments to show no restraint against civilian populationshttps://tomwoods.com/aynrandinstitute…", "After three years of unrelenting bullshit from the so-called authorities, anyone who thinks any issue is off the table for reexamination is a hopeless moron", "The great@saifedeanhas written his masterpiece, and we discuss it. In the course of teaching economics he incidentally obliterates all the bad guyshttps://tomwoods.com/ep-2350-economics-for-normal-people/…"], "bshelburne": ["Families of men & women incarcerated in Alabama prisons are sick & tired of ⁦cruelty, indifference & incompetence from ⁦@GovernorKayIvey⁩ ⁦⁦@ALCorrections⁩ . Honored to stand with them.#alabama", "If you care about Alabama's prison crisis and want to do something to help, show up at this event and spread the word. Let's let politicians know that people in prison matter & Alabama's abuse is unacceptable!", "Seven men that Alabama sentenced to die in prison were celebrated tonight & it was an honor to be with them & support@AlaAppleseed. We believe in#secondchances& these men are living proof.", "On this international#WrongfulConvictionDayI lift up Toforest Johnson, on Alabama's death row for 25 years. No physical/forensic evidence & a solid alibi, the state used a paid earwitness to convict & hid the payment for 17 years. He has always maintained his innocence. 1/4", "Families of men & women incarcerated in Alabama prisons are sick & tired of ⁦cruelty, indifference & incompetence from ⁦@GovernorKayIvey⁩ ⁦⁦@ALCorrections⁩ . Honored to stand with them.#alabama", "On this international#WrongfulConvictionDayI lift up Toforest Johnson, on Alabama's death row for 25 years. No physical/forensic evidence & a solid alibi, the state used a paid earwitness to convict & hid the payment for 17 years. He has always maintained his innocence. 1/4", "Seven men that Alabama sentenced to die in prison were celebrated tonight & it was an honor to be with them & support@AlaAppleseed. We believe in#secondchances& these men are living proof.", "The same day families gathered in Montgomery to honor sons & daughters who have died in prison from violence, drugs and suicide, the parole board denied release to every person on their docket. This is why I stand with these families. Alabama must find a better way."], "PatrickSvitek": ["Sam Eppler, a 27-year-old high school principal in Dallas ISD, announces a campaign against@Bethvanduynein#TX24", "New: Paxton's team loses all on its pretrial motions that required a Senate vote. Trial all but certain.#txlege", "Just in: House votes unanimously to expel Slaton, 147-0#txlege", "Paxton impeachment board of managers:\n\nMurr, chair\nA. Johnson, vice chair\nGeren\nMoody\nCanales\nLeach\nLongoria\nMeyer\nCain\nVasut\nSpiller\nGamez#txlege", "Jamie Haynes, longtime GOP activist and realtor from Amarillo, makes her#HD86campaign official. This is John Smithee’s seat#txlege", "Team Paxton sends cease-and-desist letter to House impeachment crew, telling them to stop “contacting potential witnesses,” arguing they don’t have authority to do so at this stage#txlege", "Just in: House votes unanimously to expel Slaton, 147-0#txlege", "And there it is —\n\nLess than half an hour before the Paxton impeachment debate is set to start in the House, Trump weighs in against it \n\n“Free Ken Paxton, let them wait for the next election!”#txlege"], "evanasmith": ["God bless this great man ⁦@WillieNelson⁩ — recipient tonight of the LBJ Liberty and Justice for All Award#txlege", "yes, i would describe that as falling short of its goals", "i mean holy moly. this is the best tv ever", "Fast-forward five years: Our grand plans did work. When I went back to see Red to tell him, he greeted me with tears in his eyes. “You were right,” he said. “I was wrong.” And he gave us another $125,000 to fund public-service journalism#txlege", "God bless this great man ⁦@WillieNelson⁩ — recipient tonight of the LBJ Liberty and Justice for All Award#txlege", "Fast-forward five years: Our grand plans did work. When I went back to see Red to tell him, he greeted me with tears in his eyes. “You were right,” he said. “I was wrong.” And he gave us another $125,000 to fund public-service journalism#txlege", "yes, i would describe that as falling short of its goals", "#breakingEntire city of Houston — biggest city in Texas, and nation's fourth-biggest — is under boil water noticehttps://texastribune.org/2022/11/27/houston-boil-water/…#txlege"], "MsLaToshaBrown": ["Our children can’t even be children. This story really makes me angry.", "A NJ resident called police on a 9-year-old Black girl using a homemade spotted lanternfly repellant to try and stop the invasive species from harming trees in her neighborhood.\n\nThe girl's mother and sister described the ‘traumatic’ experience at a local council meeting.", "For the love of humanity: A Conversation with LaTosha Brownhttps://medium.com/the-promise/for-the-love-of-humanity-a-conversation-with-latosha-brown-b2393ca6c1ef…", "I’m horrified and terrified they will carry this out.", "This is horrifying. The Iranian parliament votes overwhelmingly (227-63) to execute the 15,000 protesters they already arrested.\n\nThese were peaceful protestors simply seeking the right to basic justice and autonomy. Unacceptable and barbaric.https://newsweek.com/iran-votes-execute-protesters-says-rebels-need-hard-lesson-1757931…", "This action is a result of all the folks that have been doing real work for years to get these images removed (not hiding behind empty opinions on Twitter). Thank you for staying in course! Thank you!#WeWontBlackDown", "BREAKING: The U.S military will REMOVE all references to the  Confederacy from buildings and street names and will rename nine military bases named after Confederate generals. Good!", "Our children can’t even be children. This story really makes me angry.", "A NJ resident called police on a 9-year-old Black girl using a homemade spotted lanternfly repellant to try and stop the invasive species from harming trees in her neighborhood.\n\nThe girl's mother and sister described the ‘traumatic’ experience at a local council meeting.", "This action is a result of all the folks that have been doing real work for years to get these images removed (not hiding behind empty opinions on Twitter). Thank you for staying in course! Thank you!#WeWontBlackDown", "BREAKING: The U.S military will REMOVE all references to the  Confederacy from buildings and street names and will rename nine military bases named after Confederate generals. Good!", "I’m horrified and terrified they will carry this out.", "This is horrifying. The Iranian parliament votes overwhelmingly (227-63) to execute the 15,000 protesters they already arrested.\n\nThese were peaceful protestors simply seeking the right to basic justice and autonomy. Unacceptable and barbaric.https://newsweek.com/iran-votes-execute-protesters-says-rebels-need-hard-lesson-1757931…", "For the love of humanity: A Conversation with LaTosha Brownhttps://medium.com/the-promise/for-the-love-of-humanity-a-conversation-with-latosha-brown-b2393ca6c1ef…"], "TomFitton": ["Leftists inIsraeltrying to destroy conservative government through \"protests\" for daring to slightly constrain radical left judiciary power grabs.", "Biden gang walks back claim drone strike killed senior al-Qaeda leader \n\"U.S. military officials are walking back claims that a recent strike in Syria killed an influential al-Qaeda figure, following assertions by the dead man’s family that he had no ties to terrorists but was a", "\"A voice is heard in Ramah, lamenting and weeping bitterly: it is Rachel weeping for her children, refusing to be comforted because they are no more.\"", "This is one of the most powerful pro-life videos we've ever seen!https://lifenews.com/2022/11/02/powerful-video-shows-abortion-staffer-quitting-after-seeing-the-reality-of-how-abortions-kill-babies/…", "Elderly man killed by scooter-riding murderer in NYC rampage was dad of six heading to mosque to pray, son sayshttps://nypost.com/2023/07/09/elderly-father-of-six-was-heading-to-mosque-to-pray-when-scooter-shooter-killed-him-son-says/?utm_source=twitter&utm_medium=social&utm_campaign=nypost_sitebuttons…via@nypmetro", "Bush admin allowed 9/11-connected terrorist to speak at Pentagon!https://judicialwatch.org/judicial-watch-declassified-documents-reveal-fbi-warning-identifying-anwar-al-aulaqi-as-a-terrorist-day-before-he-spoke-at-pentagon-luncheon/…https://judicialwatch.org/uncovered-docs-indicate-fbi-knew-u-s-born-terrorist-anwar-al-aulaqi-purchased-airline-tickets-for-911-hijackers-when-he-dined-at-the-pentagon/…", "\"A voice is heard in Ramah, lamenting and weeping bitterly: it is Rachel weeping for her children, refusing to be comforted because they are no more.\"", "Make no mistake: If Congress passes a national abortion ban, I will veto it.", "They had military assets ready to go to#Benghazito save lives. But Clinton/Obama FAILED to act!", "July 13, 2023\n\nJudicial Watch Sues DHS for Records on Grant from U.S. Biological Defense Program to EcoHealth Alliance\n\n(Washington, DC) –@JudicialWatchannounced  that it filed a Freedom of Information Act (FOIA) lawsuit against the U.S. Department of Homeland Security (DHS)"], "BarbMcQuade": ["Ramadan Mubarak to all of ourMuslimfriends and neighbors.", "Enjoyed today’s Peacenic picnic for peace, hosted by One Detroit community and law enforcement partnership. Music, games, food, services. Next one is 7/15 at Heilman Rec Center with ⁦@DetroitLions⁩. Thank you ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩", "Happy Passover to all of our Jewish friends and neighbors.", "I have long thought Trump’s speech on the Ellipse failed this test because of the vagueness of his language and the inclusion of the word “peacefully.”", "Enjoyed today’s Peacenic picnic for peace, hosted by One Detroit community and law enforcement partnership. Music, games, food, services. Next one is 7/15 at Heilman Rec Center with ⁦@DetroitLions⁩. Thank you ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩", "Happy Passover to all of our Jewish friends and neighbors.", "Judge uttered one word in ruling. “Denied.”", "Ongoing trial in Tree of Life mass shooting is a painful reminder that reckless and vitriolic words from leaders can incite others to kill. My thoughts in@cafedotcom.https://cafe.com/notes-from-contributors/note-from-barb-words-that-kill/?utm_source=CAFE&utm_campaign=491534407b-20230504_CAFENewsletter213_Insiders&utm_medium=email&utm_term=0_575ee841eb-491534407b-165974016…"], "JohnArchibald": ["But then, it's not just a matter of age. Since 2017 paroles have ground to a halt.", "I sorta stepped aside in my newsletter today to make room for what is truly one of the best things I’ve ever read about the Machine at UA. If you want to understand it you should take the time.\n\nIt just happens to come from somebody close to me.https://link.al.com/view/63063131244de080400a2bf2itjh0.vo/d3444d91…", "I’m not so interested in what you believe, Alabama. I’m just starting to believe you don’t really believe what you say you believe.\n\nBut then, maybe I got that Bible Belt thing all wrong.", "Pretty exciting day. I enjoyed this team, and going back to my reporting roots. \nAwards are cool and all, but nothing compares to the hearing people say they got their lives back.\nThat will stick forever.\nCongrats everyone.", "But then, it's not just a matter of age. Since 2017 paroles have ground to a halt.", "I sorta stepped aside in my newsletter today to make room for what is truly one of the best things I’ve ever read about the Machine at UA. If you want to understand it you should take the time.\n\nIt just happens to come from somebody close to me.https://link.al.com/view/63063131244de080400a2bf2itjh0.vo/d3444d91…", "Yet Alabama prisons are notoriously overcrowded, and lambasted by the feds -- under Jeff Session's Justice Department, even -- on system is notoriously overcrowded, as unsafe, inhumane and unconstitutional.", "This fiscal year, 106 people over the age of 60 have been considered for parole in Alabama, according to parole board records. Just seven – or 6.6 percent – have been granted parole.\nThis fiscal year, 21 people over 70 have come up for parole. None were granted release. None."], "brad_polumbo": ["It's absolutely horrific & hateful for you to suggest that this is somehow related to them being gay. Child abusers exist among all people. You would NEVER talk about a similarly horrific story with straight parents b/c u wouldn't notice it & if you did you wouldn't generalize.", "I would never let a man who is not a blood relative babysit my kids. Most parents wouldn't. And yet we let male couples adopt children and then act surprised when this happens. \n\nIt's not surprising. Horrific, infuriating, gut-wrenchingly disgusting and evil. But not surprising. x.com/gatewaypundit/…", "A government that can ban the Pride flag can just as easily ban the Bible.", "Any time you hear someone cite the \"fire in a crowded theater\" talking point that's a tell they aren't very familiar with the First Amendment.", "You have a right to protest. \n\nYou do NOT have the right to block traffic. \n\nAt that point you’re infringing on other peoples’ rights and you should be arrested. \n\nSorry not sorry", "It's absolutely horrific & hateful for you to suggest that this is somehow related to them being gay. Child abusers exist among all people. You would NEVER talk about a similarly horrific story with straight parents b/c u wouldn't notice it & if you did you wouldn't generalize.", "I would never let a man who is not a blood relative babysit my kids. Most parents wouldn't. And yet we let male couples adopt children and then act surprised when this happens. \n\nIt's not surprising. Horrific, infuriating, gut-wrenchingly disgusting and evil. But not surprising. x.com/gatewaypundit/…", "Any time you hear someone cite the \"fire in a crowded theater\" talking point that's a tell they aren't very familiar with the First Amendment.", "Have you ever thought about the fact that the US government spent $2.313 trillion, more than 6,000 American lives, and 20 years in Afghanistan just to replace the Taliban with… the Taliban?", "Horrifying if true. But this kind of thing won't receive a fraction of the attention from the Very Online Right that it would if LGBT people were somehow involved.", "JUST IN: CPD is investigating allegations that a group of officers had improper sexual relations with newly arrived immigrants, including at least one facing accusations of having sexual contact with a minor and impregnating her.https://trib.al/Qxw2Dm4"], "natsechobbyist": ["\"We are seeing this restriction have profound and terrible effects for some families in the most desperate of situations,\" Tein said.", "It’s identity politics to be anti-Holocaust deniers? And are you suggesting this only afflicts specific classes of people? Please elaborate.", "Fixed it for you: Dishonest@RepWeinsteinconfirms he's part of the cancel culture who would rather cancel a student who is incorrect on history, than educate him. Leveraging the Holocaust for selfish political purposes is disgusting. This is today's left. Identity politics andx.com/RepWeinstein/s…", "\"For if you remain silent at this time, relief & deliverance for the Jews will arise from another place but you & your father’s family will perish & who knows but that you have come to your royal position for such a time as this?” Est 4:14 \n\nLeaders & journalists leave out royal.", "Ooops, no, I lived there TWENTY-FOUR YEARS and I visit often.", "\"We are seeing this restriction have profound and terrible effects for some families in the most desperate of situations,\" Tein said.", "WE have the power to end it. In fact, we are the only ones with that power.", "Today has been a hard day, and we’re all processing this disgusting act of political violence. But, don’t forget that extremism is on the ballot at every level — and we have the power to end it.", "\"For if you remain silent at this time, relief & deliverance for the Jews will arise from another place but you & your father’s family will perish & who knows but that you have come to your royal position for such a time as this?” Est 4:14 \n\nLeaders & journalists leave out royal.", "This sounds like one of those chain emails. Once a country didn't do these things within 8 days and the next day a meteor landed on it and it was destroyed.\nIGNORE AT YOUR OWN PERIL."], "jimmy_dore": ["Whats the Bible verse for \" I killed a million Iraqi's & got away with it \" ?", "I wonder when people will just stop listening to bullshit & take control of their own country. Corporations have you breathing poison while they gaslight & lie just like the politicians they own\n\nEPA administrator asks residents to 'trust the government'", "Anyone willing tools on this site defending War Pigs & Strike Breakers today can get fucked.", "Any Dorecels on this site pushing \"Fraud Squad\" shit today (or ever) can get fucked.", "This is what they do when you are Anti-War, they immediately change the subject & smear. FYI: Jimmy Dore is not part of that event at all, but thanks for lying that he is a “headliner”. Holy Shit.#JimmyAllYTheTimehttps://x.com/Arbitrarymagi//Arbitrarymagi/status/1580574923881295872…", "Big Thanks to@TuckerCarlsonfor letting someone say this on TV. I would love to bring this message to@MSNBC@CNN@NPR@abcnewsetc..but they won’t have me. We’re going to have to come together to stop the war machine:", "The U.S. is doing what it always does, terrorize the world for corporate profits. \n\nHere Seymour Hersh explains EXACTLY how the United States blew up The Nord Stream pipeline so US companies could sell more Natural Gas to Europe.  \n\nWe're The Terrorists.https://seymourhersh.substack.com/p/how-america-took-out-the-nord-stream…", "Anyone willing tools on this site defending War Pigs & Strike Breakers today can get fucked.", "Any Dorecels on this site pushing \"Fraud Squad\" shit today (or ever) can get fucked.", "This is what you thought Progressive Democrats would be doing, right? This should be embarrassing to them, right? \n\nNope. They're busy defending censorship and voting for war.https://foxnews.com/politics/gaetz-introduces-resolution-end-military-financial-aid-ukraine-urge-peace-deal…"], "RonFilipkowski": ["Dershowitz said Trump asked him at dinner why only 27% of Jews voted for him when he strongly supportedIsrael. Dersh said he told Trump Jews also care about gay rights, abortion, climate change, gun control and separation of church and state, and he was terrible on those.", "For every Repub trying to blame the Admin for E. Palestine, I continue to cite Steve Bannon, who again today placed the blame every step of the way on DeWine & Norfolk Southern. Says the RR and DeWine did release & burn of chems because they wanted to clear tracks ASAP to get", "Rep. Troy Nehls is in E. Palestine and assures everyone that the city’s water is safe to drink, then demonstrates it by drinking a cup of tap water from the China Cafe. “The Fire Chief, everybody says the water is clean to drink.”", "Rudy is now on the scene in E. Palestine. He claims that people there have been coming up to him asking why Biden hates them.", "Right-wing “independent journalist” who flew in to Maui (he also went into E. Palestine) after the fire is confronted by angry residents while live on Steve Bannon’s show, who said he is exploiting them for politics and using up precious resources.", "He repeats claim that never gets challenged that he will end the war in 24 hours. He is asked how. He doesn’t answer. We move on to the next question.\n\nBecause that’s really not important.", "With piles of his dead mercenaries on the ground behind him, the Wagner commander says he is pulling his troops off the line on May 10, blaming the Russian military for failing to supply them with promised ammunition.", "Tonight! Tucker unveils footage proving that the bombing of Hiroshima was a mostly peaceful plane ride."], "davidhogg111": ["I deleted this because there is so much to say here and about how fucked up his comments are that there is no way to say what I think needs to be said in 1 tweet or even a thread. Anti semitism and racism is unacceptable to matter the cause.", "Just a reminder- if this happened in almost any other high income country it would be the top story for a week or more.", "Ben do you not remember Buffalo? Where there was an armed guard at who even managed to hit the shooter but couldn’t stop him because of the body armor and gun you insist we keep legal? How about Kroger grocery store in Collierville, TN where 15 were shot? Or Boulder 10 killed?", "Our friends at@AFTunionhave been on the forefront of justice for decades. From the first March on Washington to the 60th they continue to fight not only for racial equality but also for safe communities and schools. Thank you, President Weingarten for your leadership.", "I deleted this because there is so much to say here and about how fucked up his comments are that there is no way to say what I think needs to be said in 1 tweet or even a thread. Anti semitism and racism is unacceptable to matter the cause.", "Fuck anyone who thinks the country that did this can’t stop our kids from being slaughtered in their schools.", "Just a reminder of what weakness actually looks like-\n\nLetting the DPRK murder Otto and your boss continually kissing Kim’s ass after.\n\nSigning the deal to surrender to the Taliban. \n\nNot holding the Saudis accountable for murdering Khashoggi and giving MBS praise and good PR", "Biden’s weakness is provocative. And our adversaries have noticed.", "I’ve said it before and I will say it again just as I did in my fox new oped last summer. Mass shootings will only be stopped if we work together."], "anthonyzenkus": ["Get this: They found dioxin far above safe levels inEastPalestine water and the federal gov won't clean it up because Obama killed EPA proposal requiring the gov to lower the threshold for cleanup.\n\nDemocrats ignored the science and people will die because of it.", "You cannot say you care about women in Iran if you don't speak out for women in Palestine.", "There was nothing \"controlled\" about@nscorp's un-controlled burn inEastPalestine. That was a chemical weapons attack.", "Joe Biden still hasn't visitedEastPalestine despite staying he'd go there. Fuck them, I guess.", "Get this: They found dioxin far above safe levels in East Palestine water and the federal gov won't clean it up because Obama killed EPA proposal requiring the gov to lower the threshold for cleanup.\n\nDemocrats ignored the science and people will die because of it.", "There was nothing \"controlled\" about@nscorp's un-controlled burn in East Palestine. That was a chemical weapons attack.", "Negotiate an end to this war now, you ghouls.", "When the Biden administration sided with rail companies to prevent the workers from striking, they were siding with companies like Norfolk Southern, whose train derailment in East Palestine, Ohio sent plumes of poison gas into the air for days, putting all residents at risk."], "benshapiro": ["I mean look at this vile shit from the NYT.Israel's military killed TERRORISTS. Palestinian terrorists killed SYNAGOGUE ATTENDEES. To the NYT, it's all just a cycle of violence:", "This is all part of a broader Leftist narrative that it's the new right-wing Israeli government \"raising risk of escalation\" when 13-year-old terrorists shoot people going to synagogue, Hamas cheers, and the PA cuts off security cooperation. Look at this pathetic NYT headline:", "I met this Israeli soldier while taking a tour of the Western Wall tunnels. It turns out he turns weapons of war into meaningful art.https://youtu.be/mgdWfnhqWN8", "A Palestinian Arab murders seven Jews going to synagogue in Jerusalem, the historic capital of the Jewish people.\n\nMany Palestinians celebrate. Hamas takes credit. \n\nMedia response: This is a cycle of violence. After all, Jews WERE going to shul in Jerusalem.", "I mean look at this vile shit from the NYT. Israel's military killed TERRORISTS. Palestinian terrorists killed SYNAGOGUE ATTENDEES. To the NYT, it's all just a cycle of violence:", "This is all part of a broader Leftist narrative that it's the new right-wing Israeli government \"raising risk of escalation\" when 13-year-old terrorists shoot people going to synagogue,Hamascheers, and the PA cuts off security cooperation. Look at this pathetic NYT headline:", "A Palestinian Arab murders seven Jews going to synagogue in Jerusalem, the historic capital of the Jewish people.\n\nMany Palestinians celebrate.Hamastakes credit. \n\nMedia response: This is a cycle of violence. After all, Jews WERE going to shul in Jerusalem.", "The juxtaposition of rabid anti-Semite Rashida Tlaib attempting to perform a \"Nakba Day\" lamenting the existence of the State of Israel whileHamasfires missiles into the heart of Tel Aviv is pretty clarifying."], "IngrahamAngle": ["Covenant school shooter went on a 'murderous volcanic rage': John Kelly", "Harmeet laid out the possible legal options for the residents ofEastPalestine, OH, who were sickened due to possible negligence of Norfolk Southern and gov’t officials.", "Angle:EastPalestine residents are still begging for answers while being forced to live in a cloud of uncertainty and fear.", "A reading from tonight’s Seder that speaks to current day.  Happy Passover!", "Covenant school shooter went on a 'murderous volcanic rage': John Kelly", "Harmeet laid out the possible legal options for the residents of East Palestine, OH, who were sickened due to possible negligence of Norfolk Southern and gov’t officials.", "Former DNI John Ratcliffe: All Republicans agree that this is an unnecessary war.", "Sheriff Dannels on border crisis: This is a complete inhumane act by Washington, D.C... intellectual avoidance and banishment with intended consequences."], "RealSpikeCohen": ["Just over a month ago, the train derailment inEastPalestine, Ohio caused metric tons of toxic chemicals to spew into the air and water. \n\nMany locals are already suffering health issues as a result, and tens of thousands pets and wildlife have been reported dead.", "I am infinitely more concerned with the raging chemical fire inEastPalestine OH then I am with NORAD playing whack-a-mole with balloons.", "Jewhere.\n\nWords mean things.\n\nWhen everything is called antisemitic, it helps provide cover for actual antisemitism.", "1,186,000. \n\nThat is the number of US military personnel who have died at war. \n\nToday is Memorial Day, a day for us to remember and honor those who have fallen. \n\nLet's truly honor them by ending the wars that are sending more to join them. \n\nFor many, this is a day for", "This man's name is Rasheem Carter. \n\nRasheem sought the government's help after his life was threatened. \n\nGovernment did nothing, and Rasheem was killed and dismembered.", "On this day 19 years ago, a reasonable man named Marvin Heemeyer was pushed by his local government to do unreasonable things.\n\nRest in peace, Marvin.\n\nHappy Killdozer Day.", "1,186,000. \n\nThat is the number of US military personnel who have died at war. \n\nToday is Memorial Day, a day for us to remember and honor those who have fallen. \n\nLet's truly honor them by ending the wars that are sending more to join them. \n\nFor many, this is a day for", "53 years ago, OH National Guardsmen opened fire on unarmed student protestors who were hundreds of feet away, killing 4 and wounding many others.\n\nWhy did they do this?\n\nTo protect the war machine."], "briebriejoy": ["RFK Jr: \"If you live in any of these other countries & you're gay, for example, you can be kiled for that.Israelis the only place where you have freedom. If you're a transvestite, if you have any other disident views, you'd much rather be in Isreal...Isreal is going into the", "Imperialists often raise the example of WWII & accusations of genocide to justify war. (E.g. incubator babies in Kuwait). But does the left have a response to the question of how to identify a Hitler-level threat, & what to do about it? Must it?https://patreon.com/posts/full-video-coup-74333319…", "Watch my full exchange with RFK Jr. in which I challenge his “unconditional” support ofIsraelin light of the international consensus thatIsraelis an apartheid state.", "\"You want a presidential candidate...who has a backbone...If [RFK Jr.] thinks somehow that each [Palestinian] baby who was killed somehow was never in any way, intentional, deliberate, they didn't know what they were doing --he needs to really get off the crack pipe.\"\n\nPremiere", "\"The Italians -- they were able to get 100k people out in the streets, & we asked them how they do it, & they said we are very very laser focused on a simple message of cease fire and peace talks. We don't talk about NATO, we don't talk about broader societal issues. And whether", "\"What is the point of wearing down's conventional forces at this point? Before the conflict, thewould kick's ass in a conventional war. The only sort of war that thecould loose againstis a nuclear war, & that's what this conflict is bringing us closer to.\"", "RG: \"In order to try to understand why the workers would want them to vote yes yes, & why the squad would listen to them...is that they genuinely wanted fight to the end, & they thought that they had a shot.\" \n\nBG: Why would they think that?\n\nWATCH NOW:https://youtube.com/watch?v=cdxUph85NlA…", "RFK Jr: \"If you live in any of these other countries & you're gay, for example, you can be kiled for that. Israel is the only place where you have freedom. If you're a transvestite, if you have any other disident views, you'd much rather be in Isreal...Isreal is going into the"], "ComicDaveSmith": ["I’m glad that school backed down and that kid can wear his gadsden flag. He seems like a good kid and his mom seems like a good mom. This situation should be yet one more reminder for all good parents out there. A wake up call. \n\nMany of you are sending your kids to schools who", "If you were on a mission to create more antisemitism in this country, you couldn’t do a better job than the ADL.", "The lesson of WW1, Iraq, Libya and countless other wars, is that toppling a regime can lead to one that’s much worse. So many people demonstrated that they haven’t learned that lesson this morning, even when the regime in question has the largest nuclear arsenal in world history.", "Isn’t it crazy that almost no one in the political or media class talk about radical Islamic terrorism anymore. There’s no concern about it, and yet every emergency power that the government took in the name of terrorism, DHL, TSA, Patriot act, is just part of America now.", "Never relent. Never forget what these monsters did.", "NATO’s insane war in Libya destroyed one of the most prosperous countries in Africa, led to an untold number of civilian deaths, the migrant crisis in Europe and open air slave markets. Who’s denying history?", "You cannot possibly compare NATO's interventions to Russia's invasions. It requires both a deliberate ignorance of the scale and to deliberately ignore the history of Russian genocide in Ukraine.\n\nDon't deliberately ignore the history of Russian genocide in Ukraine.", "The lesson of WW1, Iraq, Libya and countless other wars, is that toppling a regime can lead to one that’s much worse. So many people demonstrated that they haven’t learned that lesson this morning, even when the regime in question has the largest nuclear arsenal in world history.", "The COVID-19 National emergency is officially over. Of course, it’s been over for a long time, the government is just admitting it now. The results of the last three years will be felt for generations. The moronic, insane, tyrannical policies of lockdowns, mandates and passports"], "TheRickWilson": ["I know a few people inIsraelright now wondering something.\n\nI'll just say this: WE FUCKING WARNED YOU.", "The purpose of terrorism is to terrorize.", "What are the odds that the DeSantis crew haven’t a clue how to “inspect” 90% of the rides at Disneyworld?", "After all, it's just a regional territorial dispute.", "I don't understand why Putin just won't cede territory to the Wagner Republic. Shouldn't he just give peace a chance?", "Lib-owning more important to them than boosting a raving anti-Semite.", "Kanye has spent the last several days promoting antisemitism and racism, and the House Judiciary Republicans could delete this tweet at any time. \n\nIt's not an accident that it's still up. x.com/JudiciaryGOP/s…", "One side attacks schools, hospitals, and destroys dams.\n\nOne side fights for freedom and rescues animals.", "In Photos: The Ukrainian from a viral video where he plucked kittens from floodwater has ignored his own severe health crisis to work around the clock on rescuing animals in Kherson.https://rferl.org/a/ukraine-viral-kitten-rescue-floods-heart-problems/32455777.html…", "Also for attacking the Jews.\n\nBut you knew that.", "The constant hypocrisy from the media is at an all-time high. They have now gone after Kanye for his new fashion line, his independent thinking, & for having opposing thoughts from the norm of Hollywood.https://on.msnbc.com/3Cj6oL6", "RFK’s Jewish Bioweapons Hour is gonna kill it, though", "Sources at Fox are telling me that last night’s much-hyped primetime reboot was a ratings disaster. Executives are panicked. Hannity lost to MSNBC’s Maddow and the 8:00 show only pulled in 149,000 from the key demographic. (Tucker routinely got at least 400k). More to come…", "\"multiple well-known Jews\" is not sounding for you the way you thought it was sounding for you.https://x.com/1977galaxydrea/1977galaxydream/status/1681025809719640065…", "Fox moderators pushed to ask debaters to disavow candidate's 9/11 'false flag' remarkhttps://rawstory.com/fox-news-2664315433/…", "One side attacks schools, hospitals, and destroys dams.\n\nOne side fights for freedom and rescues animals.", "In Photos: The Ukrainian from a viral video where he plucked kittens from floodwater has ignored his own severe health crisis to work around the clock on rescuing animals in Kherson.https://rferl.org/a/ukraine-viral-kitten-rescue-floods-heart-problems/32455777.html…", "I know a few people in Israel right now wondering something.\n\nI'll just say this: WE FUCKING WARNED YOU.", "After all, it's just a regional territorial dispute.", "I don't understand why Putin just won't cede territory to the Wagner Republic. Shouldn't he just give peace a chance?", "The level of bad bad baddy badness of giving the Terror Caucus power on Rules cannot be overstated."], "FreemansMind96": [], "HannahDCox": ["BASED\n\nAnd any politician that would send you to war at 18 but ban your ability to defend yourself at home: tar and feather", "Banning gun sales to young American adults under 21 is unconstitutional, judge ruleshttps://9news.com/article/news/nation-world/gun-bans-under-21-unconstitutional/507-13b3d6b0-a2c2-453a-a3f9-d56a61090281?utm_campaign=snd-autopilot…", "Our government took an attack on our homeland and used it as an excuse to go to war against the American people.", "It’s stunning to me that in 2022 we still have to tell people being anti-Semitic is unacceptable.\n\nIf your life sucks it is in all likelihood your own damn fault. Stop looking for other people to blame and fix yourself.", "\"By this new Left ‘logic,’ the ACLU in 1978 were white nationalists because they fought for the free speech rights of white nationalists. \n\nBut virtually no one believed back then that the Jewish lawyers became Nazis themselves merely for defending the principle of free", "The WHO chief says an even deadlier pandemic is on the way, and naturally, we’re going to need some communism to deal with it.\n\nOR\n\nWe could just stop funding risky animal torture in foreign labs.", "No one, of any gender, should ever be forced to fight in any war.", "Our government took an attack on our homeland and used it as an excuse to go to war against the American people.", "BASED\n\nAnd any politician that would send you to war at 18 but ban your ability to defend yourself at home: tar and feather", "Banning gun sales to young American adults under 21 is unconstitutional, judge ruleshttps://9news.com/article/news/nation-world/gun-bans-under-21-unconstitutional/507-13b3d6b0-a2c2-453a-a3f9-d56a61090281?utm_campaign=snd-autopilot…"], "KyleKulinski": ["deflated Jabba@mikepompeois annoyed that a journalist who was chopped into pieces by a theocratic dictator got too much media sympathy", "Capital breaks for theocractic fascism. Corruption is a hell of a drughttps://x.com/kenklippenstei/kenklippenstein/status/1584676729552936960…", "I literally couldn't hear anybody for 2 minutes straight because they were yelling over each other what a shit show#GOPDebate", "Remember a few weeks ago when congress rushed to sayIsraelisn’t racist or an apartheid state", "A horrifying, immoral law in Israel now makes punishments fit the offender’s “race”– one punishment for a Jewish rapist and another for an Arab rapist | Editorialhttps://haaretz.com/opinion/editorial/2023-08-01/ty-article-opinion/.premium/in-netanyahus-israel-even-a-jewish-rapist-is-privileged/00000189-ad8e-db2e-adfd-afaff7350000…", "deflated Jabba@mikepompeois annoyed that a journalist who was chopped into pieces by a theocratic dictator got too much media sympathy", "- stayed in Iraq\n- stayed in Afghanistan\n- illegally killed top Iran commander Suleimani (who fought ISIS)\n- tried to coup Venezuela\n- increased drone strikes 400%\n- and his first military action as president is below\n\n(love your comedy, not trying to own you just giving info)", "DeSantis brings up his military experience but leaves out that he oversaw torture at Guantanamo#GOPDebate", "DO THIS SHIT HERE THE SENATE ALREADY PASSED IT CMON HOUSE CMON BIDEN", "Greenland has entered daylight saving time for the last time. \n\nThe semi-independent Danish territory has opted to remain in summer time permanently when Europe's clocks move back in the autumnhttps://semafor.com/article/03/28/2023/greenland-daylight-saving-time…"], "seanhannity": ["“We are no longer confident we killed a senior AQ official...”", "EastPalestine Mayor Trent Conaway: I really feel for our residents", "'Pothole Pete' finally says he will travel toEastPalestinehttps://trib.al/dWEsMnC", "BIBI’S BACK!Israel’s Benjamin Netanyahu Wins Election Bid, Third Stint as Prime Minister", "Hannity Grills Ramaswamy Denying He Said Aid to Israel Would Stop in 2028: ‘You Want Me to Read It?’", "East Palestine Mayor Trent Conaway: I really feel for our residents", "“We are no longer confident we killed a senior AQ official...”", "US' botched drone strike in 2021 is the ‘greatest systemic abandonment’ of our partners: Scott Mann"], "funder": ["Check out the large crowd of Kaiser workers marching in Baldwin Park. And the energy. Kaiser Execs need to pay up and take a pay cut.#SolidaritySeason", "The thing about these worker strikes is how the workers are 100% right. And their employers are absolutely, 100% wrong. Without a doubt.#SolidaritySummer", "\"Our labor unions are not narrow, self-seeking groups. They have raised wages, shortened hours, and provided supplemental benefits. Through collective bargaining and grievance procedures, they have brought justice and democracy to the shop floor.\" JFK#UnionsForAll", "If you don’t want to be blamed for acts of violence then don’t use violent rhetoric for years.", "Our friends in Hawaii need our help.\n\nHere’s what you can do#Hawaii", "Everyone needs to hear this story! Shame on Amazon!https://x.com/kenklippenstei/kenklippenstein/status/1665424038670356483…", "If you don’t want to be blamed for acts of violence then don’t use violent rhetoric for years.", "Sick, but true. And sad that some corrupt folks are trying to do this again. Unions can stop it."], "fred_guttenberg": ["Just left a meaningful and important night at the@WhiteHousecelebrating Jewish History Month. Thank you@POTUS,@FLOTUS,@VP, and@SecondGentlemanfor including me.  Your words tonight on anti semitism were truly appreciated.  President Biden was right \"silence is complicity.\"", "Honored to be at United Nations conference on anti Semitism with@robertwolf32,@maxschachter&@saribethrose.  Thank you@Weinsteinlaw,@AJCCEO&@SecondGentleman.", "(6,15) families from the very beginning and made sure that our loved ones would always be remembered.  We could thank them for doing everything possible to achieve justice.  We could also say whatever we want to the defense team that gave up its humanity to defend the monster.", "We always knew he was anti Semitic.  Yet, many stayed silent.  We always knew, yet many supported and voted for him anyway.  He keeps telling us, yet many still will support him.  That includes some running for President and in Congress.  The time is NOW to put an end to this.", "You left something out@HouseGOP.  Parents have a right to send children to school and other public places without  gun violence.   Because of you, my rights were not considered.  This is Jaime, her rights were terminated when she was murdered in school because of an AR 15.", "(6,15) families from the very beginning and made sure that our loved ones would always be remembered.  We could thank them for doing everything possible to achieve justice.  We could also say whatever we want to the defense team that gave up its humanity to defend the monster.", "Jaime's life in a photo.\n\nJaime born in 2003\n\nAssault weapons ban ends in 2004\n\nHeller decision defining \"common use\" and creating a business strategy for the gun lobby in 2007\n\nMurdered in 2018\n\nJaime and all victims of gun violence were legislated and litigated to the grave.", "(1,2) One year ago, the reality of American Carnage touched another community, leaving 21 killed.  I have since gotten to know many of the wonderful families now broken by gun  today my heart is with them.  Many of them have fought heroically for change to protect"], "LeeCamp": ["Wow, you know it's bad when Western propaganda is so insane it's even (eventually) fact-checked by NBC news", "This is like saying “Sorry I robbed you & burned down your house for 100 years. Here’s a gun.”", "Companies “...dumped radioactive and toxic waste into rivers. Some of the more than 250 million tons of toxic & radioactive detritus… scattered into nearby communities, some spilled into streams or leaked into aquifers.” Many of the mines & mills STILL have not been cleaned up.", "Here's everything that has been done to me simply for being an anti-war, anti-capitalism comedian:2016 My Facebook of 330,000 followers is shadow-banned nearly into oblivion2016 My main YouTube channel of a quarter million subscribers is shadow-banned, decreasing views", "Wow, you know it's bad when Western propaganda is so insane it's even (eventually) fact-checked by NBC news", "This is like saying “Sorry I robbed you & burned down your house for 100 years. Here’s a gun.”", "It only took them 7 months of brutal war to figure out what true peace activists said from day one.", "I'm going to take a wild guess that the US & NATO destroying the entire country of Libya probably did not help them deal with this gut-wrenching climate disaster."], "JordanChariton": ["Here's OH Gov. ADMITTING it's not yet safe for residents to be in#EastPalestineOH. \"The whole goal here is to make this community safe. That can't happen overnight. You can't get all the stuff out of here overnight.\"\n\nTHEN WHY WERE RESIDENTS ALLOWED BACK? WHY ARE THEY THERE NOW?", "This House hearing on#EastPalestineis a complete joke.Norfolk Southern not present.Took half hour to bring up  WIDESPREAD residents' health issuesDr. only mentioned sore throat, headaches, & anxiety (no mention on dizziness, bloody noses, chemical burns, bronchitis)", "On#FourthofJulyremember:Flint has had toxic water for 3,357 days. No one in prison 9 years laterNorfolk Southern nuked#EastPalestine5 mths ago. Residents are sick & desperateWhite people didn't want#DAPLin their town, so it got re-routed through Standing Rock...", "A month ago a petrochemical bomb went off spreading toxic carcinogenic chemicals through multiple states sickening an entire community and killing tens of thousands of animals. Mainstream media are merely providing updates…", "Here's OH Gov. ADMITTING it's not yet safe for residents to be in#EastPalestineOH. \"The whole goal here is to make this community safe. That can't happen overnight. You can't get all the stuff out of here overnight.\"\n\nTHEN WHY WERE RESIDENTS ALLOWED BACK? WHY ARE THEY THERE NOW?", "This House hearing on#EastPalestineis a complete joke.Norfolk Southern not present.Took half hour to bring up  WIDESPREAD residents' health issuesDr. only mentioned sore throat, headaches, & anxiety (no mention on dizziness, bloody noses, chemical burns, bronchitis)", "On#FourthofJulyremember:Flint has had toxic water for 3,357 days. No one in prison 9 years laterNorfolk Southern nuked#EastPalestine5 mths ago. Residents are sick & desperateWhite people didn't want#DAPLin their town, so it got re-routed through Standing Rock...", "A month ago a petrochemical bomb went off spreading toxic carcinogenic chemicals through multiple states sickening an entire community and killing tens of thousands of animals. Mainstream media are merely providing updates…"], "mmpadellan": ["Even Fox News knows that the deregulation by the trump admin were the cause of the disaster inEastPalestine, OH. And Elaine Chao never visited train derailment sites, even when there were fatalities.", "The House just broke out into a chant for Rep Jeffries \"HAKEEM! HAKEEM!\"\n\nOutstanding unity.", "OOPS! Looks like Fox News allowed a bit of truth to slip into their coverage of the train derailment story inEastPalestine, OH — they're blaming trump!!!Be a real shame if everyone retweeted this.", "Notice how there WERE massive protests for the murdered children, people even got expelled from Congress because of it. \n\nPeople with their heads securely wedged into their posteriors may have missed it, though.", "Even Fox News knows that the deregulation by the trump admin were the cause of the disaster in East Palestine, OH. And Elaine Chao never visited train derailment sites, even when there were fatalities.", "The House just broke out into a chant for Rep Jeffries \"HAKEEM! HAKEEM!\"\n\nOutstanding unity.", "Notice how there WERE massive protests for the murdered children, people even got expelled from Congress because of it. \n\nPeople with their heads securely wedged into their posteriors may have missed it, though.", "Appreciation post for President Jimmy Carter who, after entering hospice care 7 months ago, is still with us and even made a public appearance today at the Plains Peanut Festival in his hometown, where he is cherished.\n\nPresident Carter has lived an exemplary life most people"], "charliekirk11": ["MUST WATCH: Senator JD Vance visits a creek flowing near theEastPalestine train derailment and chemical burn. See what happens when he drags a stick along the creek bed.", "BREAKING: Tafari Campbell, the man found dead near the Obama's Martha's Vineyard mansion was their sous chef in the White House and went on to work work for the Obamas when they left office.", "AnEastPalestine woman's chickens all die following the controlled burn and train derailment. \n\nWhat's going on?", "EastPalestine, Ohio’s latest tourism video. Everything is fine!", "MUST WATCH: Senator JD Vance visits a creek flowing near the East Palestine train derailment and chemical burn. See what happens when he drags a stick along the creek bed.", "An East Palestine woman's chickens all die following the controlled burn and train derailment. \n\nWhat's going on?", "Joy Behar says the residents of East Palestine got what they deserved because they voted for Trump. \n\nFor the record, this is 1000x worse than anything Don Lemon said. Will she be kicked off her show and forced to undergo sensitivy training?", "114 Dead, 1,000 more missing in Maui fires — Falls Asleep \n\n13 Marines killed in failed Afghanistan withdrawal — Checks Watch"], "davidsirota": ["A month ago,@LeverNewsbroke open the story of governmental decisions that deregulated the rail industry before theEastPalestine disaster.\n\nToday,@SenWhitehousespotlighted some of those revelations in the Senate hearing with Norfolk Southern's CEO.", "Corporate media has been lying about theEastPalestine disaster by pretending Trump is the only perpetrator of rail deregulation.\n\nThe actual truth: The Obama, Trump and Biden administrations all played pivotal roles in that dereg.", "Imagine if wealthy investors had spoken out as forcefully for rail regulation as they spoke out for special depositor insurance.\n\nImagine if the government responded as quickly & forcefully to helpEastPalestine residents as it responded to help rich VCs.", "The company that made the toxic chemical that exploded inEastPalestine funneled $2 million to Senate Republicans' super PAC, and now the bill is stalled in the Senate:https://levernews.com/the-corporate-cash-behind-the-train-safety-bills-derailment/…", "It’s been 193 days since the train derailment in East Palestine and Congress has not done anything to help residents or prevent future disasters. I introduced a bill months ago to strengthen safety regulations currently languishing in the House. It’s unacceptable.", "This video tells the 3-part truth corporate media won’t admit but@LeverNewsreported: \n\n1. Obama exempted the Ohio train from hazmat safety rules\n\n2. Trump repealed the remaining brake rule that Obama weakened \n\n3.@SecretaryPeterefused to fix the rules", "Corporate media has been lying about the East Palestine disaster by pretending Trump is the only perpetrator of rail deregulation.\n\nThe actual truth: The Obama, Trump and Biden administrations all played pivotal roles in that dereg.", "Literally everyone in Congress in February: “We must pass rail safety legislation.”\n\nSix months later, after $2 million was funneled to the GOP from the maker of the toxic chemical that exploded in East Palestine", "I know liberals live in a Goldfish Culture where they forget their entire world every 15 minutes, but the facts are right there: Dems could’ve averted this with just 50 Senate votes via reconciliation during a lame duck session, but they refused."], "kylegriffin1": ["Leader Schumer: \"When the former President of the United States welcomes at his own dinner table several vicious antisemites and then, rather than apologize, he lectures American Jewish leaders for insufficient loyalty — it is incumbent on all of us to speak out.\"", "Yusef Salaam, who was exonerated in the infamous Central Park Jogger case years after Trump took out a full-page newspaper ad calling for the death penalty, issued a one-word statement: \"Karma.\"", "President Biden is establishing an inter-agency group led by Domestic Policy Council staff and National Security Council staff to increase and better coordinate U.S. Government efforts to counter antisemitism, Islamophobia, and related forms of bias and discrimination.", "The EPA has ordered Norfolk Southern to clean up the contamination from the train derailment inEastPalestine, Ohio.", "Breaking: Prosecutors drop charges against Adnan Syed in connection with the 1999 murder of Hae Min Lee, weeks after Syed’s conviction was overturned.", "The Senate just voted to advance a repeal of the 1991 and 2002 authorizations for use of military force.", "Reuters: IRAN OUSTED FROM U.N. WOMEN'S BODY AFTER U.S. REQUESTED VOTE", "Rep. Ilhan Omar, before the vote to remove her from the Foreign Affairs Committee:\n\n\"Take your vote or not, I am here to stay, and I am here to be a voice against harms around the world and advocate for a better world.\""], "TuckerCarlson": ["We grilled the GOP candidates at the Iowa summit and then traveled to Florida for a big speech at Turning Point USA.\n\nWatch this video of the speech to see how the candidates performed, what’s happening in America and more. \nSPOILER: We even cover the 8 ball of cocaine found in", "Which county is more welcoming to Christians, Ukraine or Russia? That’s a fair question. Why is no one allowed to ask it?", "Anyone who cares about the future of the United States should be asking what's happened to El Paso. Everything that's happened there has been the direct result of the choices made by U.S. policymakers, particularly the Biden administration.", "If the First Amendment means anything, it means that what's happening to Douglass Mackey is an outrage. It should end immediately.", "We grilled the GOP candidates at the Iowa summit and then traveled to Florida for a big speech at Turning Point USA.\n\nWatch this video of the speech to see how the candidates performed, what’s happening in America and more. \nSPOILER: We even cover the 8 ball of cocaine found in", "Ep. 18  Into the abyss: Colonel Douglas Macgregor tells us why the Ukraine war must end now.", "The war in Ukraine began a year ago today, on February 24, 2022, when the Russian military rolled across the eastern border of the country. But in many ways, the Russian invasion of Ukraine was the endpoint of a much longer story.", "It looks like Don L'Mon's television career is finally over. Mr. L’Mon has been sentenced by the High Court of Wokeness to a term in the HR gulag."], "elonmusk": ["The New York Times actually has the nerve to support calls for genocide! If ever there was a time to cancel that publication, it is now.\n\nYou can read their articles for free anyway usinghttp://removepaywall.com.", "Artificial intelligence discussion with PM Netanyahu in an hour", "I look forward to speaking at9:15(19:15 Israel time) on X with@elonmuskabout how we can harness the opportunities and mitigate the risks of AI for the good of civilization.", "Because the answer is “Yes!” regarding seeking donations, hence JG’s refusal to answer the question. \n\nJG instead went on the attack, implying that Sorkin, despite being Jewish, is somehow an anti-Semite just for asking a basic conflict-of-interest question!", "Thank you for recognizing concerns about safety of digital superintelligence, which affects all of humanity", "The New York Times actually has the nerve to support calls forgenocide! If ever there was a time to cancel that publication, it is now.\n\nYou can read their articles for free anyway usinghttp://removepaywall.com.", "That was a crazy and cruel thing for him to say. If those kids wanted to be at the front lines, they wouldn’t need to be conscripted.", "Artificial intelligence discussion with PMNetanyahuin an hour", "I look forward to speaking at9:15(19:15 Israel time) on X with@elonmuskabout how we can harness the opportunities and mitigate the risks of AI for the good of civilization.", "Not exactly subtle. It is unequivocally agenocidesong!"], "itsJeffTiedrich": ["congratulations to the literally zero Republicans who have stood up to denounce Donald Trump's attack on American Jews. take a victory lap, you spineless fucking cowards", "excuse me but why the the fuck is a confessed nuclear spy allowed to sit in his shitty golf motel and threaten Jews for insufficient loyalty or whatever the fuck his brain worms are telling him. can we please lock this deranged national security threat the fuck up already", "what kind of shithole country lets a tiny extremist minority fuck everything all to hell for the rest of us", "hey, remember when Donald Trump threatened the Jews and it was a one-day story? what in actual fuck, America", "what kind of shithole country lets a tiny extremist minority fuck everything all to hell for the rest of us", "how fucked up is this: some Texas dipshit was firing his AR-15 into the air and his neighbors asked him to please stop and so he shot them all dead on the spot. four adults. one child. what the fuck. this is why the rest of the world thinks we've lost our fucking minds", "holy fucking shit, criticizing Israel is not antisemitic. what IS antisemitic is putting a holocaust-denying lunatic who thinks Jews control the weather on the Homeland Security Committee. sit the fuck down and shut the fuck up and spare us your fucking fake outrage", "holy fucking shit, the right-wing hate machine created a monster and handed him a weapon of mass death. please read my latest piece, and please sign up for my FREE newsletter, so we can always keep in touch. thanks ..."], "bluestein": ["“Giuliani doesn’t elaborate on other instances when the Red Sea was parted.”", "The Georgia House is about to vote on a measure to treat attacks fueled by antisemitism as a hate crime. It gained new traction after flyers denigrating Jewish people were found in the driveways of state Rep. Esther Panitch, D-Sandy Springs, and other Jewish leaders.#gapol", "U.S. Sen. Jon@Ossoffis set to deliver keynote remarks this weekend at a unity rally hosted by a Macon synagogue that was one of two Georgia congregations recently targeted with antisemitic attacks by a group of Neo-Nazis.#gapol#gasenhttps://ajc.com/politics/politics-blog/ossoff-to-join-macon-unity-rally-targeted-by-antisemitic-attacks/UDMVDQ37JBG55MZYGSULQTWGA4/…", "The Jolt: The cretins who distributed antisemitic flyers to dozens of metro Atlanta homes over the weekend may have inadvertently helped advocates push a long-sought legal protection for Jewish people.#gapolhttps://ajc.com/politics/politics-blog/the-jolt-antisemitic-flyer-targets-jewish-sponsor-of-hate-crime-bill-others/76C4QV3KZJAUBJGSZUFXWNZRVE/…", "“This is a pivot point,” former Lt. Gov. Geoff Duncan says as he leaves the courthouse.#gapol", "“Show up. It makes a huge difference. You're looking at the difference that it makes. You think they gave us this office? We showed up. If there was any way they could have denied it, they would have tried it,” says Warnock, adding: “We need you to show up one more time.”#gasen", "Warnock says his two kids were on lockdown at their schools. “They’re there, I’m here, hoping and praying they’re safe. But the truth is none of us are safe … Thoughts and prayers aren’t enough.”\nMass shootings “aren’t a cost of freedom, they’re a cost of obstinance.”#gapol", "U.S. Sen. Jon@Ossoffis set to deliver keynote remarks this weekend at a unity rally hosted by a Macon synagogue that was one of two Georgia congregations recently targeted with antisemitic attacks by a group of Neo-Nazis.#gapol#gasenhttps://ajc.com/politics/politics-blog/ossoff-to-join-macon-unity-rally-targeted-by-antisemitic-attacks/UDMVDQ37JBG55MZYGSULQTWGA4/…"], "krystalball": ["CNN had a literal lobbyist for Norfolk Southern on their panel to talk aboutEastPalestine and didn't disclose it.", "A provision in Obamacare allows residents in areas deemed a public health disaster to be covered by Medicare for life. At the very least,EastPalestine residents deserve this universal coverage after being exposed to a known carcinogen.", "Great work on this@heyjohnrussell. Thanks to @moreperfectunion for giving him this platform and not forgetting aboutEastPalestine!", "NEW: We went down to East Palestine for a week to get residents’ side of the story after the Ohio rail disaster.\n\nPeople told us they’re getting sick and their pets are dying, while Norfolk Southern is trying to cover it up.@heyjohnrussellreports.", "Total disaster to cede the number one issue to republicans", "NEWS: Dems have opted to go almost completely silent on economic/inflation messages in the election, according to comprehensive ad data obtained by@LeverNews.\n\nDems made this decision despite polls showing the economy/inflation are voters' #1 issue.https://levernews.com/dems-barely-messaging-on-economic-issues/…", "CNN had a literal lobbyist for Norfolk Southern on their panel to talk about East Palestine and didn't disclose it.", "A provision in Obamacare allows residents in areas deemed a public health disaster to be covered by Medicare for life. At the very least, East Palestine residents deserve this universal coverage after being exposed to a known carcinogen.", "Here we are facing possible nuclear war and the chair of the progressive caucus can’t even stand by a carefully worded statement saying diplomacy is good actually. Man I despair for the country sometimes.", "Will see what rank and file think but on its face this looks really strong. Solidarity is POWERFUL", "The details of the new Writers Guild contract are out. We won:\n• Success-based residuals\n• Strong limitations on A.I.\n• Minimum writers room staffing\n• Guaranteed compensation and 13-week minimums for Comedy/Variety writers in streaming\n(cont)https://wgacontract2023.org/the-campaign/summary-of-the-2023-wga-mba…"], "SarcasmStardust": ["I can’t. Fuck.#FuckIsrael#FreePalestine", "The cruelty\n\nAn israeli guard executed an autistic Palestinian named Eyad Hallaq.\n\nThe israeli guard shot him in the leg, chased him to a garbage room, then fired 3 more bullets in his chest with an M16.\n\nEyad's mother screams as the israeli court lets her son's killer walk free", "Remember when our “ally”Israelbombed the airport in Aleppo immediately following the earthquakes making it impossible for life saving aid to get to the victims? \n\nShut the fuck up and leave Syria alone.", "Twelve years of war, and this year’s earthquakes, have pushed the Syrian people to the brink. \n\nThe Syrian people are crying out for support – and, more than anything, for peace.https://usun.usmission.gov/remarks-by-ambassador-linda-thomas-greenfield-at-a-un-security-council-briefing-on-the-political-and-humanitarian-situations-in-syria-2/…", "Watching people pretend like their team hasn’t had a hand in what’s happening inEastPalestine is so frustrating. Y’all. They ALL suck. Not a single one of them give a fuck about us. Sooner we realize that and come together to deal with our common enemy, the better.", "Absolutely depraved.#FuckIsrael#FreePalestine", "Israeli occupation troops poured concrete into the water sources to stop agricultural irrigation in an area in Hebron that serves 25 Palestinian families.", "Today is Mumia Abu-Jamal’s birthday. He remains in prison after serving 15,110 days. He should be home today celebrating with his family.#FreeMumia", "I’m an American and I do NOT support Israel. They are absolutely a racist and apartheid state. My government does not speak for me.#FreePalestine#FuckIsrael", "Watching people pretend like their team hasn’t had a hand in what’s happening in East Palestine is so frustrating. Y’all. They ALL suck. Not a single one of them give a fuck about us. Sooner we realize that and come together to deal with our common enemy, the better.", "I can’t. Fuck.#FuckIsrael#FreePalestine", "The cruelty\n\nAn israeli guard executed an autistic Palestinian named Eyad Hallaq.\n\nThe israeli guard shot him in the leg, chased him to a garbage room, then fired 3 more bullets in his chest with an M16.\n\nEyad's mother screams as the israeli court lets her son's killer walk free"], "AnnCoulter": ["December 7, 1941. Japanese sneak attack on Pearl Harbor kills 2,403, including 1,177 aboard the USS Arizona.  Never forget the bravery and the sacrifice, 81 years ago today.", "You want a \"territorial dispute\"?  How about the one that kills 100,000 Americans a year?\n\nElites:  Who cares!  Ukraine! Crimea! Iran! Taiwan! Syria! Afghanistan! South Korea! \n\nFULL VIDEO:https://anncoulter.substack.com/p/mickey-and-me-on-the-disappearing…", "Daniel Penny protected every person in that subway car. So now he’s got to pay.\n\nMy new Spectator column here -https://thespectator.com/topic/daniel-penny-mistake-resist-mayhem-jordan-neely-new-york/…", "Our cities are war zones, the murder rate shot up 30% in 2020 and continues to rise, little girls are being poisoned and mutilated, 100,000 Americans die of drug overdoses every year -- and the@nytimesgets to the BIG ISSUE:", "Our country's history is a history to be proud of — precisely for how we treat the defeated, Confederates and Indians.\n\n[Special post for recent arrivals and media ignoramuses.]https://anncoulter.substack.com/p/nikki-haley-offers-moral-instruction?utm_source=twitter&sd=pf…", "How was the shooter stopped, again?  A slingshot?  A stern lecture on gun control?", "wow. a woman makes a passionate case for gun control during a press conference about the Nashville school shooting", "It's important to teach children that there will never ever, ever be consequences for their actions.", "I'll tell you one thing.  This being San Francisco, this perp is about to face some SERIOUS Restorative Justice, quite possibly even mandatory Conflict Resolution.", "BREAKING: Paul Pelosi “violently assaulted” in home break-in. The husband of House Speaker Nancy Pelosi is hospitalized and expected to fully recover, spokesperson says.https://apnews.com/article/paul-pelosi-assaulted-156ece77186eb11b97260af3c5122f67?taid=635bd4cc14bc1f00012a74e9&utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Twitter…", "OF COURSE HE CAN!  But a president like DeSantis knows you also have to push through legislation doing it, or a Dem president will change it right back.", "Asked by@CBSNewswhether he would join Trump and DeSantis in promising to end birthright citizenship for children of immigrants without legal status, presidential hopeful Tim Scott said presidents lack the authority to do so.\n\nA “president cannot do that by himself or herself.”", "Overdosing driver who nearly killed dozens of innocent people was \"revived after being given multiple doses of a medication used for opioid overdoses.\"\n\nWhat a relief they revived him!  Think of the loss to humanity if he'd died.https://bit.ly/3Nf93fJ"], "SteveSchmidtSES": ["On The Warning podcast this week, I spoke with@JGreenblattADL, the executive director of the@ADL, about the alarming rise of extremism, and antisemitism specifically, in the United States.\n\nCatch our full conversation here:https://youtu.be/UxYGk7_UI1Yhttps://apple.co/3nKzWxX", "4. Hatred, Lies and scapegoating are on the ballot as is a growing and dangerous menace of antisemitism. \n\nThe American experiment has been under a growing assault for seven years. It is not abating and it has become a frontal assault that is occurring in broad daylight.", "11/ A fetid and corrupted gaggle of wannabe American Ayatollahs. No thanks.", "Today, I visited the oldest synagogue in continuous use in the Western Hemisphere. The firstJewprayed here in 1732, the year that George Washington was born. Today, McCarthy met with antisemite Paul Gosar. What do you call someone who seeks power with the aid of antisemites?”", "CONGRATULATIONS INDIANA ! \n\nThe ATTORNEY GENERAL of INDIANA embraces ANTISEMITISM and KANYE WEST who promised to attack the JEWS.\n\nTHE MAGA MOVEMENT IS AMERICAN CANCER", "The constant hypocrisy from the media is at an all-time high. They have now gone after Kanye for his new fashion line, his independent thinking, & for having opposing thoughts from the norm of Hollywood.https://on.msnbc.com/3Cj6oL6", "3/@TimRyandid not back down. He did not anger. He led. He confronted insanity with truth and drew a line. He summoned the crowd to be AMERICANS. In essence he was asserting BE NOT AFRAID to a@FoxNewsaudience. What happened when he wouldn’t back down?", "“We have to go forward finding some way where we can speak to our brothers and sisters in a way that reminds them of the seriousness of this moment.”\n\nWatch my conversation with@KenBurnson the crisis of this moment and how Americans must come together:", "“Police aren’t soldiers. Their charge is to protect & serve. The American citizen isn’t an enemy, and if any soldier beat an enemy to death like Tyre Nichols, the soldier would be charged as a war criminal under the Uniform Code of Military Justice (UCMJ).”https://open.substack.com/pub/steveschmidt/p/murder-in-memphis?r=2ibrr&utm_medium=ios&utm_campaign=post…", "A great tragedy of this moment is that an overwhelming number of political reporters, editors, TV hosts and media executives have no clue what they are looking at when they see this. They don’t understand the country they live in and the people they report on,at all. Danger ahead", "At Michael Flynn and Eric Trump’s ‘Reawaken America’ event, they struck the ground with imaginary arrows 7 times to call upon God to bring victory to the Republican Party in the midterms.", "I can explain this@BretBaier. It was all aligned beforehand. It was a conspiracy. All that was required was an incitement( dropping the balls) \n\nThen it all fell in place. \n\nit’s what@TimRyancondemned. You sat silent and let people cheer the thugs who murdered a cop. Terrible", "x.com/travisakers/st…", "There was a man named Neville Chamberlin who once declared « Peace for our time » \n\nMr. Churchill said «You were given the choice between war and dishonour. You chose dishonour and you will have war” \n\nWhatever happens let @GOPLeader be known forever as «Appeaser of the House»", "McCarthy’s team laid out a compromise that would give in to nearly every demand expressed by the current defectors. Plan discusses everything from rules committee seats to house floor vote guarantees, a source familiar tells me.", "Between 'Oppenheimer' serving as a strong reminder of the ability of one person to start a nuclear war and the appalling misconduct of MAGA Republican leadership in deference to Donald Trump, it should be clear that we need to elect honorable leaders in 2024:", "\"I think we should ban weapons of war on the streets and in our schools. I think kids' lives are more important than AR-15s.\"\n\nThis week’s The Warning podcast,@rweingartenand I cover everything from book banning to the dangers that students and teachers face on a daily basis."], "SocialistMMA": ["Over 160 Palestinians killed by Israeli forces this year alone meanwhile the Nazi supportingwestis silent", "Good.Israelshould not exist. Get rekt Zionists", "Very nice way for the NYT to bring up the fact thatIsraelis becoming even more radicalized and elected a genocidal government", "I hate Zionists so much. They are only growing more bloodthirsty and radical by the day", "Over 160 Palestinians killed by Israeli forces this year alone meanwhile the Nazi supporting west is silent", "Good. Israel should not exist. Get rekt Zionists", "Very nice way for the NYT to bring up the fact that Israel is becoming even more radicalized and elected a genocidal government", "Ilhan Omar you literally endorsed Jim Crow Joe who sent Covid relief money to the police. \n\nYou voted to give the capitol police a budget increase and surveillance powers using January 6 as a cover \n\nstfu"], "gtconway3d": ["“Nice religion you have here.  It would be a shame if something happened to it.”", "okay I’ve investigated this controversy on X for a full five minutes on Google via my iPhone and am now an expert on the subject for all intents and purposes on X\n\nI conclude that, although this was not known at the time, and it took thousands of years for mankind to figure out,", "this mass persecution of tourists must stop", "The U.S. Attorney for the District of Columbia says more than 1,069 defendants have been charged in connection with the Jan. 6 , 2021, Capitol siege and 594 have pleaded guilty. 98 people have gone to trial.", "I understand the sentiment here, but this would be Guantánamo-style justice.  \n\nHe’s entitled to a speedy trial, and he should get one—oops, I mean four.", "I have an idea.\n\nHe can be detained pending trial AND delay the trial until 2026.\n\nThen we all get what we want.", "The screenwriters’ strike ends and the *FIRST THING* they do is come up with a scene where P01135809 *ON CAMERA* commits a *FELONY VIOLATION* of the *SAME FEDERAL GUN LAW* that *HUNTER BIDEN* is charged with violating!!!\n\nCan’t wait for the rest of the season!!!", "“‘We killed Herman Cain,’ Meadows told Hutchinson.”", "Cassidy Hutchinson’s new book reveals a Trump White House even more chaotic than previously knownhttps://cnn.com/2023/09/26/politics/cassidy-hutchinson-book-trump-white-house-chaos…", "Here it is.  It’s just stunning to see the parallels among the different incidents.  Damning doesn’t begin to describe it.", "THREAD: Here is a list of all the 22 women who have credibly accused Trump of rape and sexual misconduct. Please Retweet. \n\n1. Jill Harth says she was groped and kissed in a bedroom at Mar-A-Lago.https://theguardian.com/us-news/2016/jul/20/donald-trump-sexual-assault-allegations-jill-harth-interview…", "“… They can't bring themselves to do that. If they do that then they have to admit they've been essentially endorsing and enabling a monster.”", "George Conway: Trump voters are incapable of admitting they're 'endorsing and enabling a monster'https://rawstory.com/george-conway-2659988531/…"], "ProudSocialist": ["The U.S. government & both of its corrupt political parties love to lecture about how free our country is but there is nothing free about this country when it’s arresting journalists for reporting the truth about the chemical disaster in Ohio.#EvanLambert", "Jimmy Dore calling out@RobertKennedyJron his refusal to stand up toIsrael:\n\n“Why is it that you can stand up to the military industrial complex, you can stand up to Big Pharma, you can stand up to your own party, but you can't stand up toIsrael?\"", "Democrats and Republicans are both evil pieces of sh*t, but what makes Democrats more dangerous is they are cast as the “good guys” by the mainstream media and even awarded Nobel Peace prizes as they are killing innocent civilians with drone strikes. STOP VOTING FOR THE DUOPOLY.", "Yesterday security officers at the@FairmontMiramarattacked workers who are exercising their right to strike. Also notice how police watched & allowed it to happen—which is not surprising as police will always side with capital over labor.@UNITEHERE11", "Jimmy Dore calling out@RobertKennedyJron his refusal to stand up to Israel:\n\n“Why is it that you can stand up to the military industrial complex, you can stand up to Big Pharma, you can stand up to your own party, but you can't stand up to Israel?\"", "Democrats and Republicans are both evil pieces of sh*t, but what makes Democrats more dangerous is they are cast as the “good guys” by the mainstream media and even awarded Nobel Peace prizes as they are killing innocent civilians with drone strikes. STOP VOTING FOR THE DUOPOLY.", "If Biden & the Democrats believed in peace they’d be pushing for#PeaceTalksbetween Russia & Ukraine but peace doesn’t enrich U.S. weapons makers so instead they’re sending cluster bombs to Ukraine even though they’re banned in 100 countries because they kill innocent civilians.", "Americans are propagandized to think war is necessary to “protect our freedom” but that is bullshit. Our government & its imperialist parties don’t fund war to keep us free. They fund war to keep us beholden to the system that makes them & their donors rich at humanity’s expense."], "checkmatestate": ["I hate Trump, so I’m neutral on the January 6th thing.\n\nFrom my perspective, it looks like the J6 committee was willing to unjustly destroy regular people’s lives in order to get Trump.\n\nAm I missing something?", "You can call it “government and private sector engagement” but it’s just government speech regulation and is a blatant violation of the First Amendment.", "First, I’m told that communists are cool because the Soviets ended the Holocaust. Then (in the exact same thread) I’m told that the Soviets aren’t real communist’s because real communists would never do the Holodomor.", "Where do I cancel my $100billion proxy war subscription?", "You can call it “government and private sector engagement” but it’s just government speech regulation and is a blatant violation of the First Amendment.", "First, I’m told that communists are cool because the Soviets ended the Holocaust. Then (in the exact same thread) I’m told that the Soviets aren’t real communist’s because real communists would never do the Holodomor.", "Look at what Putin is doing to Ukraine! Barbaric!", "cut the military budget by however much money they can’t account for in their audit."], "Josh_Moon": ["And here's part of what happened after the riverboat docked and the other workers and people on the boat were able to get to the fight.", "Translation: \"Town of sane people decided not to entertain the absurd fear mongering of mouth-breathing carnival barkers in town for a quick grift.\"", "It should piss off everyone that we're paying for an absolutely pointless special session where Republicans aren't even going to try to draw acceptable maps. Why waste the money if you're going to let a special master do it anyway? And make no mistake, that's what they're doing", "Another mass shooting. Can't go to church, the mall, parades, school, college, the grocery store, county fair, nightclubs, football games, basketball games, baseball games, military bases,  airports, synagogues or Walmart. Sure am enjoying all this 2A freedom!", "And here's part of what happened after the riverboat docked and the other workers and people on the boat were able to get to the fight.", "Remember way back a whole 10 months ago when Republicans kept saying they weren't going to prosecute mothers under the new abortion ban? Well they lied.https://legislature.state.al.us/pdf/SearchableInstruments/2023RS/HB454-int.pdf…", "Seems like a good time to remind you that just 7 yrs ago, we had a president in his 8th year in office without a single criminal indictment in his administration. He was a good husband, a model dad & a decent human. His biggest scandal was wearing a tan suit. It was this guy:", "Translation: she fired the Black lady because it appeased a bunch of racists and for absolutely no other reason."], "EricTrump": ["Remember, these statements, from the Attorney General, are “inadmissible” in New York. Does this feel like a fair application of the law?", "In an attempt to destroy my father and kick him out of New York, a Judge just ruled that Mar-a-Lago, in Palm Beach Florida, is only worth approximate “$18 Million dollars”… Mar-a-Lago is speculated to be worth we’ll over a billion dollars making it arguably the most valuable", "These homes are about 1/30 the size of Mar-a-Lago, not on the beach (let alone the beach and intercostal), don’t span from once side of the Palm Beach Island to the other… it is a travesty of justice and an embarrassment to the court.", "Congratulations Trump Chicago! We just took 1st place for all hotels in the Midwest United States, achieved the highest Forbes score of any hotel in Chicago & were awarded #1 \"Most Unique Hotel in the U.S.\" byhttp://Travel.com. Proud of my team!@TrumpChicago@TrumpHotels", "Unfortunately, this is what American weakness looks like. These games, this nonsense and the utter disrespect would NEVER have happened under Trump. So embarrassing to see.#MAGA2024", "Watching the plane, from the plane (Part #2)", "As we speak, my father is being deposed by this corrupt Attorney General. This is what the weaponization of the legal system looks like…", "Remember, these statements, from the Attorney General, are “inadmissible” in New York. Does this feel like a fair application of the law?"], "LaraLeaTrump": ["1 mile run, 100 pull ups200 pushups300 air squatsand a 1 mile run...with a\nweighted vest (for most of it) = a \"Murph\" and is\ndone in honor of Navy SEAL and Medal of Honor recipient, Michael Murphy, who was killed in action in 2005 serving our country in", "Welcome to the last 48 hours of my life - Charlie managed to find some, mostly decomposed, decayed remnants of an unrecognizable animal that I assume washed into our yard during the torrential downpours on Monday. He has been fully obsessed with retrieving whatever remained after", "WATCH:@ErinElmore&@TPostMillennial's@LibbyEmmonsjoins me to discuss the illegal immigration crisis, the destruction of our cities, continued poor airplane etiquette, and MUCH MORE!#TheRightView", "Nothing better in the whole world than COUSINS!!! Mazel tov, Arabella! We love you!", "1 mile run, 100 pull ups200 pushups300 air squatsand a 1 mile run...with a\nweighted vest (for most of it) = a \"Murph\" and is\ndone in honor of Navy SEAL and Medal of Honor recipient, Michael Murphy, who was killed in action in 2005 serving our country in", "WATCH:@_ItsSavannah_joins me to discuss growing up on reality TV, fighting for her parents, her upcoming appearance on Special Forces, her podcast, and MUCH MORE!#TheRightView", "Nothing makes you appreciate home like going away, but last week was very special: 24 hours of sunlight, incredible scenery, perfect weather, handstand contests & new Norwegian friends…thank you, @lyngen_lodge_norway", "Welcome to the last 48 hours of my life - Charlie managed to find some, mostly decomposed, decayed remnants of an unrecognizable animal that I assume washed into our yard during the torrential downpours on Monday. He has been fully obsessed with retrieving whatever remained after"], "WarOnDumb": ["Tommy Tuberville thinks you’re stupid, too.", "I write this column every year. I'm under no illusion that Kay Ivey is going to have a change of heart now. But Alabamians need to understand she is not your sweet \"meemaw.\" She will let people get sick, go broke and die if it suits her political interests. \n\n10.", "I went to DC thinking the VRA was a goner and this thing was a setup for disaster. Coming back, I wasn’t so sure. My intuition told me something big had happened, but I wouldn’t let myself listen to it.", "Last year, a source told me to look at a peculiar line item in the Alabama General Fund budget — $25,000 for the “Inzer House.” What I found would set me off on a journey.", "It's time to dispel the notion Alabama Gov. Kay Ivey is a good person. A thread.", "Kay Ivey has been in office for six years. She's had five opportunities to expand Medicaid. She says we don't have the money for it, even as she's found the money for prison construction and a water park. \n\n3.", "I write this column every year. I'm under no illusion that Kay Ivey is going to have a change of heart now. But Alabamians need to understand she is not your sweet \"meemaw.\" She will let people get sick, go broke and die if it suits her political interests. \n\n10.", "Here’s the video where Ivey promised to do better. How’s that going?"], "robreiner": ["American Jews will not be pushed around by a Fascist Criminal.", "All you need to know about today’s GOP is that their base supports a man who the International Criminal Court has issued an arrest warrant for War Crimes.", "Just a reminder. A former President who led a Violent Insurrection to overthrow the United States Government and has been Indicted for stealing Highly Classified Documents wants to be President again.", "Fascism and Racism was just hit by a massive blow of Democracy.", "Just a reminder. A former President who led a Violent Insurrection to overthrow the United States Government and has been Indicted for stealing Highly Classified Documents wants to be President again.", "All you need to know about today’s GOP is that their base supports a man who the International Criminal Court has issued an arrest warrant for War Crimes.", "American Jews will not be pushed around by a Fascist Criminal.", "Congratulations to Hakeem Jeffries on his unanimous election to the Democratic House Leadership."], "marceelias": [], "toddcstacy": []}