{"maryltrump": ["ProPublica uncovered more than illicit gifts, though: Harlan Crowe, Thomas’ primary ATM, also paid off his mother’s mortgage, financed extensive upgrades to her house, and paid $6,200-a-month boarding school tuition for Thomas’ grand-nephew whom he’s “raising like a son.”\n\n8/", "It is our fellow citizens who continue to give power to the worst among us not only because they tolerate their inhumane policies but because they approve of them. \n\nThat is the problem we need to solve.\n\n8/8", "It's unwise to have expectations that traitors, fascists, and those who don't care if you die will do anything good. But I do have expectations of those who claim to want to do good, who are in a position to do good, and then—because they're weak or misguided or worse—fail us.\n6/", "I confess I often harbor negative feelings toward those on the right. Sometimes I fail to be compassionate or empathetic. I would point out though that while I want 𝘵𝘩𝘦𝘮 to have universal health care, child care, and a living wage, they want me and those like me dead. \n\n5/", "\"The crossroads at which we currently find ourselves has more to do with whether those in a position to heal our broken institutions decide instead to do nothing, thereby leaving us and our country, broken permanently.\"", "A Mayor@mayawileywould have been here. Let's do better next time#NYC.", "First Deputy Mayor Grillo says she does know where@NYCMayor, he's not in the city, but wouldn't say where. She said he's \"taken two days off\" but \"might as well be here\" because he's been in constant contact with his team", "Nine people would be alive today if the shooter hadn’t had a semi-automatic weapon and high-capacity magazines.\n \nI lay it all out in my Substack. It’s the fucking guns.https://marytrump.substack.com/p/the-sickness-unto-death-part-i…", "Thanks to everybody who voted for these unserious, anti-democratic arsonists who will be paid over $170,000 a year of taxpayer money to keep burning it all down. Good work.", "At a mall in Allen, TX, kids were getting ice cream or hanging out with their friends. People were shopping. They were exercising their “unalienable rights,” to “Life, Liberty, and the pursuit of Happiness.”\n\nAll of our Representatives are supposed to protect those rights. But", "\"They expressed no anti-Semitism\" is not something I've ever felt the need to say after hanging out with my friends.  ¯\\_(ツ)_/¯"], "JoJoFromJerz": ["He will never stop fanning the flames of retributive violence.\nAnd the cult will never stop clamoring for more.\nIt’s only going to get worse.", "You can’t go to work, to the MALL, to the grocery store, to your church, to the movies or thebank.\nYou can’t attend a concert, go to a dance class or go to see your doctor. You can’t ring a doorbell, use a leaf blower, hop in a car, pull down a driveway, bounce a ball, or ask", "I refuse to accept this.\nI refuse to accept that I can’t take my kids to an outlet mall without risking them getting shot.\n\nI refuse to accept that by taking them to a parade, to a movie, to the grocery store or to the post office that I am risking them getting shot.\n\nI refuse to", "I will never forget 9/11.\n\nI will also never forget all the lies Donald Trump told about 9/11.\nI will never forget that he lied that very day in a TV interview that one of the buildings he owns, 40 Wall Street, became the tallest building in downtown Manhattan after the Twin", "He will never stop fanning the flames of retributive violence.\nAnd the cult will never stop clamoring for more.\nIt’s only going to get worse.", "You can’t go to work, to the MALL, to the grocery store, to your church, to the movies or the bank.\nYou can’t attend a concert, go to a dance class or go to see your doctor. You can’t ring a doorbell, use a leaf blower, hop in a car, pull down a driveway, bounce a ball, or ask", "I refuse to accept this.\nI refuse to accept that I can’t take my kids to an outlet mall without risking them getting shot.\n\nI refuse to accept that by taking them to a parade, to a movie, to the grocery store or to the post office that I am risking them getting shot.\n\nI refuse to", "We can never become numb to this. This can never become “normal”.\nThis is not fucking normal.\nAnd it is NOT ok.", "Happening now in Columbus, Ohio. Neo - nazis flying swastika flags are outside of a drag event.https://x.com/Liz_Andromeda/status/1652366545102708738/video/1…"], "DineshDSouza": ["As America and theWestpulls further away from its Judeo-Christian\ntradition, Ze’ev Orenstein of the City of David Foundation in Jerusalem\nargues that God is speaking back to us through ancient seals, inscriptions\nand stones.@ZeevOrenstein", "Ze’ev Orenstein of the City of David Foundation in Jerusalem reveals how modern archeology is confirming the truths of the Hebrew and Christian scriptures.@ZeevOrenstein", "Ze’ev Orenstein, international affairs director of the City of David\nFoundation, talks about biblical archeology inIsraeland shows us ash left\noften from the 2000-year-old Roman burning of Jerusalem.@ZeevOrenstein", "After FEMA Denies Aid toEastPalestine, Ohio, Democrats and Republicans Unite to Demand Answers", "Ze’ev Orenstein, international affairs director of the City of David\nFoundation, talks about biblical archeology in Israel and shows us ash left\noften from the 2000-year-old Roman burning of Jerusalem.@ZeevOrenstein", "Trump Vindicated, Biden Proven A Liar As NYT Admits Trump Rollback Had ‘No Impact’ On East Palestine, Ohio", "After FEMA Denies Aid to East Palestine, Ohio, Democrats and Republicans Unite to Demand Answers", "East Palestine Residents Coming Down With Mysterious Illness As Hazardous Chemicals Linger Following Derailment"], "dbongino": [], "TheLeoTerrell": ["Mark Levin: This Is An Abuse Of The Justice System!", "‘Everyone knows the fix is in’: Jordan blasts AG Merrick Garland for ‘two standards of justice’https://leoterrell.com/everyone-knows-the-fix-is-in-jordan-blasts-ag-merrick-garland-for-two-standards-of-justice/?utm_source=mux&utm_medium=social&utm_campaign=tw…", "Taliban slips back into former tyranny with first public execution since Afghanistan takeoverhttps://trib.al/xzpiuTX", "Lawmakers urge Biden not to consider plea deal for 9/11 terrorists to escape death penalty", "Biden Says He Brought Home ‘Wrongfully Detainees’ from ‘Iranda’", "Taliban slips back into former tyranny with first public execution since Afghanistan takeoverhttps://trib.al/xzpiuTX", "Hemingway: Biden Needs To Stop Lying To Gold Star Families That His Son Died In Iraqhttps://thefederalist.com/videos/hemingway-joe-biden-needs-to-stop-lying-to-gold-star-families-that-his-son-died-in-iraq/…", "Outgoing OR Dem Governor Kate Brown commutes sentences of every inmate on death rowhttps://trib.al/rKx9chT"], "donaldjtrumpjr": ["Yea, but Mar-a-Lago with 10X the land, ocean frontage, & one of the most spectacular homes in the world on it is worth only $18 million because a judge wants it to be so for his narrative. \n\nOur legal system has been commandeered by radicals hell bent on destroying America!", "For reference, here’s a patch of trees down the road from the historic Mar-a-Lago property—on a lot that’s a fraction of its size—going for $150,00,000.x.com/EricTrump/stat…", "When’s the raid?? They’ve had months to track this stuff down. Where is the special counsel? Where’s the wall to wall media coverage asking why Biden and Garland have not already been forced to recuse themselves???", "BREAKING: NBC News reports aides to President Joe Biden have discovered at least one additional batch of classified documents in a location separate from the Washington, D.C., office he used after leaving the Obama administration", "If we actually had real journalists instead of activists they’d let you know that average gasoline prices are still about $1.50 higher than when Joe Biden took office & that we are draining our strategic oil reserves weeks before an election to appear like prices are going down!", "Biden: \"I was able to bring gasoline down below a dollar sixty, but it's inching up because of what the Russians and the Saudis just did.\"", "Yeah, it’s the trans community and that’s the victim of all of this. It’s the trans community that was apparently murdered this weekend by a psychopath… it’s definitely not the trans community that is acting as an apologist for this psychotic behavior. \n\nDon’t ever forget that", "KJP: \"Our hearts go out to the trans community, as they are under attack right now.\"", "Wrong, it would pose a threat to the rapidly growing group of violent radical trans extremists and their intentions. \nTrans terrorism is terrorism and people should be able to understand the sickness and depravity of the extremists leading that movement.", "A Nashville lawmaker just said that Audrey Hale’s manifesto will not be fully released…\n\nBecause it “poses too much danger to the public.”\n\nDo you see what they’re doing here?", "“President Trump did more to secure our border than anybody by far…illegal immigration down by 83%, 45-year low.\" - Former Acting Director of ICE @Tom_D_Homan", "TheHamascaucus of the house is really upset that an antisemite was removed from the foreign affairs committee. I’m shocked…but also glad that finally some people did something.", "WATCH: President Trump announces plan for immediate mass firings of \"warmonger\" bureaucrats at the State Department and Pentagon if he's reelected President in 2024.\n\n\"I am the President who delivers peace.\" -@realDonaldTrump", "WATCH: On the latest episode of Triggered,@SeanParnellUSAtells an unbelievable story about almost being killed while serving in Afghanistan. \n\n\"Sir, you got blown the fuck up\"", "Real leadershipExclusive — Trump, Waltz to Meet Afghanistan Withdrawal Gold Star Families at Bedminster"], "diamondandsilk": ["Diamond and Silk were right AGAIN.  Vindicated, Liberated, Exonerated. \n\nMy sister and I told you all in March of 2020 that Something wasn't Right.  Here's more proof that we were Right!\n\nWe were Vilified, Criticized, Humiliated, Ridiculed. Our brand was tarnished and our", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "Diamond and Silk were right AGAIN.  Vindicated, Liberated, Exonerated. \n\nMy sister and I told you all in March of 2020 that Something wasn't Right.  Here's more proof that we were Right!\n\nWe were Vilified, Criticized, Humiliated, Ridiculed. Our brand was tarnished and our", "Diamond and Silk were right AGAIN.  Vindicated, Liberated, Exonerated.   \n\nMy sister and I told you all in March of 2020 that Something wasn't Right.  Here's more proof that We Were Right!  \n\nWe were Vilified, Criticized, Humiliated, Ridiculed. Our brand was tarnished and our", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good."], "spiritofho": ["My wife is on strike! She is one of 7,000+ New York nurses demanding better conditions from Mount Sinai, one of the richest hospitals in the country.\n\nHere a top union leader explains the union's top priority: staffing ratios that protect the safety of nurses and patients alike.", "Kanye: I love Hitler\n\nJenna: Decolonize Palestine\n\nIsraeli media:", "TheWestis just giddy thatIsraelcommitted an act of war on Iran.", "I don’t want to hear Covid this Covid that. I want an explanation for why the mass influx of people like myself who have left the democrats should support RFK Jr given that he is almost more enthusiastic about supportingIsrael’s genocide of Palestine than the establishment.", "The West is just giddy that Israel committed an act of war on Iran.", "I don’t want to hear Covid this Covid that. I want an explanation for why the mass influx of people like myself who have left the democrats should support RFK Jr given that he is almost more enthusiastic about supporting Israel’sgenocideof Palestine than the establishment.", "Free Palestine is trending. This is a reminder that the biggest impediment to Palestine's liberation is the U.S.'s ceaseless funding of Israel's apartheid regime.", "The US is a terrorist state.\n\nIsrael is a terrorist state.\n\nBoth are engaged in LITERAL occupations that receive a fraction Ukraine receives from Western \"cruise missile\" leftists."], "MollyJongFast": ["As an actualjewthis is particularly enraging", "If you’re defending killing people on the subway perhaps it’s time to log off", "One of these candidates was Jewish and the other wasJewish.", "Personally as aJew, I tend to think the people using antisemitic rhetoric are in fact antisemitic", "As an actual jew this is particularly enraging", "I just saw the pile of bodies video and I just want to say republican politicians have made a decision that the American people must live this way. Few other countries live like this.", "If you’re defending killing people on the subway perhaps it’s time to log off", "This interview with Yusef Salaam and@JoyAnnReidis really good."], "FiorellaIsabelM": ["Israelnot only attacked a refugee camp in Jenin but specifically targeted a medical center, claiming they’re targeting “terrorists”. Before you try to both sides this issue, don’t.", "While RFK acknowledgedIsraelhas nuclear weapons he either naively or disingenuously pretends “Israelis not going to use their nuclear weapon unless they’re attacked…”becauseIsraeldoesn’t attack Syria, Iran & Palestine UNPROVOKED on the daily.", "I along with dozens of women in media from all over the world met with President Ebrahim Raisi today. In his speech he said a few things that resonated with me beyond religion, borders and culture:Westerners use the issue of women's rights as a tool to exert pressure on", "Sh*tlibs are out here calling Black men  & minorities anti-Semitic for standing against Zionism while their country funds genocide on Semitic Palestinians & supports Ukrainian Nazis. Please kindly STFU with your hypocrisy.", "While RFK acknowledged Israel has nuclear weapons he either naively or disingenuously pretends “Israel is not going to use their nuclear weapon unless they’re attacked…”because Israel doesn’t attack Syria, Iran & Palestine UNPROVOKED on the daily.", "Israel not only attacked a refugee camp in Jenin but specifically targeted a medical center, claiming they’re targeting “terrorists”. Before you try to both sides this issue, don’t.", "BREAKING Armenia and Azerbaijan have agreed to aceasefirein the Nagorno-Karabakh region, via mediation from Russian peacekeepers", "It’s been 20 years since the death of Rachel Corrie at the hands of US-funded Zionists\n\n20 years since the deceitful US-Led invasion of Iraq\n\n55 years since the US-led Mỹ LaiMassacreThe ICC is a joke & condones war crimes & criminals while Julian Assange is still in Prison"], "aaronjmate": ["Former Israeli PM Naftali Bennet: NATO “decided that it is necessary to continue to smash Putin, and not to negotiate… They broke off the negotiations, and then it seemed to me that they were wrong.”", "The UN says thatIsrael's bombing of Syria's Aleppo airport forced it \"to suspend or divert flights used to transport vital medical supplies such as tetanus vaccines, diabetes medication and blood-transfusion testing equipment.\"", "I try not to invoke my Jewish identity because opinions have value on merits, not ethnicity. But the policing of black celebrities is embarrassing. Also massively hypocritical: US media and Jewish groups are now silent on US backing of openly neo-Nazi Azov Battalion in Ukraine.", "These \"rebels\" were also armed byIsrael, which regularly bombs Syria to help enforce a US blockade. Meanwhile the US occupies 1/3 Syria, stealing its wheat/oil, and imposes sanctions that, as former senior Trump officials brag, have \"crushed\" Syria's economy, causing \"food", "Former Israeli PM Naftali Bennet: NATO “decided that it is necessary to continue to smash Putin, and not to negotiate… They broke off the negotiations, and then it seemed to me that they were wrong.”", "The UN says that Israel's bombing of Syria's Aleppo airport forced it \"to suspend or divert flights used to transport vital medical supplies such as tetanus vaccines, diabetes medication and blood-transfusion testing equipment.\"", "Today is 10th anniversary of the Ghouta chemicalmassacrein Syria. US blamed Syrian gov't, but all evidence points to sectarian death squad rebels. That's why Obama didn't bomb.\n\nThere are Western officials who know more about Ghouta than has been publicly disclosed. Just as the", "These \"rebels\" were also armed by Israel, which regularly bombs Syria to help enforce a US blockade. Meanwhile the US occupies 1/3 Syria, stealing its wheat/oil, and imposes sanctions that, as former senior Trump officials brag, have \"crushed\" Syria's economy, causing \"food"]}