{"ThomasEWoods": ["Maybe the elites will love Alex Berenson now that he's taking this position\n\nOr maybe they'll still hate him. I wonder which", "I can’t vote for Donald Trump under any circumstance; and I can’t leave my ballot blank again, so I will vote Democratic in 2024 if Republicans nominate Trump.\n\nLast week showed how many independents feel like this. If the GOP base can’t see the truth, it will learn the hard way.", "Says the man who thought it was dangerous to be on the beach during COVID, and walked around dressed up as the Grim Reaper\n\nThen when Florida's age-adjusted mortality was better than that of most states, simply said nothing", "Pretty soon it will be illegal to think in Florida.", "Someone like this is incapable of considering the possibility that the whole system is ridiculous, unscientific, and absurd", "The Fed rate hikes are making life harder for banks in TWO ways:causing temporary losses on bonds the banks ownmaking it more expensive for banks to borrow money from depositors\n\nTHE FED MUST REVERSE COURSE NOW AND CUT RATES (in addition to the FDIC stepping in)", "He's worried about a \"superspreader.\" Oddly, we didn't hear from him after no ill effects following the biggest boxing match of all time, or after the reopening of baseball games, or after the Super Bowl. None of this makes him the slightest bit curious", "Not to be a Debbie Downer…but anyone worried about a post-BarbieBoxOffice Covid bump? Or post-Oppie? We’ll probably never know since no one seems to be keeping track of such things anymore. Keep up with your boosters and find a pink N-95 or KN-95 if you can x.com/nytimes/status…", "Poor@GeneSohoForumhas explained this again and again, and they just pretend he's not there\n\n(BTW, if you cannot describe the role of the \"capitalist class,\" you are not entitled to an opinion)", "The dark blue line after 1973 is theft. They stole that money from their workers. But nothing happened, because capitalism legalizes theft from the working class by the capitalist class.", "Poor@GeneSohoForumhas explained this again and again, and they just pretend he's not there\n\n(BTW, if you cannot describe the role of the \"capitalist class,\" you are not entitled to an opinion)", "The dark blue line after 1973 is theft. They stole that money from their workers. But nothing happened, because capitalism legalizes theft from the working class by the capitalist class.", "Thank you for exposing Dave, who \"needed to justify\" his wicked and inexplicable support for Masters \"somehow.\" Strategic disagreements DEFINITELY call for all-out attacks on our best communicators", "Hahahahahaha, here's the one thing that will get even more New Yorkers to leave. Keep it up, moochers", "Remember, folks, it's inevitable and necessary", "They're still pretending this is about people using bad words on the platform.\n\nGood riddance, lizards", "Three of us resigned from Twitter’s Trust & Safety Council today:@eirliani@podesta_lesley and me. Here’s whyhttps://netfamilynews.org/members-of-twitters-trust-safety-council-resign-in-protest-against-elon-musks-safety-messages-to-date…", "Poor Thomas Jefferson, who used the language of states' rights (and of course knew it didn't mean states had \"rights\" in anything other than what related to their relationship with the federal government). He wasn't alive for poorly read twentysomethings to set him straight", "States don't have rights.\n\nIndividuals have rights."], "RealSpikeCohen": ["And while we're on this subject, there's a difference between acknowledging that a celebrity said something foolish, and claiming the celebrity is responsible for violence.\n\nAnyone who's going to do violence because Ye said something about Jews was already going to do violence.", "It is possible to acknowledge good things that came out of horrific movements, without going on to praise those movements, demonize their victims, and deny that the atrocities they committed never happened.", "I have a question: Why are Jews flocking from across the US to move to Florida, if it is comparable to Nazi Germany?\n\nFollowup question: how much of a schmuck do you think one has to be in order to equate a disagreement with Florida state education policy to the holocaust?", "UPDATE:\n\nEricka went out yesterday and fed about 100 people, as she does every Friday.\n\nNot only was she not harassed or threatened by police, they never even drove by.\n\nNow's the time to get the city government to back off for good. Here's how you can help:\n\n1. Go to", "If the Columbia City Council wants to act like a protection racket, I'm going to call them out for it.\n\nLet them know what you think. Here's their contact info:\n\nMAYOR \n\nDaniel J. Rickenmann\nmayor@columbiasc.gov \n\nCOUNCIL MEMBERS\nWill Brennan\nwill.brennan@columbiasc.gov \n\nTina N.", "I'm defending the 82 innocent men, women and children who were murdered by their government. \n\nWhy do you wish death on children who were allegedly raped?", "It is the right thread , why are you defending a pedo vs the feds trying to stop him weirdo, also it was the pedo who murdered those 82 ppl", "Absolutely horrific.\n\nAnd Yahshua's mother, who is a PE teacher at another school in the same district, had sent out a warning to administrators about the heat, telling them not to have any children outside that day.\n\nWhich is probably why he wasn't dressed for PE.", "12-Year-Old Dies After Being FORCED To Run Laps in Extreme HeatYahshua Robinson, was forced to do laps in California’s 90-degree heat after wearing the wrong clothes for gym class.\n\nHe was begging his teacher for water and even told other students he couldn’t breathe", "There would be a lot less antisemitism if the ADL weren't consistently acting like the worst, most stereotypical caricature of Jewish people.", "1/Here's a story that might give some additional background when it comes to the Anti-Defamation League and efforts to address antisemitism and other forms fo bigotry.\n\nWhile most of us despise bigotry, we also understand the importance of free expression.", "This won't be the last murder like this until we end the \"thin blue line\" culture of police lawlessness: \n\n- End immunity for government employees\n- End police unions\n- Criminalize failure of officers to intervene when they see another officer break the law \n\nRest in peace, Tyre.", "Remember Pastor Moses, whose homeless shelter was shut down by his city government?\n\nWell thanks to your support, he's helping the homeless again.", "This man's name is Rasheem Carter. \n\nRasheem sought the government's help after his life was threatened. \n\nGovernment did nothing, and Rasheem was killed and dismembered.", "On this day in 1985, Philadelphia police bombed a residential neighborhood, killing 11 people, including 5 children, and destroying 65 houses and leaving over 250 people homeless.\n\nWhy?\n\nBecause a handful of people were resisting arrest.\n\nPrior to the bombing, Philadelphia police", "On this day 19 years ago, a reasonable man named Marvin Heemeyer was pushed by his local government to do unreasonable things.\n\nRest in peace, Marvin.\n\nHappy Killdozer Day.", "53 years ago, OH National Guardsmen opened fire on unarmed student protestors who were hundreds of feet away, killing 4 and wounding many others.\n\nWhy did they do this?\n\nTo protect the war machine."], "ComicDaveSmith": ["If you don’t supportIsrael, you ain’t black!", "Bernie Sanders is approximately as Jewish as a ham sandwich topped with shrimp on lard bread x.com/Ostrov_A/statu…", "Absolutely not! The ADL represents Jews in the same way that Fortune 500 CEOs represent men. It’s a tiny substratum that in no way represents the entire group.", "To my Jewish followers do you think the ADlL represents you and the Jewish people? \n\nLet's keep this debate civil", "“We didn’t blow up the world and kill the entire human race. Plus everything good is because of us!”\n\nWhat total BS. The reality is Iraq, Afghanistan, Libya, Syria, Somalia, Yemen and many more. That’s your legacy. The blood of millions of innocent people, trillions wasted.", "The \"national security expert class,\" despite its mistakes, has kept nuclear war at bay, defeated a brutal empire in the Cold War, secured a global system of trade and cooperation, and made it possible for comedians to complain about it all while living in peace and freedom. x.com/ComicDaveSmith…", "Massive bombing campaigns and a full blockade of the country. The UN estimated that 500k children died from starvation or malnutrition as a direct result, Madeleine Albright said it was worth it. I think the UN figures were off, but you get the point. Now sit down.", "Are you talking about the no fly zone?\n\nBecause no I’m not aware of what war America engage in with Iraq between 91 and 03\n\nPlease enlighten us Dave", "Never relent. Never forget what these monsters did.", "Clinton prosecuted a massive illegal bombing campaign in Iraq and a sanction regime, including a full blockade that the UN estimated lead to the deaths of 500k children. He also launched a war in Serbia, without UN authority or a declaration of war from Congress in direct", "Can you name some of the \"egregious crimes\" that Obama, Clinton, or Bush committed? What should they be prosecuted for? And by whom? x.com/ComicDaveSmith…", "Biden has had two years to end this war if he wanted to. It’s pathetic that you caved and this is a BS excuse.", "Today, I withdrew from consideration by the U.S. Senate my War Powers Resolution after the Biden administration agreed to continue working with my office on ending the war in Yemen.", "The lesson of WW1, Iraq, Libya and countless other wars, is that toppling a regime can lead to one that’s much worse. So many people demonstrated that they haven’t learned that lesson this morning, even when the regime in question has the largest nuclear arsenal in world history."], "FreemansMind96": [], "HannahDCox": ["BASED\n\nAnd any politician that would send you to war at 18 but ban your ability to defend yourself at home: tar and feather", "Banning gun sales to young American adults under 21 is unconstitutional, judge ruleshttps://9news.com/article/news/nation-world/gun-bans-under-21-unconstitutional/507-13b3d6b0-a2c2-453a-a3f9-d56a61090281?utm_campaign=snd-autopilot…", "Reporters no longer see themselves as a check on power. They see themselves as part of it.\n\nThis week,@mtaibbiperfectly summed up how the free press is no longer functioning.@jackhunter74:https://based-politics.com/2023/06/16/matt-taibbi-free-speech-is-dying-and-journalists-are-killing-it/…", "I live in a heavily Jewish neighborhood in Atlanta and I’m very sorry to report that many synagogues in the area have greatly increased security and are experiencing a spike in bomb threats (among others).\n\nThere are real life consequences to excusing away racism.", "Our government took an attack on our homeland and used it as an excuse to go to war against the American people.", "This will get more innocent people killed.\n\nThis will waste a lot of money.\n\nIn wasting those resources, Florida’s children will be less safe. It’s security theater vs actual prevention and clearance strategies.\n\nThe death penalty is performative:https://youtu.be/owlGyFjjtd0?feature=shared…", "Florida’s law allowing the death penalty for child rapists is now in effect.\n\nThe minimum sentence is life in prison without parole. In Florida, anyone who harms children in such a horrific way will never walk free.", "BASED\n\nAnd any politician that would send you to war at 18 but ban your ability to defend yourself at home: tar and feather", "Banning gun sales to young American adults under 21 is unconstitutional, judge ruleshttps://9news.com/article/news/nation-world/gun-bans-under-21-unconstitutional/507-13b3d6b0-a2c2-453a-a3f9-d56a61090281?utm_campaign=snd-autopilot…", "The 2001 AUMF still exists! It's how the gov keeps endless war going without ever having to take a vote\n\nAnyone not signing on to repeal it does not work for you but for the military industrial complex.@RandPaulto the rescue, yet again.@jackhunter74:https://based-politics.com/2023/06/08/rand-paul-bill-sets-out-to-end-endless-war/…", "No one, of any gender, should ever be forced to fight in any war."], "checkmatestate": ["I hate Trump, so I’m neutral on the January 6th thing.\n\nFrom my perspective, it looks like the J6 committee was willing to unjustly destroy regular people’s lives in order to get Trump.\n\nAm I missing something?", "You can call it “government and private sector engagement” but it’s just government speech regulation and is a blatant violation of the First Amendment.", "First, I’m told that communists are cool because the Soviets ended the Holocaust. Then (in the exact same thread) I’m told that the Soviets aren’t real communist’s because real communists would never do the Holodomor.", "Two things can be true at once:\n\n1. COVID is very real and deadly\n2. The response to it was bonkers\n\nDiamond’s death doesn’t change that.", "I hate Trump, so I’m neutral on the January 6th thing.\n\nFrom my perspective, it looks like the J6 committee was willing to unjustly destroy regular people’s lives in order to get Trump.\n\nAm I missing something?", "You can call it “government and private sector engagement” but it’s just government speech regulation and is a blatant violation of the First Amendment.", "First, I’m told that communists are cool because the Soviets ended the Holocaust. Then (in the exact same thread) I’m told that the Soviets aren’t real communist’s because real communists would never do the Holodomor.", "cut the military budget by however much money they can’t account for in their audit."], "SabbySabs2": ["Every resident inEastPalestine, OH should receive Medicare For All. Libby, Montana, was able to do this due to asbestos. Their property value has also decreased and they've experienced pain and suffering. \nFYI, Norfolk Southern donates to BOTH parties!", "Down With War, War Economy, & War Government. PROTEST THIS SATURDAY IN BOSTON! 1pm ET Park Street Station.", "Israel's right to exist? Here we go again.", "What's your opinion on RFK Jr's statement thatIsraelonly attacks military targets?\n\"It's grotesque.\" -@mikopeled", "Censorship didn't start with Assange. We must also remember Daniel Hale & Mumia Abu Jamal. Where do our representatives stand on Julian Assange & free speech?https://youtu.be/uKEmLuV8bgc", "Every resident in East Palestine, OH should receive Medicare For All. Libby, Montana, was able to do this due to asbestos. Their property value has also decreased and they've experienced pain and suffering. \nFYI, Norfolk Southern donates to BOTH parties!", "Obama wants you to help Libya by donating to HIS foundation. He didn't care about ppl in Libya when he took out their leader & bombed them.PREMIERES AT 5:15PM EThttp://youtu.be/6EA_xU7Fh50", "One of the principles of Justice Democrats is to ABOLISH ICE. Yet today... Cori Bush & Ilhan Omar voted to send $8.42 billion for ICE. Rashida voted present. AOC voted against it She's the \"hero\" this time. Collectively, the squad is useless."], "MsLaToshaBrown": ["Our children can’t even be children. This story really makes me angry.", "A NJ resident called police on a 9-year-old Black girl using a homemade spotted lanternfly repellant to try and stop the invasive species from harming trees in her neighborhood.\n\nThe girl's mother and sister described the ‘traumatic’ experience at a local council meeting.", "For the love of humanity: A Conversation with LaTosha Brownhttps://medium.com/the-promise/for-the-love-of-humanity-a-conversation-with-latosha-brown-b2393ca6c1ef…", "Black women (and millions of others) across the U.S. held prayer calls, organized community actions, reached out to officials, kept pushing the story in the media and MOST importantly we kept believing. Brittney is free!#WeAreBG", "This action is a result of all the folks that have been doing real work for years to get these images removed (not hiding behind empty opinions on Twitter). Thank you for staying in course! Thank you!#WeWontBlackDown", "BREAKING: The U.S military will REMOVE all references to the  Confederacy from buildings and street names and will rename nine military bases named after Confederate generals. Good!", "For the love of humanity: A Conversation with LaTosha Brownhttps://medium.com/the-promise/for-the-love-of-humanity-a-conversation-with-latosha-brown-b2393ca6c1ef…", "Black women (and millions of others) across the U.S. held prayer calls, organized community actions, reached out to officials, kept pushing the story in the media and MOST importantly we kept believing. Brittney is free!#WeAreBG", "Our children can’t even be children. This story really makes me angry.", "A NJ resident called police on a 9-year-old Black girl using a homemade spotted lanternfly repellant to try and stop the invasive species from harming trees in her neighborhood.\n\nThe girl's mother and sister described the ‘traumatic’ experience at a local council meeting.", "My heart goes out to the families of the Jacksonville people killed bc they are Black. While the shooter acted alone I also hold Gov. De Santis accountable as well as ALL those who espouse & exploit the rhetoric of racial division and hatred to advance their own political agenda."], "RonFilipkowski": ["Dershowitz said Trump asked him at dinner why only 27% of Jews voted for him when he strongly supportedIsrael. Dersh said he told Trump Jews also care about gay rights, abortion, climate change, gun control and separation of church and state, and he was terrible on those.", "For every Repub trying to blame the Admin for E. Palestine, I continue to cite Steve Bannon, who again today placed the blame every step of the way on DeWine & Norfolk Southern. Says the RR and DeWine did release & burn of chems because they wanted to clear tracks ASAP to get", "Rep. Troy Nehls is in E. Palestine and assures everyone that the city’s water is safe to drink, then demonstrates it by drinking a cup of tap water from the China Cafe. “The Fire Chief, everybody says the water is clean to drink.”", "Marge discussed the ‘Jewish Space Laser’ controversy with Junior. She says that when she made her post about the Rothschilds controlling a laser in space that may have set the CA forest fires, it wasn’t anti-Semitic because she didn’t know they were Jewish.", "With piles of his dead mercenaries on the ground behind him, the Wagner commander says he is pulling his troops off the line on May 10, blaming the Russian military for failing to supply them with promised ammunition.", "Right-wing “independent journalist” who flew in to Maui (he also went into E. Palestine) after the fire is confronted by angry residents while live on Steve Bannon’s show, who said he is exploiting them for politics and using up precious resources.", "He repeats claim that never gets challenged that he will end the war in 24 hours. He is asked how. He doesn’t answer. We move on to the next question.\n\nBecause that’s really not important.", "For every Repub trying to blame the Admin for E. Palestine, I continue to cite Steve Bannon, who again today placed the blame every step of the way on DeWine & Norfolk Southern. Says the RR and DeWine did release & burn of chems because they wanted to clear tracks ASAP to get"], "KyleKulinski": ["- stayed in Iraq\n- stayed in Afghanistan\n- illegally killed top Iran commander Suleimani (who fought ISIS)\n- tried to coup Venezuela\n- increased drone strikes 400%\n- and his first military action as president is below\n\n(love your comedy, not trying to own you just giving info)", "deflated Jabba@mikepompeois annoyed that a journalist who was chopped into pieces by a theocratic dictator got too much media sympathy", "Why should a genocidal foreign government be allowed to casually buy an entire US industry?", "Force PGA tour commissioner Jay Monahan to sit down with the families of 9/11 victims, lock the door and keep the cameras rolling", "Gavin McInnes & Alex Jones LAUGH about getting@hasanthehununjustly banned from twitch. They admit they’re not actually pro-free speech. Just yesterday Jones was ranting against “authoritarians”, turns out he is onehttps://x.com/SpenglerCreator/status/1601316290073079809/video/1…", "deflated Jabba@mikepompeois annoyed that a journalist who was chopped into pieces by a theocratic dictator got too much media sympathy", "- stayed in Iraq\n- stayed in Afghanistan\n- illegally killed top Iran commander Suleimani (who fought ISIS)\n- tried to coup Venezuela\n- increased drone strikes 400%\n- and his first military action as president is below\n\n(love your comedy, not trying to own you just giving info)", "GOP congressman Hoss Thurston Glorbus: NOTHING IS FREE. PARASITE STUDENTS MUST PAY BACK EVERY PENNY!\n\n*Glorbus had $2.6 trillion PPP loan forgiven"], "funder": ["If you don’t want to be blamed for acts of violence then don’t use violent rhetoric for years.", "\"Our labor unions are not narrow, self-seeking groups. They have raised wages, shortened hours, and provided supplemental benefits. Through collective bargaining and grievance procedures, they have brought justice and democracy to the shop floor.\" JFK#UnionsForAll", "Sick, but true. And sad that some corrupt folks are trying to do this again. Unions can stop it.", "There are few things more anti-American than what these 19 traitors tried to do in Georgia. They all deserve serious prison time. And zero sympathy.", "Here's Marjorie Taylor Greene the day after the Capitol riot saying \"it was a hard thing we did yesterday, but I wouldn't do anything else. I wouldn't do anything else.\" Expel.", "“If you have the guts to send somebody to war, then you better have the guts to take care of them once they get home.” Jon Stewart#RememberYourPACT", "The numbers don’t lie, we have a mass shooting epidemic in this country.\nWe must do everything in our power to stop them from ever happening again.\nStart with banning assault weapons.", "Sick, but true. And sad that some corrupt folks are trying to do this again. Unions can stop it."], "mmpadellan": ["The House just broke out into a chant for Rep Jeffries \"HAKEEM! HAKEEM!\"\n\nOutstanding unity.", "Even Fox News knows that the deregulation by the trump admin were the cause of the disaster inEastPalestine, OH. And Elaine Chao never visited train derailment sites, even when there were fatalities.", "OOPS! Looks like Fox News allowed a bit of truth to slip into their coverage of the train derailment story inEastPalestine, OH — they're blaming trump!!!Be a real shame if everyone retweeted this.", "Notice how there WERE massive protests for the murdered children, people even got expelled from Congress because of it. \n\nPeople with their heads securely wedged into their posteriors may have missed it, though.", "The House just broke out into a chant for Rep Jeffries \"HAKEEM! HAKEEM!\"\n\nOutstanding unity.", "Even Fox News knows that the deregulation by the trump admin were the cause of the disaster in East Palestine, OH. And Elaine Chao never visited train derailment sites, even when there were fatalities.", "Notice how there WERE massive protests for the murdered children, people even got expelled from Congress because of it. \n\nPeople with their heads securely wedged into their posteriors may have missed it, though.", "REMINDER: The country responsible for 9/11 gave Jared Kushner's firm $2 billion dollars.\n\nEvery American should be FURIOUS about that.\n\nNot just today, EVERY day."], "krystalball": ["CNN had a literal lobbyist for Norfolk Southern on their panel to talk aboutEastPalestine and didn't disclose it.", "A provision in Obamacare allows residents in areas deemed a public health disaster to be covered by Medicare for life. At the very least,EastPalestine residents deserve this universal coverage after being exposed to a known carcinogen.", "Whatever you think of the SVB bailout, I want you to really sit with the fact that rich VC’s just got an Insta bailout while the people ofEastPalestine can’t even get a straight answer as to whether their kids have been poisoned.", "Great work on this@heyjohnrussell. Thanks to @moreperfectunion for giving him this platform and not forgetting aboutEastPalestine!", "NEW: We went down to East Palestine for a week to get residents’ side of the story after the Ohio rail disaster.\n\nPeople told us they’re getting sick and their pets are dying, while Norfolk Southern is trying to cover it up.@heyjohnrussellreports.", "CNN had a literal lobbyist for Norfolk Southern on their panel to talk about East Palestine and didn't disclose it.", "A provision in Obamacare allows residents in areas deemed a public health disaster to be covered by Medicare for life. At the very least, East Palestine residents deserve this universal coverage after being exposed to a known carcinogen.", "Whatever you think of the SVB bailout, I want you to really sit with the fact that rich VC’s just got an Insta bailout while the people of East Palestine can’t even get a straight answer as to whether their kids have been poisoned.", "Kicking@IlhanMNoff of the Foreign Affairs committee is a genuine loss. She’s one of the most courageous critics of US foreign policy failures and hypocrisy."], "SteveSchmidtSES": ["A direct threat against American Jews by a disgraced and addled former President of the United States in 2022.", "Today, I visited the oldest synagogue in continuous use in the Western Hemisphere. The firstJewprayed here in 1732, the year that George Washington was born. Today, McCarthy met with antisemite Paul Gosar. What do you call someone who seeks power with the aid of antisemites?”", "\"There is no deal between the United States, Bibi Netanyahu’s extremist and anti-democratic coalition and MBS that should ever be ratified by the United States Senate. Ever.\"\n\nMore on why the United States of America should never sign a mutual defense pact with the Saudi regime:", "“How many decades of bearing witness and remembrance were wiped out in a nanosecond as KanyeWestmainstreamedJewhatred on a foundation of centuries’ old conspiracies?”https://open.substack.com/pub/steveschmidt/p/kanye-west-and-donald-trump-are-antisemites?r=1p7ttn&utm_medium=ios&utm_campaign=post…", "\"Let’s remember the police and firefighters who ran into the buildings and died, so thousands could live. Let’s remember the thousands of American and Allied soldiers who fought, were wounded and died on faraway battlefields avenging the barbarism that attacked us.\"\n\nLet's", "\"We live in a cynical time in which there is so much evil operating in plain sight all over the world. Yet, after 78 years of having the power to destroy the planet, mankind has not pulled the trigger.\"\n\n'Oppenheimer' should remind us that it matters very much who we elect to", "\"There is no deal between the United States, BibiNetanyahu’s extremist and anti-democratic coalition and MBS that should ever be ratified by the United States Senate. Ever.\"\n\nMore on why the United States of America should never sign a mutual defense pact with the Saudi regime:", "“The early morning hours of January 7 marked the rise of a new American leader: Hakeem Jeffries. The thunderclap was the magnificence of his voice rising in defense of the American creed & his taking his place in a long line of liberty’s defenders.”https://open.substack.com/pub/steveschmidt/p/minority-leader-hakeem-jeffries-a?r=2ibrr&utm_medium=ios&utm_campaign=post…"], "robreiner": ["KanyeWestis a mentally ill anti-semite. Tommy Tuberville is a racist. Herschel Walker is a moronic liar. Donald Trump is a Fascist Criminal. Welcome to today’s Republican Party.", "What does it tell you when Police Officers who are being given Congress’ highest honor for saving the lives of Senators and Representatives refuse to shake the hands of the Republican leaders? It tells you all you need to know.", "Now that Adidas has cut ties with KanyeWest, it’s time for America to cut ties with the anti-Semitic White Christian Nationalist GOP. VOTE BLUE!", "In less than 10 days we’re going to decide whether we want to remain in the hands of people who respect our Democracy or give it up to people who will literally kill to get their way. The stakes could not be higher. Vote for Democracy. VOTE BLUE!", "What does it tell you when Police Officers who are being given Congress’ highest honor for saving the lives of Senators and Representatives refuse to shake the hands of the Republican leaders? It tells you all you need to know.", "A huge shout out to Nicole Wallace. She is focused like a laser on the biggest domestic crime perpetrated on America in modern history: A Violent Attack to Overthrow our Government. To save our Democracy, the DOJ must hold Donald Trump accountable and Indict!", "Americans and the press are notorious for their short attention spans. They must never forget that on Jan.6, 2021, Donald Trump led a deadly Insurrection to overthrow the United States Government and must be held accountable.", "We’re living in Alice in Wonderland. People involved in attempting to overthrow the government are now members of the Homeland Security Committee. Merrick Garland, WTF are you doing?"], "marceelias": [], "DavidAFrench": ["As I left Kyiv this evening, there was one final, poignant image from my week in this extraordinary city--a line of ambulances carrying wounded men from the front. It was a potent reminder of the horrific toll of Russia's aggression and the courage of the people who confront it.", "What's happening right now in Athens Georgia is a violation of the Geneva Convention.", "Let's not pretend that what's happening here is some sort of thoughtful ideological critique of the ADL. There's a tsunami of raw, unfiltered anti-Semitism on this platform. Decent people, right and left, should respond accordingly. There are competitors to this site.", "\"That sound you hear is 40 million right-wing evangelical fingers going into 40 million right-wing evangelical ears and 20 million grimly pious mouths chanting, 'Nah! Nah! I can’t hear you!' Kevin Williamson, telling it like it is:", "Remembering:\n\nMAJ Andrew Olmsted, CPT Thomas Casey, SGT Corey Spates, CPT Torre Mallard, SGT Phillip Anderson, SPC Donald Burkett, Mr. Albert Haroutounian, SGT Gregory Unruh, SPC Matthew Morris, CPT Ulises Burgos-Cruz, SPC Andre Mitchell, and CPT Michael Medders.\n\nRest in Peace.", "As I left Kyiv this evening, there was one final, poignant image from my week in this extraordinary city--a line of ambulances carrying wounded men from the front. It was a potent reminder of the horrific toll of Russia's aggression and the courage of the people who confront it.", "What's happening right now in Athens Georgia is a violation of the Geneva Convention.", "Horrifying. It makes me feel sick just reading it.", "Abortion is the deliberate taking of a human life. Here’s how an abortionist describes it."], "BillOReilly": ["Putin is finished. Please read the Message of the Day onhttp://BillOReilly.com.", "If you shop in thehttp://BillOReilly.comChristmas/Hanukkah store, I get extra treats!  So let's get on it, people!", "The decline of religion in America continues.  Please read the Message of the Day onhttp://BillOReilly.com.", "On this day forty-two years ago, John Lennon was shot outside his NYC apartment. Learn more about Lennon’s decline before the end of his life in KILLING THE LEGENDS—on sale now.https://bit.ly/Order-KillingTheLegends…", "Putin is finished. Please read the Message of the Day onhttp://BillOReilly.com.", "Durham report finally out.  Bad news for the FBI.  Please read the Message of the Day onhttp://BillOReilly.com.", "Mitt Romney hangs it up.  Good guy or bad guy?  Please read the Message of the Day onhttp://BillOReilly.com.", "\"Killing the Witches\" frightened the Terror Dog so I have to console her.  Two dogs were actually executed in Salem!  Book out September 26. Preorders get it first."], "jimmy_dore": ["Whats the Bible verse for \" I killed a million Iraqi's & got away with it \" ?", "Videos like this make me forget he helped crush the railroad workers right to organize & strike, then abandoned the people ofEastPalestine while downplaying the disaster. Great video!", "American aviation is the safest in the world because we never take it for granted and we always keep working to improve it for the future.", "I wonder when people will just stop listening to bullshit & take control of their own country. Corporations have you breathing poison while they gaslight & lie just like the politicians they own\n\nEPA administrator asks residents to 'trust the government'", "America invaded Syria & is currently occupying 1/3 of the country-the part with the Oil & Wheat. \n\nThe U.S. is the worlds terrorists not Russia & not China. We are ruled by psychopaths who are terrorizing the world while starting TWO ECONOMIC WARS w/Nuclear powers Americans cheer", "US General Mark Milley illegally visited Syria where US troops are illegally stationed and ensured them that stealing Syria's oil and wheat on a regular basis is necessary to keep the US safe.", "Videos like this make me forget he helped crush the railroad workers right to organize & strike, then abandoned the people of East Palestine while downplaying the disaster. Great video!", "American aviation is the safest in the world because we never take it for granted and we always keep working to improve it for the future.", "HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA#ForceTheVote", "We’re off the air right now because the power went out in LA, as it does all the time. Eric Garcetti is the worst mayor of all time. He hasn’t bothered to do his job in years. The Democrats running LA are the most incompetent people on the planet.", "The U.S. is doing what it always does, terrorize the world for corporate profits. \n\nHere Seymour Hersh explains EXACTLY how the United States blew up The Nord Stream pipeline so US companies could sell more Natural Gas to Europe.  \n\nWe're The Terrorists.https://seymourhersh.substack.com/p/how-america-took-out-the-nord-stream…", "Anyone willing tools on this site defending War Pigs & Strike Breakers today can get fucked.", "Any Dorecels on this site pushing \"Fraud Squad\" shit today (or ever) can get fucked."], "TheRickWilson": ["Stop asking if 1930s Germany can happen here.\n\nIt's happening here.", "So...the decision to shoot down the thing was done on Weds. We monitored it, jammed its sensors, and gained intel on its capabilities, waited until it was out range where a crash could cause civilian harm, shot it down, and this is what is causing a million MAGAs to lose it.", "If you give a damn about freedom — not just press freedom, but freedom qua freedom — this story should enrage you. Outrageous at every level.\n\nThe abuse of state power like this is a warning sign.", "Statement by PEN America's@Shan_Jan: \"Sweeping raid on The Marion County Record... almost certainly violates federal law... Such egregious attempts to interfere with news reporting cannot go unchecked in a democracy.\"https://pen.org/press-release/pen-america-police-raid-on-kansas-newspaper-almost-certainly-violates-federal-law/…", "Kanye going to war on the Jews. \n\nJust last week's star guest on the Tucker Carlson White Grievance Hour having a normal one.", "Stop asking if 1930s Germany can happen here.\n\nIt's happening here.", "So...the decision to shoot down the thing was done on Weds. We monitored it, jammed its sensors, and gained intel on its capabilities, waited until it was out range where a crash could cause civilian harm, shot it down, and this is what is causing a million MAGAs to lose it.", "I know a few people in Israel right now wondering something.\n\nI'll just say this: WE FUCKING WARNED YOU.", "After all, it's just a regional territorial dispute.", "I don't understand why Putin just won't cede territory to the Wagner Republic. Shouldn't he just give peace a chance?"], "davidsirota": ["Corporate media has been lying about theEastPalestine disaster by pretending Trump is the only perpetrator of rail deregulation.\n\nThe actual truth: The Obama, Trump and Biden administrations all played pivotal roles in that dereg.", "Imagine if wealthy investors had spoken out as forcefully for rail regulation as they spoke out for special depositor insurance.\n\nImagine if the government responded as quickly & forcefully to helpEastPalestine residents as it responded to help rich VCs.", "6 months ago, Donald Trump did a photo op inEastPalestine & then demanded Congress pass a rail safety bill.\n\nThen the company that made the toxic chemical in the disaster gave $2 million to Trump's party & his party's lawmakers are now blocking the bill.", "NEWS: The maker of the toxic chemicals in theEastPalestine derailment gave $2 MILLION to the Senate GOP super PAC as Republicans weakened & stalled rail safety legislation. \n\nThe chemical industry’s lobby group also gave $250K to House GOP’s super PAC.", "Corporate media has been lying about the East Palestine disaster by pretending Trump is the only perpetrator of rail deregulation.\n\nThe actual truth: The Obama, Trump and Biden administrations all played pivotal roles in that dereg.", "This video tells the 3-part truth corporate media won’t admit but@LeverNewsreported: \n\n1. Obama exempted the Ohio train from hazmat safety rules\n\n2. Trump repealed the remaining brake rule that Obama weakened \n\n3.@SecretaryPeterefused to fix the rules", "Literally everyone in Congress in February: “We must pass rail safety legislation.”\n\nSix months later, after $2 million was funneled to the GOP from the maker of the toxic chemical that exploded in East Palestine", "NEWS: The maker of the toxic chemicals in the East Palestine derailment gave $2 MILLION to the Senate GOP super PAC as Republicans weakened & stalled rail safety legislation. \n\nThe chemical industry’s lobby group also gave $250K to House GOP’s super PAC."], "gtconway3d": ["“Nice religion you have here.  It would be a shame if something happened to it.”", "okay I’ve investigated this controversy on X for a full five minutes on Google via my iPhone and am now an expert on the subject for all intents and purposes on X\n\nI conclude that, although this was not known at the time, and it took thousands of years for mankind to figure out,", "this mass persecution of tourists must stop", "The U.S. Attorney for the District of Columbia says more than 1,069 defendants have been charged in connection with the Jan. 6 , 2021, Capitol siege and 594 have pleaded guilty. 98 people have gone to trial.", "Here it is.  It’s just stunning to see the parallels among the different incidents.  Damning doesn’t begin to describe it.", "THREAD: Here is a list of all the 22 women who have credibly accused Trump of rape and sexual misconduct. Please Retweet. \n\n1. Jill Harth says she was groped and kissed in a bedroom at Mar-A-Lago.https://theguardian.com/us-news/2016/jul/20/donald-trump-sexual-assault-allegations-jill-harth-interview…", "Here it is.  It’s just stunning to see the parallels among the different incidents.  Damning doesn’t begin to describe it.", "THREAD: Here is a list of all the 22 women who have credibly accused Trump of rape and sexual misconduct. Please Retweet. \n\n1. Jill Harth says she was groped and kissed in a bedroom at Mar-A-Lago.https://theguardian.com/us-news/2016/jul/20/donald-trump-sexual-assault-allegations-jill-harth-interview…", "I gotta say, Habba is not just in Rule 11/Section 1927 territory, she’s in Order to Show Cause/11/1927 land.  If I were a federal district judge and someone did this in a case before me I’d issue an OSC tomorrow.  Incredible.", "Indeed, the decision is a major coup for justice.", "BREAKING NEWS: The federal court’s denial just now (Friday 9/8 at 6 pm) of Mark Meadows’ effort to remove the Georgia prosecution from state court is a massive victory for the rule of law. And it’s a huge defeat for Trump’s hopes to evade Georgia justice.", "This unprovoked frigid aggression must not be allowed to stand", "Canada has formally declared war on the United States"], "spann": ["I-65 south of Verbena… video from Hayley Bowden", "More photos out of Selma… from Marissa Giles", "Kelvin Helmholtz wave clouds over Gulf Shores yesterday… Photos from Anna Cleckler", "This was taken at White City, north of Prattville in Autauga County yesterday by Jessica Lawley. This is where six people were killed, between U.S. 82 and I-65.", "Another look at the tornado moving through northern Autauga County yesterday… Where six people were killed. Video from Blaike Patterson.", "Impressive mammatus display over Arab earlier this afternoon… video from Dawn Sparks", "A short video of the helicopter crash in Harvest (north of Huntsville) from Savanna Terry", "This was taken at White City, north of Prattville in Autauga County yesterday by Jessica Lawley. This is where six people were killed, between U.S. 82 and I-65."], "Jaybefaunt": ["What right does thewesthave to say anything? Their credibility is shot. The US has has been a major hypocrite for hundreds of years.", "I'm sorry but the Democrats you voted for are the reason for the Crime Bill... The Dems You voted for are the reason for the funding for more cops... The Dems you voted for are funding the Palestinian genocide.\nThe GOP doesn't care and funded it, too. None of them care.", "Y'all cry about \"illegals\" (refugees) and yet you allow George W Bush to roam the streets?! A mass murderer?! WTF is wrong with you?", "Watch them bail thisbankout and actually do what a \"progressive\" asks. This says more about the Dems and Ro Khanna. They will bail out thisbankbut not the people in Jackson, MS; Flint, MI orEastPalestine, OH and they expect us to support them?! The duopoly is a waste!", "What right does the west have to say anything? Their credibility is shot. The US has has been a major hypocrite for hundreds of years.", "\"Only a fool lets somebody else tell him who his enemy is\"-Assata Shakur#AssataShakur", "Hey@MarkHamillif you listened to more of the anti-war voices then you would know to not take sides in this proxy war pushed by Raytheon, Northrop Grumman, Lockheed Martin, Boeing, etc. Also, NAZIS are bad. \nPlease research first.", "I'm sorry but the Democrats you voted for are the reason for the Crime Bill... The Dems You voted for are the reason for the funding for more cops... The Dems you voted for are funding the Palestiniangenocide.\nThe GOP doesn't care and funded it, too. None of them care."], "ProudSocialist": ["Jimmy Dore calling out@RobertKennedyJron his refusal to stand up toIsrael:\n\n“Why is it that you can stand up to the military industrial complex, you can stand up to Big Pharma, you can stand up to your own party, but you can't stand up toIsrael?\"", "The U.S. government & both of its corrupt political parties love to lecture about how free our country is but there is nothing free about this country when it’s arresting journalists for reporting the truth about the chemical disaster in Ohio.#EvanLambert", "Yesterday security officers at the@FairmontMiramarattacked workers who are exercising their right to strike. Also notice how police watched & allowed it to happen—which is not surprising as police will always side with capital over labor.@UNITEHERE11", "Americans are propagandized to think war is necessary to “protect our freedom” but that is bullshit. Our government & its imperialist parties don’t fund war to keep us free. They fund war to keep us beholden to the system that makes them & their donors rich at humanity’s expense.", "If you think Trump is the only criminal to ever occupy the Oval Office then you’re not paying attention. These three presidents along with Biden have gotten away with war crimes and should all be indicted by the Hague (@IntlCrimCourt).", "Democrats and Republicans are both evil pieces of sh*t, but what makes Democrats more dangerous is they are cast as the “good guys” by the mainstream media and even awarded Nobel Peace prizes as they are killing innocent civilians with drone strikes. STOP VOTING FOR THE DUOPOLY.", "Over half of the $1.7 Trillion Omnibus bill is for “defense.” It begs the question who is the U.S. defending itself against? The answer is no one because the U.S. is the aggressor and is spending nearly a trillion dollars a year to wage wars abroad & maintain its global hegemony.", "There are 93 people (and counting) dead and Lahaina residents cannot even grieve the loss of their loved ones without worrying about big land developers coming in and taking over their Maui town. There is nothing more evil on this earth than Western capitalism and imperialism."], "BernardKerik": ["#NeverForget#NeverForgiveNo plea deals for 9/11 terrorists!", "Yes, I STAND WITH RUDY, the former Associate Attorney, General of the United States, the former US Attorney, for the Southern District of New York. America’s Mayor, that reduced violent crime by 65%, and murder by 70% in the largest city in the United States, an unparalleled", "12 years ago today, 24 US Navy SEALS paid retribution to the scum responsible for the most deadly terror attack in world history. \n\nWe, especially those of us that we’re in New York City on that day, owe, them a debt of gratitude.#GODBLESSAMERICA#USA", "Trump Deserves A Peace Prize For The Abraham Accords", "As U.S. prosecutors consider plea deals for Khalid Sheikh Mohammed and other suspects in the 9/11 terror attacks,@JoeBidenabandons NYC, Shanksville, and the Pentagon, traveling to Alaska.\n\nIt is a slap in the face to every surviving 9/11 family member and first responder.", "#NeverForget#NeverForgiveNo plea deals for 9/11 terrorists!", "12 years ago today, 24 US Navy SEALS paid retribution to the scum responsible for the most deadly terror attack in world history. \n\nWe, especially those of us that we’re in New York City on that day, owe, them a debt of gratitude.#GODBLESSAMERICA#USA", "Trump Deserves A Peace Prize For The Abraham Accords", "As U.S. prosecutors consider plea deals for Khalid SheikhMohammedand other suspects in the 9/11 terror attacks,@JoeBidenabandons NYC, Shanksville, and the Pentagon, traveling to Alaska.\n\nIt is a slap in the face to every surviving 9/11 family member and first responder."], "jeff_poor": ["Inbox:@ALGOPSteering Committee Votes No Confidence on Leadership of RNC Chair Ronna McDaniel#alpolitics", "Today on The@JeffPoorShowon Mobile, AL's@fmtalk1065(times CT):\n\n9:30 am\n\nState Rep. Jennifer Fidler\n\n10:30 am@WVNN's@TheDaleJackson11:30 am\n\nU.S.@RepJerryCarlhttp://FMTalk1065.com#alpolitics", "Inbox:@ALGOPSteering Committee Votes No Confidence on Leadership of RNC Chair Ronna McDaniel#alpolitics", "Today on The@JeffPoorShowon Mobile, AL's@fmtalk1065(times CT):\n\n9:30 am\n\nState Rep. Jennifer Fidler\n\n10:30 am@WVNN's@TheDaleJackson11:30 am\n\nU.S.@RepJerryCarlhttp://FMTalk1065.com#alpolitics"], "TomFitton": ["Hakeem Jeffries needs to come clean on his support for a notorious antisemite", "Khalid Sheik Mohammed, \"the principal architect of the 9/11 attacks,\" still hasn't faced \"trial\" after 19 years and remains in custody at GITMO. The organized left, advocates for terrorists, and Supreme Court judicial activism have made a mockery of justice in this area of law.", "Atlanta Mayor Says the Quiet Part Out Loud About Saturday's Leftist Terrorism in the City. “So make no mistake about it, these individuals meant harm to people and to property,”", "The communist movement pushes anti-American lie that America is fundamentally racist and was founded as such.  By doing so, they seek to delegitimize our country's institutions to justify their revolution and destruction of our nation.  They've been running a similar campaign for", "Bush admin allowed 9/11-connected terrorist to speak at Pentagon!https://judicialwatch.org/judicial-watch-declassified-documents-reveal-fbi-warning-identifying-anwar-al-aulaqi-as-a-terrorist-day-before-he-spoke-at-pentagon-luncheon/…https://judicialwatch.org/uncovered-docs-indicate-fbi-knew-u-s-born-terrorist-anwar-al-aulaqi-purchased-airline-tickets-for-911-hijackers-when-he-dined-at-the-pentagon/…", "They had military assets ready to go to#Benghazito save lives. But Clinton/Obama FAILED to act!", "'Squad' Democrat Ilhan Omar's World Cup trip funded byHamas-tied Qatar", "OUTRAGE! On 9/11 of all days, Biden administration gives Iran's terrorist regime \"waiver\" to get $6 billion in funds in exchange for release of 5 US prisoners held hostage by the terror regime. Biden will also release 5 Iranian prisoners from US custody."], "brad_polumbo": ["“There are other cultures with different values that should be equally respected.” \n\nNo. \n\nIf your culture’s values include executing gay people, fuck your culture and your values. Not worthy of an iota of respect.", "As a Qatari I’m proud of what happened. \nI don’t know when will the westerners realize that their values aren’t universal. There are other cultures with different values that should be equally respected.\n\nLet’s not forget that the West is not the spokesperson for humanity. x.com/GrantWahl/stat…", "Have you ever thought about the fact that the US government spent $2.313 trillion, more than 6,000 American lives, and 20 years in Afghanistan just to replace the Taliban with… the Taliban?", "Any time you hear someone cite the \"fire in a crowded theater\" talking point that's a tell they aren't very familiar with the First Amendment.", "You have a right to protest. \n\nYou do NOT have the right to block traffic. \n\nAt that point you’re infringing on other peoples’ rights and you should be arrested. \n\nSorry not sorry", "Have you ever thought about the fact that the US government spent $2.313 trillion, more than 6,000 American lives, and 20 years in Afghanistan just to replace the Taliban with… the Taliban?", "It's absolutely horrific & hateful for you to suggest that this is somehow related to them being gay. Child abusers exist among all people. You would NEVER talk about a similarly horrific story with straight parents b/c u wouldn't notice it & if you did you wouldn't generalize.", "I would never let a man who is not a blood relative babysit my kids. Most parents wouldn't. And yet we let male couples adopt children and then act surprised when this happens. \n\nIt's not surprising. Horrific, infuriating, gut-wrenchingly disgusting and evil. But not surprising. x.com/gatewaypundit/…", "Sorry not sorry: as soon as you start killing people I don’t care about “respecting” your pronouns.", "When they say they want to ban hate speech, what they really mean is they want to ban the speech they hate."], "IngrahamAngle": ["Harmeet laid out the possible legal options for the residents ofEastPalestine, OH, who were sickened due to possible negligence of Norfolk Southern and gov’t officials.", "Covenant school shooter went on a 'murderous volcanic rage': John Kelly", "Angle:EastPalestine residents are still begging for answers while being forced to live in a cloud of uncertainty and fear.", "A reading from tonight’s Seder that speaks to current day.  Happy Passover!", "Harmeet laid out the possible legal options for the residents of East Palestine, OH, who were sickened due to possible negligence of Norfolk Southern and gov’t officials.", "Covenant school shooter went on a 'murderous volcanic rage': John Kelly", "Former DNI John Ratcliffe: All Republicans agree that this is an unnecessary war.", "Sheriff Dannels on border crisis: This is a complete inhumane act by Washington, D.C... intellectual avoidance and banishment with intended consequences."], "seanhannity": ["It'sEastPalestine, Ohio all over again...", "“We are no longer confident we killed a senior AQ official...”", "MISERABLE MAYOR PETE! Buttigieg Finally Makes Way toEastPalestine, Ducks Reporters", "THREE-PETE: Buttigieg to FINALLY VisitEastPalestine, Three Weeks After Derailment", "Hannity Grills Ramaswamy Denying He Said Aid to Israel Would Stop in 2028: ‘You Want Me to Read It?’", "War on drugs: Agents seized enough to kill U.S. population 19 times", "OMAR OUT! House Votes Controversial Rep off Foreign Affairs Cmte.https://trib.al/EpLFOsU", "“We are no longer confident we killed a senior AQ official...”"], "charliekirk11": ["MUST WATCH: Senator JD Vance visits a creek flowing near theEastPalestine train derailment and chemical burn. See what happens when he drags a stick along the creek bed.", "BREAKING: Tafari Campbell, the man found dead near the Obama's Martha's Vineyard mansion was their sous chef in the White House and went on to work work for the Obamas when they left office.", "Joy Behar says the residents ofEastPalestine got what they deserved because they voted for Trump. \n\nFor the record, this is 1000x worse than anything Don Lemon said. Will she be kicked off her show and forced to undergo sensitivy training?", "EastPalestine, Ohio’s latest tourism video. Everything is fine!", "MUST WATCH: Senator JD Vance visits a creek flowing near the East Palestine train derailment and chemical burn. See what happens when he drags a stick along the creek bed.", "Joy Behar says the residents of East Palestine got what they deserved because they voted for Trump. \n\nFor the record, this is 1000x worse than anything Don Lemon said. Will she be kicked off her show and forced to undergo sensitivy training?", "An East Palestine woman's chickens all die following the controlled burn and train derailment. \n\nWhat's going on?", "114 Dead, 1,000 more missing in Maui fires — Falls Asleep \n\n13 Marines killed in failed Afghanistan withdrawal — Checks Watch"], "TuckerCarlson": ["If the First Amendment means anything, it means that what's happening to Douglass Mackey is an outrage. It should end immediately.", "Abortion has gone from being tolerated to celebrated. What kind of sick people would tell you that killing your baby is a pathway to joy?", "We grilled the GOP candidates at the Iowa summit and then traveled to Florida for a big speech at Turning Point USA.\n\nWatch this video of the speech to see how the candidates performed, what’s happening in America and more. \nSPOILER: We even cover the 8 ball of cocaine found in", "The President of the United States is personally visiting a corrupt foreign country to announce a half billion dollars in new spending. Meanwhile you have a mushroom cloud overEastPalestine, Ohio; the animals are dying and the water is glowing.", "Ep. 25  Liberals like Karl Rove just tried to annihilate Texas Attorney General Ken Paxton. It didn't work. Paxton just joined us for his first interview since his acquittal.", "Ep. 18  Into the abyss: Colonel Douglas Macgregor tells us why the Ukraine war must end now.", "The President of the United States is personally visiting a corrupt foreign country to announce a half billion dollars in new spending. Meanwhile you have a mushroom cloud over East Palestine, Ohio; the animals are dying and the water is glowing.", "We grilled the GOP candidates at the Iowa summit and then traveled to Florida for a big speech at Turning Point USA.\n\nWatch this video of the speech to see how the candidates performed, what’s happening in America and more. \nSPOILER: We even cover the 8 ball of cocaine found in"], "AnnCoulter": ["You want a \"territorial dispute\"?  How about the one that kills 100,000 Americans a year?\n\nElites:  Who cares!  Ukraine! Crimea! Iran! Taiwan! Syria! Afghanistan! South Korea! \n\nFULL VIDEO:https://anncoulter.substack.com/p/mickey-and-me-on-the-disappearing…", "Daniel Penny protected every person in that subway car. So now he’s got to pay.\n\nMy new Spectator column here -https://thespectator.com/topic/daniel-penny-mistake-resist-mayhem-jordan-neely-new-york/…", "December 7, 1941. Japanese sneak attack on Pearl Harbor kills 2,403, including 1,177 aboard the USS Arizona.  Never forget the bravery and the sacrifice, 81 years ago today.", "Harlem residents can thank George Soros and Alvin Bragg for this.", "You want a \"territorial dispute\"?  How about the one that kills 100,000 Americans a year?\n\nElites:  Who cares!  Ukraine! Crimea! Iran! Taiwan! Syria! Afghanistan! South Korea! \n\nFULL VIDEO:https://anncoulter.substack.com/p/mickey-and-me-on-the-disappearing…", "December 7, 1941. Japanese sneak attack on Pearl Harbor kills 2,403, including 1,177 aboard the USS Arizona.  Never forget the bravery and the sacrifice, 81 years ago today.", "Harlem residents can thank George Soros and Alvin Bragg for this.", "Somali culture nights are usually so peaceful."], "EricTrump": ["Congratulations Trump Chicago! We just took 1st place for all hotels in the Midwest United States, achieved the highest Forbes score of any hotel in Chicago & were awarded #1 \"Most Unique Hotel in the U.S.\" byhttp://Travel.com. Proud of my team!@TrumpChicago@TrumpHotels", "This is the corruption my father and our family is fighting in New York! The system is weaponized, broken and disgusting", "These homes are about 1/30 the size of Mar-a-Lago, not on the beach (let alone the beach and intercostal), don’t span from once side of the Palm Beach Island to the other… it is a travesty of justice and an embarrassment to the court.", "In an attempt to destroy my father and kick him out of New York, a Judge just ruled that Mar-a-Lago, in Palm Beach Florida, is only worth approximate “$18 Million dollars”… Mar-a-Lago is speculated to be worth we’ll over a billion dollars making it arguably the most valuable", "As we speak, my father is being deposed by this corrupt Attorney General. This is what the weaponization of the legal system looks like…", "This is the counterpart to Alvin Bragg - New York Attorney General Letitia James who is also going after my father and our  entire family.@Jim_Jordan", "Unfortunately, this is what American weakness looks like. These games, this nonsense and the utter disrespect would NEVER have happened under Trump. So embarrassing to see.#MAGA2024", "Remember, these statements, from the Attorney General, are “inadmissible” in New York. Does this feel like a fair application of the law?"], "LaraLeaTrump": ["1 mile run, 100 pull ups200 pushups300 air squatsand a 1 mile run...with a\nweighted vest (for most of it) = a \"Murph\" and is\ndone in honor of Navy SEAL and Medal of Honor recipient, Michael Murphy, who was killed in action in 2005 serving our country in", "When they'll only say \"goodnight\" to Grandpa#ChoppedLiverOverHere", "Nothing better in the whole world than COUSINS!!! Mazel tov, Arabella! We love you!", "Had an absolute blast at the@TPUSA#YWLSspeaking to 2,000+ young women who are passionate about our country and standing up for their values. Way to go, ladies!", "1 mile run, 100 pull ups200 pushups300 air squatsand a 1 mile run...with a\nweighted vest (for most of it) = a \"Murph\" and is\ndone in honor of Navy SEAL and Medal of Honor recipient, Michael Murphy, who was killed in action in 2005 serving our country in", "Good morning and HAPPY EASTER!#HelsRisen", "When they'll only say \"goodnight\" to Grandpa#ChoppedLiverOverHere", "Nothing better in the whole world than COUSINS!!! Mazel tov, Arabella! We love you!"], "PatTheSocialist": ["A government that doesn't even try to protect the public in a plague should not exist. We can't vote our way out of this mess.", "The press ignoring one of the worst disasters in US history, is really fucking telling. We need to end capitalism.", "The Sunday shows didn’t even mention the unfolding disaster in Ohio.\n\nMSNBC, CNN & other news stations have refused to covered the political backstory.\n\nBiden &@SecretaryPete— the chief regulator of railroads! — havent even mentioned it.\n\nTotally insane.", "The man literally forced a union to end a strike and is out here blatantly lying to the whole world.", "I make no apologies for being the most pro-union president in American history.", "LMAO. Trump gave notice a week ago that he was going toEastPalestine and Dems were still too stupid to beat him to the punch.", "#BREAKING: Former President Donald has arrived in East Palestine.#EastPalestine|#OhioFormer President Donald has just arrived in East Palestine as crowds of people cheer and chant tump As@sav_says_asked Donald Trump  “What's your message to", "\"bUt wHat CoNceSsiOns?\" scream the Dem apologists. Either he's ousted and the FTV folks win, or they get concessions and win. Some of you pea brains have absolutely no ability to use logic.", "CANDIDATE BIDEN: promised to makeMohammedbin Salman a pariah.\n\nPRESIDENT BIDEN:\nfist bumped him and granted him immunity.\n\nNothing Biden says matters.", "The press ignoring one of the worst disasters in US history, is really fucking telling. We need to end capitalism.", "The Sunday shows didn’t even mention the unfolding disaster in Ohio.\n\nMSNBC, CNN & other news stations have refused to covered the political backstory.\n\nBiden &@SecretaryPete— the chief regulator of railroads! — havent even mentioned it.\n\nTotally insane.", "Scumbags poisoning the planet deserve no peace.", "BREAKING: Dozens of people infiltrated Shell's annual meeting today to protest the company's lies about climate. Great example of the power of disruptive activism.#ShutDownShell"], "TristanSnell": ["Fox News just threw Trump under the bus (or in this case, train) — pinning him with responsibility for theEastPalestine disaster.", "Republican leaders are telling 2 big lies aboutEastPalestine — here’s the truth:", "A man is beaten to death, people protest the horrific injustice -- and the media focuses on the traffic jams  it causes, rather than the horrific injustice.", "He was already subdued. It was 5 on 1. They could've handcuffed him and put him in a cruiser to be booked. Instead, they kept beating and kicking him until he was dying.\n\nWhat happened to Tyre Nichols should happen to NO ONE, ever again. And yet here we are.", "Fox News just threw Trump under the bus (or in this case, train) — pinning him with responsibility for the East Palestine disaster.", "Republican leaders are telling 2 big lies about East Palestine — here’s the truth:", "One year after Putin's invasion of Ukraine:\n- Kyiv is free\n- Kharkiv is free\n- Kherson was liberated\n- Russia has had over 200,000 casualties\n- At least 700,000 Russians have fled military draft\n- Western allies are more united than ever, with more countries wanting to join NATO", "And finally:\n\nHarding - 0**\nCoolidge - 0\nHoover - 0\nFDR - 0\nTruman - 0\nEisenhower - 0\n\n** Harding managed to die before getting indicted for anything, but he still gets some asterisks."], "NancyAFrench": ["Y’all might want to pray for us.@DavidAFrenchhas taken over this boat.", "When a@Kanakukdirector raped and abused  'hundreds' of campers, the camp covered it up with NDAs.  \n\nWhy point out the sins of this Christian institution?@DavidAFrenchdoesn't mince words in his conversation with@drmoore,@curtischangRB, andhttps://tinyurl.com/yckwjcb6", "After I first reported on@Kanakuk's inadequate response to the systematic sex abuse that happened at their Branson camp (& across the US and globe), they created a hotline for victims. Note it would report BACK to Kanakuk and not the police.  \n\nOne February day, I called it. /1", "David and I walked by the Only Murders In the Building building and it was glorious.@DavidAFrench", "When a@Kanakukdirector raped and abused  'hundreds' of campers, the camp covered it up with NDAs.  \n\nWhy point out the sins of this Christian institution?@DavidAFrenchdoesn't mince words in his conversation with@drmoore,@curtischangRB, andhttps://tinyurl.com/yckwjcb6", "After I first reported on@Kanakuk's inadequate response to the systematic sex abuse that happened at their Branson camp (& across the US and globe), they created a hotline for victims. Note it would report BACK to Kanakuk and not the police.  \n\nOne February day, I called it. /1", "This is indefensible. This candidate lives in my neighborhood, and my friends have her signs in their yards. So chilling and horrifying. We have a multi-ethnic family and our house is surrounded by people who think this is fine. THIS:", "David and I walked by the Only Murders In the Building building and it was glorious.@DavidAFrench"], "donwinslow": ["#CityOnFireA BEST BOOK OF THE YEAR@washingtonpost@amazon@BNBuzz@TheTimesBooks#CityOnFireAmazonhttps://amzn.to/33kV2rUB&Nhttps://bit.ly/3schAFXSequel#CityOfDreamsout April 18, 2023#CityOfDreamsAmazon:https://amzn.to/3zz6D3WB&N:https://bit.ly/3sTe9TC", "If you live or work nearEastPalentine, Ohio I urge you to leave for your own safety and for the safety of your family.\n\nI do not believe the full truth has been told about this horror and its long term effects on the health of resident in the area.", "Watch@jaketapper's very powerful video today about the murder of Jamal Khashoggi.", "We are headed to an extreme point of insanity in this country where you could have an 'active shooter' tv channel.\n\nThis is happening every day.\n\nThis has to stop.\n\nWhy do we accept this?\n\nWhy. Do. We. Accept. This?", "Two years after the crime, NONE have been indicted or arrested.\n\nAnd in addition to walking free, most were re-elected.", "Watch.\n\nThe hard truth about the January 6 anniversary is that after two full years#TheyAllWalkedFree.", "If you live or work near East Palentine, Ohio I urge you to leave for your own safety and for the safety of your family.\n\nI do not believe the full truth has been told about this horror and its long term effects on the health of resident in the area.", "This monster has unleashed one horror after another on America and the world for decades.\n\nThose are the facts.\n\nAnd this video from today does not change those facts."], "KyleClark": ["Denver-based Fox News reporter@aacuna1sees and embraces her son as he leavesEastHigh school after today’s shooting.", "#HeyNextCommentary:EastHigh School's second shooting in two months is a reminder that we are asking too much of young people and giving them too little in return.", "\"Twitter trolls are making much of Neely’s reported more than 40 arrests, but that feels more a comment on the morality of the arrestors — in a city that responds to mental health crises with guns instead of aid — than the arrested.\"https://inquirer.com/opinion/jordan-neely-killed-new-york-subway-20230504.html…", "Apologies for the long thread. Too often, especially it seems at the national level, bad faith faux outrage is treated seriously by the media when it’s very easily debunked. In this case, it took about 10 minutes and one post it note worth of basic math.", "Denver-based Fox News reporter@aacuna1sees and embraces her son as he leaves East High school after today’s shooting.", "#HeyNextCommentary: The Clear Creek County Sheriff's weak apology for the senseless killing of Christian Glass is the kind of response you'd expect after a bad meal or a slow checkout line, not the death of a human being.", "#HeyNextCommentary: Denver Mayor Hancock's acts of personal selfishness will be part of his yet-to-be-determined legacy#copolitics", "#HeyNextCommentary: It's not fair to expect law enforcement to be perfect - or to predict the future. It is fair to expect law enforcement to use the tools at their disposal to keep people from getting predictably massacred."], "BobMurphyEcon": ["Why does@JoshEaklewant to murder 6 million religious folk?", "Javier Milei waits until 3h, 22m, and 50 seconds into this debate to unveil me. I am the mustard gas of this conflict. \n(Thanks to@Bangershell11for relaying this.)", "we don't lock people up for their beliefs in america because we're not fascistshttps://x.com/RepDeanPhillip/RepDeanPhillips/status/1672975468213960704…", "at long last, my work on private law enforcement becomes relevant to real people", "In response to my map of NATO's expansion over time, many told me it was voluntary and some even objected to my use of the word \"expansion.\" \n\nWestern officials repeatedly assured Gorbachev NATO wouldn't expand. They understood the word, and why it would provoke (now) Russians.", "Why does@JoshEaklewant to murder 6 million religious folk?", "all we are saying is give government intervention a chance", "Unfettered capitalism will not solve poverty that it created.", "I'm being serious: From now on, whenever I see someone on Twitter matter-of-factly asserting that states breaking up will lead to civil war, I am going to ask the person directly: \"Do YOU support bombing Americans if they vote to leave the Union?\"\n\nForce them to take a stand."], "bshelburne": ["Families of men & women incarcerated in Alabama prisons are sick & tired of ⁦cruelty, indifference & incompetence from ⁦@GovernorKayIvey⁩ ⁦⁦@ALCorrections⁩ . Honored to stand with them.#alabama", "If you care about Alabama's prison crisis and want to do something to help, show up at this event and spread the word. Let's let politicians know that people in prison matter & Alabama's abuse is unacceptable!", "On this international#WrongfulConvictionDayI lift up Toforest Johnson, on Alabama's death row for 25 years. No physical/forensic evidence & a solid alibi, the state used a paid earwitness to convict & hid the payment for 17 years. He has always maintained his innocence. 1/4", "The same day families gathered in Montgomery to honor sons & daughters who have died in prison from violence, drugs and suicide, the parole board denied release to every person on their docket. This is why I stand with these families. Alabama must find a better way.", "On this international#WrongfulConvictionDayI lift up Toforest Johnson, on Alabama's death row for 25 years. No physical/forensic evidence & a solid alibi, the state used a paid earwitness to convict & hid the payment for 17 years. He has always maintained his innocence. 1/4", "Families of men & women incarcerated in Alabama prisons are sick & tired of ⁦cruelty, indifference & incompetence from ⁦@GovernorKayIvey⁩ ⁦⁦@ALCorrections⁩ . Honored to stand with them.#alabama", "The same day families gathered in Montgomery to honor sons & daughters who have died in prison from violence, drugs and suicide, the parole board denied release to every person on their docket. This is why I stand with these families. Alabama must find a better way.", "Seven men that Alabama sentenced to die in prison were celebrated tonight & it was an honor to be with them & support@AlaAppleseed. We believe in#secondchances& these men are living proof."], "PatrickSvitek": ["Kleberg County Attorney Kira Talip Sanchez announces she’s switching parties, joining the GOP", "Sam Eppler, a 27-year-old high school principal in Dallas ISD, announces a campaign against@Bethvanduynein#TX24", "Just in: House votes unanimously to expel Slaton, 147-0#txlege", "Paxton impeachment board of managers:\n\nMurr, chair\nA. Johnson, vice chair\nGeren\nMoody\nCanales\nLeach\nLongoria\nMeyer\nCain\nVasut\nSpiller\nGamez#txlege", "Team Paxton sends cease-and-desist letter to House impeachment crew, telling them to stop “contacting potential witnesses,” arguing they don’t have authority to do so at this stage#txlege", "And there it is —\n\nLess than half an hour before the Paxton impeachment debate is set to start in the House, Trump weighs in against it \n\n“Free Ken Paxton, let them wait for the next election!”#txlege", "Jamie Haynes, longtime GOP activist and realtor from Amarillo, makes her#HD86campaign official. This is John Smithee’s seat#txlege", "New: Trump weighs in on Paxton acquittal, calls on Phelan to resign#txlege"], "evanasmith": ["yes, i would describe that as falling short of its goals", "God bless this great man ⁦@WillieNelson⁩ — recipient tonight of the LBJ Liberty and Justice for All Award#txlege", "$32B surplus. With a B. This is on the list of things that didn't get done during the regular and now first special session#txlege", "The exact moment backstage at#TribFest23when ⁦@SylvesterTurner⁩ ⁦@billkellytexas⁩ ⁦@IAmMaryBenton⁩ ⁦@JeffSyptak⁩ and I learned ⁦@DallasMayor⁩ is switching parties#txlege: ⁦@SafoItsEddie⁩", "God bless this great man ⁦@WillieNelson⁩ — recipient tonight of the LBJ Liberty and Justice for All Award#txlege", "yes, i would describe that as falling short of its goals", "The exact moment backstage at#TribFest23when ⁦@SylvesterTurner⁩ ⁦@billkellytexas⁩ ⁦@IAmMaryBenton⁩ ⁦@JeffSyptak⁩ and I learned ⁦@DallasMayor⁩ is switching parties#txlege: ⁦@SafoItsEddie⁩", "$32B surplus. With a B. This is on the list of things that didn't get done during the regular and now first special session#txlege"], "BarbMcQuade": ["Enjoyed today’s Peacenic picnic for peace, hosted by One Detroit community and law enforcement partnership. Music, games, food, services. Next one is 7/15 at Heilman Rec Center with ⁦@DetroitLions⁩. Thank you ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩", "Ramadan Mubarak to all of ourMuslimfriends and neighbors.", "Happy Passover to all of our Jewish friends and neighbors.", "Just ordered this merch from the brew pub owned by Richard Fierro and his wife, Jess Fierro, who’s the brew master. He’s the Army veteran and hero who took down the shooter at Club Q. Let’s show them some love! Check out their website:https://atrevidabeerco.com/why-atrevida", "A perfectly crafted piece of disinformation. Starts with a  statement that is literally true, but fails to mention a crucial fact — all names have been redacted! Lying by omission.", "Enjoyed today’s Peacenic picnic for peace, hosted by One Detroit community and law enforcement partnership. Music, games, food, services. Next one is 7/15 at Heilman Rec Center with ⁦@DetroitLions⁩. Thank you ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩", "After a four-year investigation, Durham issues his final report with no new findings.https://justice.gov/storage/durhamreport.pdf…", "Happy Passover to all of our Jewish friends and neighbors."], "JohnArchibald": ["But then, it's not just a matter of age. Since 2017 paroles have ground to a halt.", "I sorta stepped aside in my newsletter today to make room for what is truly one of the best things I’ve ever read about the Machine at UA. If you want to understand it you should take the time.\n\nIt just happens to come from somebody close to me.https://link.al.com/view/63063131244de080400a2bf2itjh0.vo/d3444d91…", "She’s 71. She’s dying. She’s in a wheelchair. She has a room waiting in a nursing home. The DOC is ok with her release. She’s been a model prisoner. Oh, and she’s costing the state a ton of money in prison.\n \nAlabama parole board: Parole denied.", "I’m crying over here. You should skip right over mine and read@RamseyArchibaldin@TheAtlantic", "But then, it's not just a matter of age. Since 2017 paroles have ground to a halt.", "She’s 71. She’s dying. She’s in a wheelchair. She has a room waiting in a nursing home. The DOC is ok with her release. She’s been a model prisoner. Oh, and she’s costing the state a ton of money in prison.\n \nAlabama parole board: Parole denied.", "I sorta stepped aside in my newsletter today to make room for what is truly one of the best things I’ve ever read about the Machine at UA. If you want to understand it you should take the time.\n\nIt just happens to come from somebody close to me.https://link.al.com/view/63063131244de080400a2bf2itjh0.vo/d3444d91…", "I’m crying over here. You should skip right over mine and read@RamseyArchibaldin@TheAtlantic"], "natsechobbyist": [".@Daveowen365 harasses me on almost every post, I’m told. I have him muted but he has reached the attention of our security team. If you know him, they would be interested in any info you might have.\n\nAlso, he is a committed Christian & often posts about that so that’s special.", "My daughter is at Hebrew school this morning while the former president is fomenting antisemitism. I am sad and mad and incredibly disappointed that so many suggest we should simply ignore him. \n\nIgnoring problems doesn’t make them go away.", "\"For if you remain silent at this time, relief & deliverance for the Jews will arise from another place but you & your father’s family will perish & who knows but that you have come to your royal position for such a time as this?” Est 4:14 \n\nLeaders & journalists leave out royal.", "Are you suggesting a democracy is a better ally than a theocratic nation ruled by an aging monarch and murderous crown prince who invested $2B with the family of our former twice-impeached president? Interesting idea.", "My daughter is at Hebrew school this morning while the former president is fomenting antisemitism. I am sad and mad and incredibly disappointed that so many suggest we should simply ignore him. \n\nIgnoring problems doesn’t make them go away.", "That’s absolutely heartbreaking. Children should absolutely be off limits.", "I never thought I would see a Nobel Peace Prize winner fall from grace like this but here we are.", "HE IS NOT BETTER THAN THIS. WHAT IS WRONG WITH YOU? !!!משוגע"], "davidhogg111": ["Parkland could happen again tomorrow\nSandy Hook could happen again tomorrow \nLas Vegas could happen again tomorrow \nUvalde could happen again tomorrow \nNashville could happen again tomorrow \nColumbine could happen again tomorrow \nThoughts and prayers aren’t enough.", "Ben do you not remember Buffalo? Where there was an armed guard at who even managed to hit the shooter but couldn’t stop him because of the body armor and gun you insist we keep legal? How about Kroger grocery store in Collierville, TN where 15 were shot? Or Boulder 10 killed?", "We have a right to not be shot\nWe have a right to go to school and survive\nWe have a right to peace\nWe have a right to domestic tranquility", "We have a right to not be shot.\nWe have a right to survive math class.\nWe have a right to safety.\nWe have a right to a future.\nWe have a right to not be murdered. \nMurder is the ultimate infringement on our rights.", "I have not been this angry in a long fucking time. They were NINE YEARS OLD AND TEACHERS HAD TO DIE PROTECTING THEIR KIDS. BECAUSE OF REPUBLICAN COWARDS and NRA PUPPETS LIKE SENATOR BLACKBURN. \n\nIf you aren’t livid you aren’t paying attention.", "Parkland could happen again tomorrow\nSandy Hook could happen again tomorrow \nLas Vegas could happen again tomorrow \nUvalde could happen again tomorrow \nNashville could happen again tomorrow \nColumbine could happen again tomorrow \nThoughts and prayers aren’t enough.", "We have a right to not be shot.\nWe have a right to survive math class.\nWe have a right to safety.\nWe have a right to a future.\nWe have a right to not be murdered. \nMurder is the ultimate infringement on our rights.", "The fact our reaction to 10 people being murdered is to debate instead of act says a lot about how broken our politicians system is and the epic failure of our leaders. Our reaction to moments of crisis should never be inaction and hoping it doesn’t happen again. Fuck inaction."], "anthonyzenkus": ["There was nothing \"controlled\" about@nscorp's un-controlled burn inEastPalestine. That was a chemical weapons attack.", "You cannot say you care about women in Iran if you don't speak out for women in Palestine.", "Get this: They found dioxin far above safe levels inEastPalestine water and the federal gov won't clean it up because Obama killed EPA proposal requiring the gov to lower the threshold for cleanup.\n\nDemocrats ignored the science and people will die because of it.", "Free Palestine. If you can't say those words you won't get my vote.", "Get this: They found dioxin far above safe levels in East Palestine water and the federal gov won't clean it up because Obama killed EPA proposal requiring the gov to lower the threshold for cleanup.\n\nDemocrats ignored the science and people will die because of it.", "There was nothing \"controlled\" about@nscorp's un-controlled burn in East Palestine. That was a chemical weapons attack.", "Not one member of The Squad is calling for a negotiated peace to end a war that is inching us closer to the brink of nuclear Armageddon. Not. Fucking. One.", "Henry Kissinger is responsible for far more civilian deaths than Vladimir Putin."], "benshapiro": ["I mean look at this vile shit from the NYT.Israel's military killed TERRORISTS. Palestinian terrorists killed SYNAGOGUE ATTENDEES. To the NYT, it's all just a cycle of violence:", "This is all part of a broader Leftist narrative that it's the new right-wing Israeli government \"raising risk of escalation\" when 13-year-old terrorists shoot people going to synagogue, Hamas cheers, and the PA cuts off security cooperation. Look at this pathetic NYT headline:", "The current Israeli government had to pass the judicial reform. It is INCREDIBLY mild: it merely says that the judiciary cannot simply declare a law \"unconstitutional\" in a land with no written constitution on the basis of it being \"unreasonable.\" \n\nImagine the Supreme Court in", "The juxtaposition of rabid anti-Semite Rashida Tlaib attempting to perform a \"Nakba Day\" lamenting the existence of the State ofIsraelwhile Hamas fires missiles into the heart ofTelAvivis pretty clarifying.", "I mean look at this vile shit from the NYT. Israel's military killed TERRORISTS. Palestinian terrorists killed SYNAGOGUE ATTENDEES. To the NYT, it's all just a cycle of violence:", "This is all part of a broader Leftist narrative that it's the new right-wing Israeli government \"raising risk of escalation\" when 13-year-old terrorists shoot people going to synagogue,Hamascheers, and the PA cuts off security cooperation. Look at this pathetic NYT headline:", "Yes, this is how Middle East journalisming™ often works", "The current Israeli government had to pass the judicial reform. It is INCREDIBLY mild: it merely says that the judiciary cannot simply declare a law \"unconstitutional\" in a land with no written constitution on the basis of it being \"unreasonable.\" \n\nImagine the Supreme Court in"], "briebriejoy": ["Watch my full exchange with RFK Jr. in which I challenge his “unconditional” support ofIsraelin light of the international consensus thatIsraelis an apartheid state.", "Imperialists often raise the example of WWII & accusations of genocide to justify war. (E.g. incubator babies in Kuwait). But does the left have a response to the question of how to identify a Hitler-level threat, & what to do about it? Must it?https://patreon.com/posts/full-video-coup-74333319…", "\"The family said that such shooting at residents and nearby houses occurs frequently.\n\n“I didn’t know what to do. The shooting was directly at them. I saw my husband was wounded, and my child. I was sure he was killed. It was clear because I saw his head was bleeding,” Marwa", "\"You want a presidential candidate...who has a backbone...If [RFK Jr.] thinks somehow that each [Palestinian] baby who was killed somehow was never in any way, intentional, deliberate, they didn't know what they were doing --he needs to really get off the crack pipe.\"\n\nPremiere", "Watch my full exchange with RFK Jr. in which I challenge his “unconditional” support of Israel in light of the international consensus that Israel is an apartheid state.", "\"You want a presidential candidate...who has a backbone...If [RFK Jr.] thinks somehow that each [Palestinian] baby who was killed somehow was never in any way, intentional, deliberate, they didn't know what they were doing --he needs to really get off the crack pipe.\"\n\nPremiere", "\"The Italians -- they were able to get 100k people out in the streets, & we asked them how they do it, & they said we are very very laser focused on a simple message of cease fire and peace talks. We don't talk about NATO, we don't talk about broader societal issues. And whether", "RFK Jr. Palestine FACT CHECK\"The idea that idea that Israel is a democracy in the first place, let alone the only democracy, is a sham.\" -@OmarBaddarListen to a point by point response to some of the recent claims RFK Jr. has made about Israel/Palestine on@BadFaithPod."], "fred_guttenberg": ["Just left a meaningful and important night at the@WhiteHousecelebrating Jewish History Month. Thank you@POTUS,@FLOTUS,@VP, and@SecondGentlemanfor including me.  Your words tonight on anti semitism were truly appreciated.  President Biden was right \"silence is complicity.\"", "(2,23) Alhadeff, Nicholas Dworet, Luke Hoyer, Gina Montalto, Carmen Schentrup, Cara Loughran, Alaina Petty, Meadow Pollack, Helena Ramsay, Peter Wang, Matin Duque, Scott Beigel Chris Hixon and Aaron Feis.  Our loved ones and our families were again victimized by this verdict.", "(20,23) agree with it.  While this may be hard to hear, what I actually want is for this killer to have been dead as quickly as possible.  We must be honest and accept the reality that pure evil exists and he is pure evil.  He serves no redeeming purpose to society, and in fact,", "This morning I voted.  I voted for Jaime & I voted for Democracy.  Why did I choose today?  Because today is 4 years since the Pittsburgh Tree of Life Temple shooting.  I was also voting to#DisarmHate.  The intersection of hate, antisemitism, & guns is on the ballot this year.", "You left something out@HouseGOP.  Parents have a right to send children to school and other public places without  gun violence.   Because of you, my rights were not considered.  This is Jaime, her rights were terminated when she was murdered in school because of an AR 15.", "(1,15) Will it make me feel better?\n\nToday court will be back in session for victim impact statements and then tomorrow for the official sentencing of the monster who murdered Jaime and 16 others.  As most of you know, during the trial we were given the opportunity to deliver a", "(2,23) Alhadeff, Nicholas Dworet, Luke Hoyer, Gina Montalto, Carmen Schentrup, Cara Loughran, Alaina Petty, Meadow Pollack, Helena Ramsay, Peter Wang, Matin Duque, Scott Beigel Chris Hixon and Aaron Feis.  Our loved ones and our families were again victimized by this verdict.", "LEADERSHIP!!!\n\nThank you Leader@hakeemjeffriesfor raising your voice for the sole purpose of trying to stop the next one and to save lives."], "LeeCamp": ["Companies “...dumped radioactive and toxic waste into rivers. Some of the more than 250 million tons of toxic & radioactive detritus… scattered into nearby communities, some spilled into streams or leaked into aquifers.” Many of the mines & mills STILL have not been cleaned up.", "Wow, you know it's bad when Western propaganda is so insane it's even (eventually) fact-checked by NBC news", "This is like saying “Sorry I robbed you & burned down your house for 100 years. Here’s a gun.”", "It only took them 7 months of brutal war to figure out what true peace activists said from day one.", "Wow, you know it's bad when Western propaganda is so insane it's even (eventually) fact-checked by NBC news", "This is like saying “Sorry I robbed you & burned down your house for 100 years. Here’s a gun.”", "It only took them 7 months of brutal war to figure out what true peace activists said from day one.", "I'm going to take a wild guess that the US & NATO destroying the entire country of Libya probably did not help them deal with this gut-wrenching climate disaster."], "JordanChariton": ["Here's OH Gov. ADMITTING it's not yet safe for residents to be in#EastPalestineOH. \"The whole goal here is to make this community safe. That can't happen overnight. You can't get all the stuff out of here overnight.\"\n\nTHEN WHY WERE RESIDENTS ALLOWED BACK? WHY ARE THEY THERE NOW?", "This House hearing on#EastPalestineis a complete joke.Norfolk Southern not present.Took half hour to bring up  WIDESPREAD residents' health issuesDr. only mentioned sore throat, headaches, & anxiety (no mention on dizziness, bloody noses, chemical burns, bronchitis)", "On#FourthofJulyremember:Flint has had toxic water for 3,357 days. No one in prison 9 years laterNorfolk Southern nuked#EastPalestine5 mths ago. Residents are sick & desperateWhite people didn't want#DAPLin their town, so it got re-routed through Standing Rock...", "She said the doctors in town don’t even know what to tell residents. They are not equipped or knowledgeable to treat these kind of petrochemical-induced exposures. She doesn’t know what to do", "Here's OH Gov. ADMITTING it's not yet safe for residents to be in#EastPalestineOH. \"The whole goal here is to make this community safe. That can't happen overnight. You can't get all the stuff out of here overnight.\"\n\nTHEN WHY WERE RESIDENTS ALLOWED BACK? WHY ARE THEY THERE NOW?", "This House hearing on#EastPalestineis a complete joke.Norfolk Southern not present.Took half hour to bring up  WIDESPREAD residents' health issuesDr. only mentioned sore throat, headaches, & anxiety (no mention on dizziness, bloody noses, chemical burns, bronchitis)", "BREAKING:@UAWPresident Shawn Fain announces 38 parts and distribution plants for@GMand@Stellantiswill go on strike today across 20 states and 9 regions.", "A month ago a petrochemical bomb went off spreading toxic carcinogenic chemicals through multiple states sickening an entire community and killing tens of thousands of animals. Mainstream media are merely providing updates…"], "kylegriffin1": ["Yes, this is a real post from Donald Trump addressing \"liberal Jews who voted to destroy America &Israel.\"", "The White House responds: \"Bigotry, hate, and antisemitism have absolutely no place in America - including at Mar-A-Lago. Holocaust denial is repugnant and dangerous, and it must be forcefully condemned.\"", "Leader Schumer: \"For a former President to sit and have dinner with a high-profile antisemite is disgusting and dangerous. To give an antisemite even the smallest platform—much less an audience over dinner—is pure evil.\"", "I don't even know what to write about Trump's post saying \"U.S. Jews have to get their act together … Before it is too late!\"", "On Fox this week, while discussing the Ohio train derailment, Bret Baier noted that Trump and his Transportation Secretary, Elaine Chao, did not visit sites of derailments – including fatal ones, which East Palestine's was not.", "Reuters: IRAN OUSTED FROM U.N. WOMEN'S BODY AFTER U.S. REQUESTED VOTE", "The EPA has ordered Norfolk Southern to clean up the contamination from the train derailment in East Palestine, Ohio.", "Leader Schumer: \"When the former President of the United States welcomes at his own dinner table several vicious antisemites and then, rather than apologize, he lectures American Jewish leaders for insufficient loyalty — it is incumbent on all of us to speak out.\""], "elonmusk": ["The New York Times actually has the nerve to support calls for genocide! If ever there was a time to cancel that publication, it is now.\n\nYou can read their articles for free anyway usinghttp://removepaywall.com.", "Artificial intelligence discussion with PM Netanyahu in an hour", "I look forward to speaking at 9:15  (19:15 Israel time) on X with@elonmuskabout how we can harness the opportunities and mitigate the risks of AI for the good of civilization.", "Why didn’t they protest when the children were murdered at the Christian school?\n\nThey are disingenuous.", "The ADL, because they are so aggressive in their demands to ban social media accounts for even minor infractions, are ironically the biggest generators of anti-Semitism on this platform!", "The New York Times actually has the nerve to support calls forgenocide! If ever there was a time to cancel that publication, it is now.\n\nYou can read their articles for free anyway usinghttp://removepaywall.com.", "The people have spoken.\n\nAmnesty begins next week.\n\nVox Populi, Vox Dei.", "Artificial intelligence discussion with PMNetanyahuin an hour", "I look forward to speaking at 9:15  (19:15 Israel time) on X with@elonmuskabout how we can harness the opportunities and mitigate the risks of AI for the good of civilization.", "America has always condemned as evil those who use cluster bombs, but now we send them to be used? \n\nNo good will come of this. Fate loves irony, but hates hypocrisy."], "itsJeffTiedrich": ["holy fucking shit, criticizingIsraelis not antisemitic. what IS antisemitic is putting a holocaust-denying lunatic who thinks Jews control the weather on the Homeland Security Committee. sit the fuck down and shut the fuck up and spare us your fucking fake outrage", "bro, fix the Nazi problem in your state. until then, you have no Jewish friends. stop pretending that you do", "#BREAKING: Well-Regulated Militia Opens Fire In The Covenant Christian School In Nashville TN; Cheap Thoughts And Useless Prayers Now Being Rushed To The Scene ... more on this soon-to-be-forgotten-and-then-repeated story as it develops ...", "here's what we know so far: a man obtained a weapon of mass death, just as our founders intended, and used that weapon to spray bullets into the air, just as our founders intended, and when his neighbors asked him to please stop, he shot them dead, just as our founders intended", "holy fucking shit, the right-wing hate machine created a monster and handed him a weapon of mass death. please read my latest piece, and please sign up for my FREE newsletter, so we can always keep in touch. thanks ...", "holy fucking shit, criticizing Israel is not antisemitic. what IS antisemitic is putting a holocaust-denying lunatic who thinks Jews control the weather on the Homeland Security Committee. sit the fuck down and shut the fuck up and spare us your fucking fake outrage", "it's the guns. it's the fucking guns, and I wrote a thing: \"nine more people are dead.\" what's it going to take to end this insanity? I hate that I had to write this, but I hope you read it. thanks—", "please read my \"three more children are dead,\" about yesterday's school shooting tragedy and the shitheads who will do nothing to stop the next one. and do sign up for my FREE newsletter. thanks—"], "bluestein": ["I’m at theEastCobb UMC, where a huge crowd has arrived to unite against the antisemitic attacks that targeted Georgia synagogues this week. A strong bipartisan group of elected officials is front-and-center in a show of support for the Jewish community.#gapol", "“Giuliani doesn’t elaborate on other instances when the Red Sea was parted.”", "A huge show of support from prominent Georgia religious leaders for a House measure that would define antisemitism so that it would be included under Georgia’s hate crimes law — and formally ban using swastikas with the intent to terrorize another person.#gapol", "Sen.@ossoffon the antisemitic mailers that hit many Jewish homes this weekend: “Georgia’s Jewish community will not be intimidated by cowardly acts of hate. I condemn in the strongest terms this weekend’s despicable attempt to sow fear and division …”#gapol#atlpol", "“This is a pivot point,” former Lt. Gov. Geoff Duncan says as he leaves the courthouse.#gapol", "Happy#NationalDaughtersDay— and even happier end-of-Yom Kippur fasting!", "I’m at the East Cobb UMC, where a huge crowd has arrived to unite against the antisemitic attacks that targeted Georgia synagogues this week. A strong bipartisan group of elected officials is front-and-center in a show of support for the Jewish community.#gapol", "Warnock says his two kids were on lockdown at their schools. “They’re there, I’m here, hoping and praying they’re safe. But the truth is none of us are safe … Thoughts and prayers aren’t enough.”\nMass shootings “aren’t a cost of freedom, they’re a cost of obstinance.”#gapol"], "SarcasmStardust": ["Go fuck yourself.IsraelIS an apartheid state.", "There is an alarming trend in the Democratic Party to describe Israel as an apartheid state. This rhetoric is dangerous and inaccurate.@RepDWStweets. It’s time to set the record straight. \n\nThank you@RabbiShmuleyfor the opportunity.", "I can’t. Fuck.#FuckIsrael#FreePalestine", "The cruelty\n\nAn israeli guard executed an autistic Palestinian named Eyad Hallaq.\n\nThe israeli guard shot him in the leg, chased him to a garbage room, then fired 3 more bullets in his chest with an M16.\n\nEyad's mother screams as the israeli court lets her son's killer walk free", "Remember when our “ally”Israelbombed the airport in Aleppo immediately following the earthquakes making it impossible for life saving aid to get to the victims? \n\nShut the fuck up and leave Syria alone.", "Twelve years of war, and this year’s earthquakes, have pushed the Syrian people to the brink. \n\nThe Syrian people are crying out for support – and, more than anything, for peace.https://usun.usmission.gov/remarks-by-ambassador-linda-thomas-greenfield-at-a-un-security-council-briefing-on-the-political-and-humanitarian-situations-in-syria-2/…", "Absolutely depraved.#FuckIsrael#FreePalestine", "Israeli occupation troops poured concrete into the water sources to stop agricultural irrigation in an area in Hebron that serves 25 Palestinian families.", "Today is Mumia Abu-Jamal’s birthday. He remains in prison after serving 15,110 days. He should be home today celebrating with his family.#FreeMumia", "Ilhan Omar is a warmongering propagandist. Pass it on.", "I can’t. Fuck.#FuckIsrael#FreePalestine", "The cruelty\n\nAn israeli guard executed an autistic Palestinian named Eyad Hallaq.\n\nThe israeli guard shot him in the leg, chased him to a garbage room, then fired 3 more bullets in his chest with an M16.\n\nEyad's mother screams as the israeli court lets her son's killer walk free", "Absolutely depraved.#FuckIsrael#FreePalestine", "Israeli occupation troops poured concrete into the water sources to stop agricultural irrigation in an area in Hebron that serves 25 Palestinian families."], "SocialistMMA": ["Good.Israelshould not exist. Get rekt Zionists", "Over 160 Palestinians killed by Israeli forces this year alone meanwhile the Nazi supportingwestis silent", "Pramila Jayapal apologizes after telling the truth aboutIsraelIf you don’t have the guts to stand up to the media and the Israeli lobby then stfu. \n\nI’m tired of these progressive affirming Zionist nonsense by apologizing", "I hate Zionists so much. They are only growing more bloodthirsty and radical by the day", "Good. Israel should not exist. Get rekt Zionists", "Ilhan Omar and the squad made her ousting on committees about racist Republicans and identity politics to avoid the conversation about how her party is bought by Israel and threw her under the bus", "Over 160 Palestinians killed by Israeli forces this year alone meanwhile the Nazi supporting west is silent", "Ilhan Omar you literally endorsed Jim Crow Joe who sent Covid relief money to the police. \n\nYou voted to give the capitol police a budget increase and surveillance powers using January 6 as a cover \n\nstfu"], "Josh_Moon": ["And here's part of what happened after the riverboat docked and the other workers and people on the boat were able to get to the fight.", "Translation: \"Town of sane people decided not to entertain the absurd fear mongering of mouth-breathing carnival barkers in town for a quick grift.\"", "I'd just like to remind everyone that 12-year-olds are still being forced to carry incest pregnancies to term in several states, and women are being denied basic care and Rx drugs because of Republicans. Maybe we shouldn't stop talking about that.", "Three children were killed with an assault rifle at an elementary school in Tennessee and state lawmakers have responded by banning Black lawmakers.", "And here's part of what happened after the riverboat docked and the other workers and people on the boat were able to get to the fight.", "Marge Green, just back from killing some dalmatian puppies", "Seems like a good time to remind you that just 7 yrs ago, we had a president in his 8th year in office without a single criminal indictment in his administration. He was a good husband, a model dad & a decent human. His biggest scandal was wearing a tan suit. It was this guy:", "Remember way back a whole 10 months ago when Republicans kept saying they weren't going to prosecute mothers under the new abortion ban? Well they lied.https://legislature.state.al.us/pdf/SearchableInstruments/2023RS/HB454-int.pdf…"], "WarOnDumb": ["We should call this pulling an Alabama. Trash talk feds when they offer help. Beg for help when it’s too late.", "Tommy Tuberville thinks you’re stupid, too.", "It’s not just schools. It’s churches, malls and workplaces. And a birthday party.", "I’m still not convinced this is real, but I’m so grateful.", "It's time to dispel the notion Alabama Gov. Kay Ivey is a good person. A thread.", "I’m still not convinced this is real, but I’m so grateful.", "Here’s the video where Ivey promised to do better. How’s that going?", "It’s not just schools. It’s churches, malls and workplaces. And a birthday party."], "toddcstacy": [], "maryltrump": ["Thanks to everybody who voted for these unserious, anti-democratic arsonists who will be paid over $170,000 a year of taxpayer money to keep burning it all down. Good work.", "I was out all day last Friday and was spared the media’s decision to turn the brutal beating of an innocent young man into some kind of dystopian game show.  Charles Blow referred to the countdown clock as, “a damning indictment of American perversion.” Yes.\n\n1/", "Nine people would be alive today if the shooter hadn’t had a semi-automatic weapon and high-capacity magazines.\n \nI lay it all out in my Substack. It’s the fucking guns.https://marytrump.substack.com/p/the-sickness-unto-death-part-i…", "The very small number of Republicans who are (very mildly) criticizing Donald for hosting a white supremacist and an anti-Semite are, for the most part, refusing to name him and leaving out the fact that Donald is also a white supremacist and anti-Semite. \n\nLooking at you, Mitch.", "Nine people would be alive today if the shooter hadn’t had a semi-automatic weapon and high-capacity magazines.\n \nI lay it all out in my Substack. It’s the fucking guns.https://marytrump.substack.com/p/the-sickness-unto-death-part-i…", "Thanks to everybody who voted for these unserious, anti-democratic arsonists who will be paid over $170,000 a year of taxpayer money to keep burning it all down. Good work.", "\"They expressed no anti-Semitism\" is not something I've ever felt the need to say after hanging out with my friends.  ¯\\_(ツ)_/¯", "At a mall in Allen, TX, kids were getting ice cream or hanging out with their friends. People were shopping. They were exercising their “unalienable rights,” to “Life, Liberty, and the pursuit of Happiness.”\n\nAll of our Representatives are supposed to protect those rights. But"], "JoJoFromJerz": ["Ok - serious question here, since it’s abundantly clear that he’s not going to stop doing this shit (no one thought he would), but does revoking his pretrial release slow the case down?\nCan he really just continue to do this without real repercussions?", "Good Lord.", "This whole damn thing is a 9-layer dip of hypocritical theatre for them. Double standard palooza. And when you add in the fact that we’re talking about the guy who literally ran on “locking up” his opponent, it just makes you want to bang your head against the wall for hours.", "Thank you for all you do, for all you have done and all you will continue to do for this country in the future. I’m so sorry that you had to endure what happened, but I’ll forever be grateful for your patriotism and for your bravery in the face of that horrific attack.", "He makes me sick to my stomach.\nHadn’t those families suffered enough?\nWhat kind of monster needs to exacerbate their pain by calling the massacre of their babies a “hoax”?\nWhat parent on the planet can stand with someone like him?\nI don’t get it.\n\nBut no dollar amount is enough.", "Respectfully, Senator - here is what I had to say on the issue.\nAnd I want you to know how much I appreciate your advocacy on this issue.\nI’m a mom of two kids - they are 9 and 13… and I am f’ng terrified that they will be some f’ng statistic someday because of the cowardice of", "But wait — there’s even MORE awful.\n\"I can't think about you or I get hard,\" Giuliani told Dunphy, according to the transcript. \"Even -- even if I think about how smart you are, I'll get hard. I'd never think about a girl being smart. If you told me a girl was smart, I would", "This is so fucking disgraceful and disgusting. Two years to the day of the violent attack donald trump unleashed on that building and this despicably craven creature is singing his praises for his “victory”.\nIt’s as revolting as it is disheartening.", "You STILL have this intentionally xenophobic disinformation up on your official account. Given that we now know that none of your accusations are true, you’re still standing by it. You know this is provably false but you won’t say so.\nOnce upon a time this very thing got you", "Says the fist pumping domestic terrorists guy who tried to overturn an election in order to install the thrice philandering, serially lying ‘disciple of Jesus’ who mocked a disabled reporter & bragged about sexually assaulting women.\n\nYou’re about as hypocritical as they come.", "The same bigot who five years ago called Nazis “very fine people” is threatening Jewish Americans today.\n\nWhen someone shows you who they are, believe them the first time.", "Ahh yes, Nazferatu - the architect of the child separation policy, is the ultimate authority on what it means to be good or decent.", "Dear Republicans,\nHere we f’ng go.\nAGAIN -\n\nThere was no ‘upside’ to slavery. There was no fucking “benefit” to being a slave.\nAnd if you’re actually out there saying that “Jews survived the Holocaust by being useful”, then perhaps you need to be reminded, just for starters, that", "Dearest John,\nIt’s been days since last we spoke, and I’ve been trying my best to hold down the fort in your absence, but the little ones are growing pale and weak from the lack of supplies, and so I had no choice, but to head out, without you.\nI grabbed any hopefully", "He’s also an intolerant, evil, revenge driven fascist. \nWhich could mean that if he were to be elected that we could be looking at like, many years of fascist rule…\nBut do go on about how much younger he is than President Biden won’t you.", "They aren’t wearing body armor and face masks.\nThey don’t have bear spray & zip ties.\nThey aren’t using baseball bats, flag poles or stolen police shields to attack American democracy.\nThis time, their weapons are our veterans’ healthcare, food stamps for single moms & forcing", "It’s absolutely scandalous that an entire political party (so-called anyway) would actually be willing to sabotage our country in this way. It should lead the news at the top of every hour.\nThey are holding the entire country hostage for what? To cause chaos? Instability? To", "Why are you so obsessed with this, Jr?\nDoes it bring back the three children and 3 adults who were slaughtered by an AR-15 style rifle?\nDoes it change the truth that despite the fact that the parents of the shooter had voiced opposition to their child being able to own a gun due", "We shouldn’t even be talking about trump showing up inEastPalestine with some shitty ass expired water bottles & MAGA hats.\n\nWe should be talking about his goddamn indictments & calculating what to anticipate in prison time.\n\nThis is all just so endlessly f’ng frustrating.", "He will never stop fanning the flames of retributive violence.\nAnd the cult will never stop clamoring for more.\nIt’s only going to get worse.", "You can’t go to work, to the MALL, to the grocery store, to your church, to the movies or the bank.\nYou can’t attend a concert, go to a dance class or go to see your doctor. You can’t ring a doorbell, use a leaf blower, hop in a car, pull down a driveway, bounce a ball, or ask", "I refuse to accept this.\nI refuse to accept that I can’t take my kids to an outlet mall without risking them getting shot.\n\nI refuse to accept that by taking them to a parade, to a movie, to the grocery store or to the post office that I am risking them getting shot.\n\nI refuse to", "We can never become numb to this. This can never become “normal”.\nThis is not fucking normal.\nAnd it is NOT ok.", "Happening now in Columbus, Ohio. Neo - nazis flying swastika flags are outside of a drag event.https://x.com/Liz_Andromeda/status/1652366545102708738/video/1…"], "DineshDSouza": ["As America and theWestpulls further away from its Judeo-Christian\ntradition, Ze’ev Orenstein of the City of David Foundation in Jerusalem\nargues that God is speaking back to us through ancient seals, inscriptions\nand stones.@ZeevOrenstein", "Ze’ev Orenstein of the City of David Foundation in Jerusalem reveals how modern archeology is confirming the truths of the Hebrew and Christian scriptures.@ZeevOrenstein", "Ze’ev Orenstein, international affairs director of the City of David\nFoundation, talks about biblical archeology inIsraeland shows us ash left\noften from the 2000-year-old Roman burning of Jerusalem.@ZeevOrenstein", "After FEMA Denies Aid toEastPalestine, Ohio, Democrats and Republicans Unite to Demand Answers", "Ze’ev Orenstein, international affairs director of the City of David\nFoundation, talks about biblical archeology in Israel and shows us ash left\noften from the 2000-year-old Roman burning of Jerusalem.@ZeevOrenstein", "Trump Vindicated, Biden Proven A Liar As NYT Admits Trump Rollback Had ‘No Impact’ On East Palestine, Ohio", "After FEMA Denies Aid to East Palestine, Ohio, Democrats and Republicans Unite to Demand Answers", "East Palestine Residents Coming Down With Mysterious Illness As Hazardous Chemicals Linger Following Derailment"], "dbongino": [], "TheLeoTerrell": ["Mark Levin: This Is An Abuse Of The Justice System!", "‘Everyone knows the fix is in’: Jordan blasts AG Merrick Garland for ‘two standards of justice’https://leoterrell.com/everyone-knows-the-fix-is-in-jordan-blasts-ag-merrick-garland-for-two-standards-of-justice/?utm_source=mux&utm_medium=social&utm_campaign=tw…", "Taliban slips back into former tyranny with first public execution since Afghanistan takeoverhttps://trib.al/xzpiuTX", "Lawmakers urge Biden not to consider plea deal for 9/11 terrorists to escape death penalty", "Biden Says He Brought Home ‘Wrongfully Detainees’ from ‘Iranda’", "Taliban slips back into former tyranny with first public execution since Afghanistan takeoverhttps://trib.al/xzpiuTX", "Outgoing OR Dem Governor Kate Brown commutes sentences of every inmate on death rowhttps://trib.al/rKx9chT", "Hemingway: Biden Needs To Stop Lying To Gold Star Families That His Son Died In Iraqhttps://thefederalist.com/videos/hemingway-joe-biden-needs-to-stop-lying-to-gold-star-families-that-his-son-died-in-iraq/…"], "donaldjtrumpjr": ["Disgusting! Only the New York Times would get Chanukah going with this is the crossword puzzle. Imagine what they would do to someone who did this and was not ideologically aligned with them? I’ll give them the same benefit of the doubt they would give those people… EXACTLY ZERO", "The Hamas caucus of the house is really upset that an antisemite was removed from the foreign affairs committee. I’m shocked…but also glad that finally some people did something.", "Instead of taking personal responsibility like a man for his vile views about Jews,@emeriticusgoes full leftist and like a coward, blames Trump!!!\"In an interview...Gonzalez attributed the remarks to his descent into what he described as an \"online Trump world\"", "Real leadershipExclusive — Trump, Waltz to Meet Afghanistan Withdrawal Gold Star Families at Bedminster", "“President Trump did more to secure our border than anybody by far…illegal immigration down by 83%, 45-year low.\" - Former Acting Director of ICE @Tom_D_Homan", "TheHamascaucus of the house is really upset that an antisemite was removed from the foreign affairs committee. I’m shocked…but also glad that finally some people did something.", "WATCH: President Trump announces plan for immediate mass firings of \"warmonger\" bureaucrats at the State Department and Pentagon if he's reelected President in 2024.\n\n\"I am the President who delivers peace.\" -@realDonaldTrump", "WATCH: On the latest episode of Triggered,@SeanParnellUSAtells an unbelievable story about almost being killed while serving in Afghanistan. \n\n\"Sir, you got blown the fuck up\""], "diamondandsilk": ["Diamond and Silk were right AGAIN.  Vindicated, Liberated, Exonerated. \n\nMy sister and I told you all in March of 2020 that Something wasn't Right.  Here's more proof that we were Right!\n\nWe were Vilified, Criticized, Humiliated, Ridiculed. Our brand was tarnished and our", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "Diamond and Silk were right AGAIN.  Vindicated, Liberated, Exonerated. \n\nMy sister and I told you all in March of 2020 that Something wasn't Right.  Here's more proof that we were Right!\n\nWe were Vilified, Criticized, Humiliated, Ridiculed. Our brand was tarnished and our", "Diamond and Silk were right AGAIN.  Vindicated, Liberated, Exonerated.   \n\nMy sister and I told you all in March of 2020 that Something wasn't Right.  Here's more proof that We Were Right!  \n\nWe were Vilified, Criticized, Humiliated, Ridiculed. Our brand was tarnished and our", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good."], "spiritofho": ["Blockading aid to Syria after a devastating earthquake that's killed thousands is truly evil.\n\nThat is what the United States is doing right now.", "Hong Kong is China. \n\nCrimea is Russia.\n\nAndIsraelis PALESTINE.\n\nLearn your history.", "Zelensky has spent all day celebrating one year of a proxy war that his NATO masters provoked and which they are now telling him to start peace discussions as soon as possible.\n\nThere's only one word to describe a person like this. It's not hero. It's pathetic.", "RFK Jr. says he opposed arming and funding Ukraine in a proxy war with Russia.\n\nUS officials, including Joe Biden, want to make Ukraine the “Israel” of Europe.\n\nRFK Jr. endorses the US funding and armingIsrael.\n\nThis is red-flag levels of hypocrisy.", "The US is responsible for the deaths of over 45 million people since the War on Terror was declared in 2001.\n\nYet we are told Russia and China are a threat to the “rules-based international order.”\n\nLet that sink in.", "NAFO trolls must be coping hard now that Russia has taken Bakhmut.\n\n\"It's not significant at all, Ukraine only gave up tens of thousands of lives to defend this city.\"", "Why is Twitter and Twitter Files documents not divulging how this has targeted left-wing anti-war voices?\n\nI don't believe for a second this is used solely on conservative voices. Release the full blacklist, or at least a more full version.", "This is a really bad sign. The CIA is not brave. The CIA is evil and has the blood of tens of millions on its hands.", "The majority of people working at the CIA are good, patriotic people committed to their missions and the law. My own daughter-in-law was a field agent, and she is among the bravest people I have known.", "The West is just giddy that Israel committed an act of war on Iran.", "I don’t want to hear Covid this Covid that. I want an explanation for why the mass influx of people like myself who have left the democrats should support RFK Jr given that he is almost more enthusiastic about supporting Israel’sgenocideof Palestine than the establishment.", "Free Palestine is trending. This is a reminder that the biggest impediment to Palestine's liberation is the U.S.'s ceaseless funding of Israel's apartheid regime.", "The US is a terrorist state.\n\nIsrael is a terrorist state.\n\nBoth are engaged in LITERAL occupations that receive a fraction Ukraine receives from Western \"cruise missile\" leftists."], "MollyJongFast": ["As an actualjewthis is particularly enraging", "If you’re defending killing people on the subway perhaps it’s time to log off", "One of these candidates was Jewish and the other wasJewish.", "Personally as aJew, I tend to think the people using antisemitic rhetoric are in fact antisemitic", "As an actual jew this is particularly enraging", "I just saw the pile of bodies video and I just want to say republican politicians have made a decision that the American people must live this way. Few other countries live like this.", "If you’re defending killing people on the subway perhaps it’s time to log off", "This interview with Yusef Salaam and@JoyAnnReidis really good."], "FiorellaIsabelM": ["Israelnot only attacked a refugee camp in Jenin but specifically targeted a medical center, claiming they’re targeting “terrorists”. Before you try to both sides this issue, don’t.", "While RFK acknowledgedIsraelhas nuclear weapons he either naively or disingenuously pretends “Israelis not going to use their nuclear weapon unless they’re attacked…”becauseIsraeldoesn’t attack Syria, Iran & Palestine UNPROVOKED on the daily.", "I along with dozens of women in media from all over the world met with President Ebrahim Raisi today. In his speech he said a few things that resonated with me beyond religion, borders and culture:Westerners use the issue of women's rights as a tool to exert pressure on", "Sh*tlibs are out here calling Black men  & minorities anti-Semitic for standing against Zionism while their country funds genocide on Semitic Palestinians & supports Ukrainian Nazis. Please kindly STFU with your hypocrisy.", "Israel not only attacked a refugee camp in Jenin but specifically targeted a medical center, claiming they’re targeting “terrorists”. Before you try to both sides this issue, don’t.", "While RFK acknowledged Israel has nuclear weapons he either naively or disingenuously pretends “Israel is not going to use their nuclear weapon unless they’re attacked…”because Israel doesn’t attack Syria, Iran & Palestine UNPROVOKED on the daily.", "BREAKING Armenia and Azerbaijan have agreed to aceasefirein the Nagorno-Karabakh region, via mediation from Russian peacekeepers", "It’s been 20 years since the death of Rachel Corrie at the hands of US-funded Zionists\n\n20 years since the deceitful US-Led invasion of Iraq\n\n55 years since the US-led Mỹ LaiMassacreThe ICC is a joke & condones war crimes & criminals while Julian Assange is still in Prison"], "aaronjmate": ["Former Israeli PM Naftali Bennet: NATO “decided that it is necessary to continue to smash Putin, and not to negotiate… They broke off the negotiations, and then it seemed to me that they were wrong.”", "The UN says thatIsrael's bombing of Syria's Aleppo airport forced it \"to suspend or divert flights used to transport vital medical supplies such as tetanus vaccines, diabetes medication and blood-transfusion testing equipment.\"", "I try not to invoke my Jewish identity because opinions have value on merits, not ethnicity. But the policing of black celebrities is embarrassing. Also massively hypocritical: US media and Jewish groups are now silent on US backing of openly neo-Nazi Azov Battalion in Ukraine.", "These \"rebels\" were also armed byIsrael, which regularly bombs Syria to help enforce a US blockade. Meanwhile the US occupies 1/3 Syria, stealing its wheat/oil, and imposes sanctions that, as former senior Trump officials brag, have \"crushed\" Syria's economy, causing \"food", "Former Israeli PM Naftali Bennet: NATO “decided that it is necessary to continue to smash Putin, and not to negotiate… They broke off the negotiations, and then it seemed to me that they were wrong.”", "The UN says that Israel's bombing of Syria's Aleppo airport forced it \"to suspend or divert flights used to transport vital medical supplies such as tetanus vaccines, diabetes medication and blood-transfusion testing equipment.\"", "Today is 10th anniversary of the Ghouta chemicalmassacrein Syria. US blamed Syrian gov't, but all evidence points to sectarian death squad rebels. That's why Obama didn't bomb.\n\nThere are Western officials who know more about Ghouta than has been publicly disclosed. Just as the", "These \"rebels\" were also armed by Israel, which regularly bombs Syria to help enforce a US blockade. Meanwhile the US occupies 1/3 Syria, stealing its wheat/oil, and imposes sanctions that, as former senior Trump officials brag, have \"crushed\" Syria's economy, causing \"food"]}