{"michaelmalice": ["hey it's hanukkah\nmaybe cool it with the anti-semitismhttps://t.co/akTcNJyrPg", "Wikipedia: \n7 accounts getting suspended-- \"massacre\"\n14,000 arrests, 19 dead, biggest national guard deployment ever-- \"protests\"", "A two day suspension of maybe 7 accounts for doxxing got an actual Wikipedia page!? Wikipedia is controlled by the MSM journalists. Can’t trust that site anymore.", "Seeing what theyre doing to my dead city is like watching a corpse getting defiled", "Referring to journalists like this as literal demons is an understatement\nHe is correct only in that this is hardly a partisan issue", "Over the weekend, Elon Musk alarmed safety experts by using tactics honed by QAnon, and attracting some of its followers, to suggest that former Twitter managers had ulterior motives for not rooting out child sex abuse images on the platform. My story:https://washingtonpost.com/technology/2022/12/12/musk-child-porn-qanon/…", "theyre used to the Stalinist model of when they silenced a person that person would effectively cease to exist\nthat worked well when there were three tv networks\nit works much much less effectively in 2023", "You mean when big platforms censor users, those people don't vanish into thin air? They just move to a platform that doesn't censor them?\n\nHow shocking! Quite the revelation!", "the \"war\" reference is not an analogy\nthe Federal govt is quite literally at war with large sections of the populace but is picking its battles (cf. Jan 6 martyrs)\nit is not a \"battle of ideas\" when some ideas can be imposed on you via the force of government", "This just proves that the physical \"war\" analogy doesn't work with a battle of ideas. Lying in real war is a vital tactic. Lying in a battle of ideas just means you lose credibility and everyone knows to ignore you.", "George HW Bush apologized for crying when he recalled his daughter who died as a young child, saying he didnt want to come off as a sissy\nIt was one of the most heartbreaking things I ever sawhttps://t.co/liwvPInbfz", "no one went to jail for locking the elderly in homes and introducing disease that killed many of them, nor were those who did so ever in danger from an angry mob\nyou are absolutely correct", "I’m convinced that the stockholm syndrome is so strong that some could witness their friends and family being loaded into the box cars and they’d still be convinced that the system could be salvaged.", "theyre not taking your guns\ntheyre not showing kids sexually explicit material\ntheyre not forcing anyone to get vaccinated\ntheyre not taking away homeowner's stoveshttps://t.co/1Wih7i09tm", "correct\nthe us military killed a bunch of kids in afghanistan by mistake and no one even had a demotion, let alone get fired or charged with murderhttps://t.co/cRftaTptGl", "it not only was envisioned but Hamilton explicitly advocated for integrating corruption into government, knowing it was impossible to separate the twohttps://x.com/realjskatchen//realjskatchen/status/1639306992690003974…"], "feeonline": ["Government cannot \"give\" anything it hasn't first taken from someone", ".@LibertyAndersexplains why you should care about the censorship of@jordanbpeterson", "\"Fascism and communism are not two opposites, but two rival gangs fighting over the same territory... based on the collectivist principle that man is the rightless slave of the state.\" \n\n- Ayn Rand", "The atrocities of socialist regimes are ignored by too many people.", "Do capitalists hate the poor?\n\nClip from Ayn Rand's lecture \"The Sanction of The Victims,\" 1981", "\"Fascism and communism are not two opposites, but two rival gangs fighting over the same territory... based on the collectivist principle that man is the rightless slave of the state.\" \n\n- Ayn Rand", "Orwell didn't know that the government would treat 1984 as an instruction manual.\n\nh/t@SallyMayweather", "The atrocities of socialist regimes are ignored by too many people."], "ap4liberty": ["That's a whole lot of stupid in one headline", "Those are already paid in full in the blood of the men who died freeing them.", "\"A man's rights rest in three boxes. The ballot box, jury box and the cartridge box.” -Frederick Douglass\nPlease donate to support getting my documentary about the Battle of Athens off the ground!https://givesendgo.com/bleedamerican?utm_source=twitter…", "On a visit to Mount Vernon in 2009, I purchased a replica of the dueling pistol owned by our first president George Washington. The pistol rested on my mantle for several years and always served as a focal point of discussion about guns and liberty whenever I entertained", "SHALL NOT BE INFRINGEDhttps://ap4libertyshop.com/products/vx162771-682350367?_pos=6&_sid=edc7181cd&_ss=r…", "That's a whole lot of stupid in one headline", "No amnesty to conservatives who conspired with Democrats for lockdowns during the early days of the pandemic.", "On a visit to Mount Vernon in 2009, I purchased a replica of the dueling pistol owned by our first president George Washington. The pistol rested on my mantle for several years and always served as a focal point of discussion about guns and liberty whenever I entertained", "SHALL NOT BE INFRINGEDhttps://ap4libertyshop.com/products/vx162771-682350367?_pos=6&_sid=edc7181cd&_ss=r…", "Those are already paid in full in the blood of the men who died freeing them."], "tomilahren": ["The people of Maui burned to death. \n\nThe people ofEastPalestine, Ohio, will probably have legs growing out of their ears at some point. \n\nOur veterans are homeless on park benches.\n\nBut what does our government do..\n\nSends 113,000,000,000+ to Ukraine ..", "We are getting played, y’all! Biden Regime Quietly Frees One of 9/11 Terrorist Planners from Gitmo.", "Ohio Train Derailment Has Been A Disaster, AndEastPalestine People Deserve Better From American Leaders: Tomi Lahren – OutKickhttps://outkick.com/ohio-train-derailment-disaster-tomi-lahren-final-thoughts/…", "4 recent attacks carried out by members of this radicalized community and given they only make up 0.6% of the population, perhaps the FBI and DOJ should start focusing some attention there instead of at pro-life Christians and moms at schoolshttps://x.com/i/broadcasts/1MnxnpgNazmGO?t=38m32s…", "The people of Maui burned to death. \n\nThe people of East Palestine, Ohio, will probably have legs growing out of their ears at some point. \n\nOur veterans are homeless on park benches.\n\nBut what does our government do..\n\nSends 113,000,000,000+ to Ukraine ..", "We’ve sent $113 billion to Ukraine, and counting. We shell out tens of millions to house, feed and clothe illegal immigrants, but what about Americans? Maui wildfire victims were promised $700 a family after losing it all. Maui residents have been sounding the alarm over the", "And Zelenskky repeatedly coming here to lecture us on how much more we could do for him also pisses me off. $113 billion is apparently not enough.https://x.com/i/broadcasts/1OdKrjEYWLzKX?t=3m11s…", "Today is Monday, September 11th and it marks the 22nd anniversary of the radical islamic terror attacks that killed some 3,000 Americans.\n\nIf you’re wondering where our president is today, it’s not New York, not Ground Zero, not DC, not Shanksville. \n\nHe’s in Alaska"], "tlisfearless": [], "outkick": [".@Tunnel2Towersjoined@TomiLahrenand has been at the forefront in support of our American heroes & their families. They paid off over 30 mortgages this past Independence Day! \n\nVisithttp://T2T.org/donateto help our nation’s heroes by donating $11 a month@Tunnel2Towers#ad", ".@TomiLahren: A 12-year-old boy is removed from his class and lectured by administrators over a Gadsden Flag patch on his backpack. If you have a kid in an industrial indoctrination complex- formerly known as a public school- get them out. Now!", ".@TomiLahren:EastPalestine, OH is a TOXIC WASTELAND and somehow the climate alarmists are SILENT and our sell-out politicians care more about Ukraine. It’s a shame!", "A trans shooter targets, ambushes and slaughters Christian students and staff at a Christian school and the Left spends every moment since trying to blame it on conservatives and Christians. A new low has been reached and@TomiLahrenhas a helluva lot to say.", "Riley Gaines is a HERO and more women need to speak out", ".@TomiLahren: People will be scarred for life because of this and there’s really no accountability?!", "We the People are being LIED to and the worst part is, no one is paying the price!@TomiLahrenjoined@SeanHannityon@FoxNews", ".@TomiLahren: East Palestine, OH is a TOXIC WASTELAND and somehow the climate alarmists are SILENT and our sell-out politicians care more about Ukraine. It’s a shame!"], "foxnewsradio": ["When Covid took the lives of people in her family,@FoxNews'@JaniceDeanwasn't afraid to stand up to injustice. She joins the#FOXNewsRundown#podcastwith why she felt empowered to make her voice heard.https://buff.ly/3z40CwO", "@JimmyFaillajoins@KennedyNationto criticize President Joe Biden for being in Alaska, rather than attending memorial services in New York City, Washington D.C., or Pennsylvania in honor of the September 11th, 2001 terror attacks.https://buff.ly/3rWFeoT", "#FOXAcrossAmericahost@JimmyFaillajoins the@JaniceDeanpodcast for a conversation about his family, his love for his country, & how he got his start at@FOXNewsafter working as a NYC cab driver. You don't want to miss this!https://buff.ly/3bYMBaw", ".@Kennedynationproclaims, “it’s time to demand more from our elections!”https://buff.ly/3rWFeoT", "When Covid took the lives of people in her family,@FoxNews'@JaniceDeanwasn't afraid to stand up to injustice. She joins the#FOXNewsRundown#podcastwith why she felt empowered to make her voice heard.https://buff.ly/3z40CwO", "When#Covidtook the lives of people in her family,@FoxNews@JaniceDeanwasn't afraid to stand up to injustice or@andrewcuomoHear our complete, unedited interview with Janice on#FOXNewsRundown#extra#podcasthttps://buff.ly/3z40CwO", ".@Kennedynationproclaims, “it’s time to demand more from our elections!”https://buff.ly/3rWFeoT", "@JimmyFaillajoins@KennedyNationto criticize President Joe Biden for being in Alaska, rather than attending memorial services in New York City, Washington D.C., or Pennsylvania in honor of the September 11th, 2001 terror attacks.https://buff.ly/3rWFeoT"], "monicacrowley": ["“And the angel said unto them, Fear not: for, behold, I bring you good tidings of great joy, which shall be to all people.\n\n“For unto you is born this day in the city of David a Saviour, which is Christ the Lord.”  Luke 2: 10-11", "Here it is. \n\nThe Ukraine war is just a lever to advance the World Economic Forum-led Great Reset.\n\nYou are paying to destroy freedom. \n\nIt’s long past time to end this bullshit.", "Not a good day for the pro-war regime in Washington", "Fear is the regime's favorite - and most effective - weapon", "114 people burned to death in Maui \n\nOver 1000 people are still missing, including children\n\nand Biden is out here joking about how hot the ground is", "Biden doesn’t give AF about the suffering people of Maui. \n\nOr the suffering people of East Palestine, Ohio. \n\nOr the suffering people in border towns. \n\nOr the suffering people anywhere in America.", "Not a good day for the pro-war regime in Washington", "2 years ago today, 13 American heroes were murdered by a terrorist in Kabul, Afghanistan\n\nRemember them & honor their service & sacrifice.\n\nBiden’s fatal, catastrophic withdrawal demands accountability. \n\nHe’s put America Last, but can we at least put these brave Americans First?"], "bucksexton": ["Report on the return of the Waukesha Christmas parade- In referencing what happened last year, NBC News does not use the following words a single time:\n- murder \n- terrorism \n- hate \n- crime\n- motive \n- white \n- black", "Joy Behar implies that the people ofEastPalestine voted for Trump, so they got what they deserve. \n\nThe psychotic contempt of idiotic elites for Trump *voters* has corroded brains and souls", "Rejecting the prospect of a ceasefire in a war with more bloodshed every day and no end in sight is madness. But that’s where the Biden White House stands on it.", "Biden’s horrible Transportation Secretary, and his media quislings, spent last week claiming that Trump deregulation led toEastPalestine \n\nEven WaPo now admits, that was bullshit. But libs don’t care. Lying was the point.", "The regime is so insecure in its own mind that it must go through this laughable pretense of security theater", "Joy Behar implies that the people of East Palestine voted for Trump, so they got what they deserve. \n\nThe psychotic contempt of idiotic elites for Trump *voters* has corroded brains and souls", "Rejecting the prospect of aceasefirein a war with more bloodshed every day and no end in sight is madness. But that’s where the Biden White House stands on it.", "I read headlines like this and come away even more certain that the New York Times is an instrument of evil where truly bad people are in charge"], "clayandbuck": ["\"The one true and pure ideal this country was started with was the idea of freedom.\"\n\nListen to Rush Limbaugh's timeless wisdom about the fundamental link of freedom and the United States.", "Without Donald Trump, The Washington Post is struggling, losing 500,000 subscribers, and layoffs are on the way.\n\nFor more on this story, follow the link:https://l8r.it/q5YPShare some sense in an insane world by liking, following and sharing your favorite C&B content!", "We can't protect our own border, but McConnell thinks Ukraine's border is our top priority.", "Biden’s incompetence knows no bounds. He may have used a $400,000 missile to shoot down a $12 balloon belonging to a hobby club.\n\nFor more, follow the link:https://l8r.it/QsSi", "\"The one true and pure ideal this country was started with was the idea of freedom.\"\n\nListen to Rush Limbaugh's timeless wisdom about the fundamental link of freedom and the United States.", "Biden’s incompetence knows no bounds. He may have used a $400,000 missile to shoot down a $12 balloon belonging to a hobby club.\n\nFor more, follow the link:https://l8r.it/QsSi", "With everyone talking about this story:https://tabletmag.com/sections/history/articles/david-garrow-interview-obama…Watch Rush Limbaugh predict it all in back in 2017...", ".@RandPaulreacts to the Durham Report: \"The FISA court should not be used on Americans.\"\n\nInterview:https://clayandbuck.com/senator-rand-paul-on-the-dangers-of-ai/…Podcast:https://iheart.com/podcast/1119-travis-and-sexton-57927691/…"], "iheartradio": ["Huge congratulations to@wizkidayoon this incredible milestone!Listen here:https://ihr.fm/WizkidRadio", "@yasix@halseyVote using these hashtags:#Yasi#FaveTourPhotographer#iHeartAwardsAnd vote on:http://iHeartRadio.com/Awards", "Today we honor the lives of those we lost on September 11th, 2001.#NeverForget", "Next week join the global movement ending extreme poverty with@GlblCtzn.#GlobalCitizenFestivalListen:https://ihr.fm/GlobalCitizen", "Are you adding@iameden's song to your playlist?Listen here:https://ihr.fm/EDENradio", "@heisremax@selenagomezVote using these hashtags:#CalmDown#BestMusicVideo#iHeartAwardsAnd vote on:http://iHeartRadio.com/Awards", "Next week join the global movement ending extreme poverty with@GlblCtzn.#GlobalCitizenFestivalListen:https://ihr.fm/GlobalCitizen", "My favorite ladListen to@NiallOfficialhere:https://ihr.fm/NiallHoranTW[: noah_35mm_baby⁠]"], "glennbeck": ["We shouldn’t have to tell the president to NOT make the Catholic sign of the cross in front of the Prime Minister ofIsrael. But yet, here we are...", "Churches, people of faith, and religious institutions are under attack from all directions. Tonight on Glenn TV, I expose the latest tactics and explain why we must NOT be silent.", "Does the Left REALLY care about anti-Semitism? Case in point: when Trump met with Kanye, the NYT was eager to quote Zionist Organization of America president Morton Klein. But when Mort gave me the Defender ofIsraelAward, the media tried to destroy him.", "People of faith are the hardest to demoralize and subvert. That's why Christians are being targeted first. With everything burning down around us, we will STAND.", "The 20-year War on Terror raked in $8 TRILLION in profits for the military industrial complex. I wonder ... is that why we're already funding ANOTHER \"forever war\" in Ukraine?!", "Do we even know what \"mutually assured destruction\" means anymore? A nuclear war between the US and Russia wouldn't just wipe us out. The nuclear winter that follows could kill 5 BILLION people.", "Asa Hutchinson's interview with Tucker reminded me of one thing, the Hindenburg burning down in 29 seconds.#BlazeMediaSummit", "East Palestine Ohio resident Katlyn Schwarzwaelder tells me the EPA-associated agency testing the air for toxins asked her to sign a contract to \"indemnify, release and hold harmless\" the groups involved from legal claims, including injury. She refused to sign but 340 others did."], "lpnh": ["Stop pretending like you give a damn about antisemitism when these antisemites get 8 billion dollars and an endless supply of weapons.#Ukraine", "You’re a fucking genocide apologist. \n\nYou think 45,000 deaths is a lot? Listen to@mannion4nhlist the number of deaths historically after guns bans.", "Hey@Israelwe have unconfirmed reports that there’s a Hamas base inside this car.", "Call 1-833-STOPWAR now and tell your representative and ask them to support HJ Res 87 and SJ Res 56 to stop supporting the Saudi blockade of Yemen that started under Obama, continued under Trump, and lingers on today under Biden.", "The parasitic class in D.C. used the events of 9-11 to launch an aggressive war of terror in the Middle East, killing and displacing millions of innocent people. \n\n22 veterans a day kill themselves because those parasites decided to exploit the events of 9-11 and used it to", "Hey@Israelwe have unconfirmed reports that there’s aHamasbase inside this car.", "You’re a fuckinggenocideapologist. \n\nYou think 45,000 deaths is a lot? Listen to@mannion4nhlist the number of deaths historically after guns bans.", "This gets voted on TOMORROW!\nHundreds of thousands of men, women and children have been bombed and starved to death by the Saudis in Yemen with the full support of the United States.\nCall 1-833-STOPWAR and ask your Senator to support Senate Joint Resolution 56!\nWE CAN STOP THIS!"], "jeffdeist": ["What happens when politics drops its democratic pretenses and politicians openly seek to vanquish their opponents?https://store.mises.org/A-Strange-Liberty-Politics-Drops-Its-Pretenses-P11272.aspx…", "Keep in mind the Soviet Union didn't \"work\" but it lasted 70 years while murdering, impoverishing, and starving millions.\n\nEven with rotting missile silos and empty stores it lasted decades.\n\nAnd even today many older Russians view Stalin favorably.https://rferl.org/a/stalin-s-appeal-surging-among-russians-opinion-poll-suggests/29884485.html…", "If you still think that the Woke cult will at any point realize their plans aren't working and abandon them, please stop thinking that right away. It's a cult. That's not how this works.", "Anti-market mentality thrives in the very countries which benefit the most from the material abundance capital investment creates. \n\nWe all walk on paths we didn't clear when it comes to food, shelter, energy, transportation, and countless other things we take for granted.", "Ex- presidents should GO AWAY and live quietly, like Truman and Jimmy Carter.", "New!\n\nWith foreword/intro by Paul Gottfried & Tom DiLorenzo.", "What happens when politics drops its democratic pretenses and politicians openly seek to vanquish their opponents?https://store.mises.org/A-Strange-Liberty-Politics-Drops-Its-Pretenses-P11272.aspx…", "Ex- presidents should GO AWAY and live quietly, like Truman and Jimmy Carter.", "Another reminder that the Left is serious.", "Lots of people are above the law, and everyone knows it. \n\nThey’re named:\nBush\nClinton\nCheney\nObama\nPelosi\netc etc", "This is truly a stomach-churning display of the self-congratulatory bubble elites live in. Bernanke arguably wrecked millions of lives through his role in distorting both housing and equity markets. We should study him and Greenspan as cautionary tales, not celebrate them.", "100% true. Takes courage for@RepThomasMassieto say it. \n\nThe federal government is a lawless mess.", "I stand by this."], "monetary_metals": [], "antiwarcom": ["Former Israeli PM Bennett Says US ‘Blocked’ His Attempts at a Russia-Ukraine Peace Deal\nBennett says the US and its Western allies decided to 'keep striking Putin' and not negotiate\nby Dave DeCamp@DecampDave#Russia#Ukraine#diplomacy#Israel#Bennetthttps://news.antiwar.com/2023/02/05/former-israeli-pm-bennett-says-us-blocked-his-attempts-at-a-russia-ukraine-peace-deal/…", "Remember when western media considered bombing cities as perfectly OK?", "US Foreign Policy in One Image\nWoke Bombs Are No Better than MAGA Ones\nby William Astore#war#foreignpolicy#militaryindustrialcomplex#Biden#Trump#Obama#Bush#imperialismhttps://antiwar.com/blog/2023/06/12/us-foreign-policy-in-one-image/…", "Daniel Ellsberg, RIP\nThe Antiwar Movement's Hero, Dies at 92#DanielEllsberg#Ellsberg#PentagonPapers#militaryindustrialcomplexhttps://politico.com/news/2023/06/16/daniel-ellsberg-vietnam-pentagon-papers-obit-033499…", "Former Israeli PM Bennett Says US ‘Blocked’ His Attempts at a Russia-Ukraine Peace Deal\nBennett says the US and its Western allies decided to 'keep striking Putin' and not negotiate\nby Dave DeCamp@DecampDave#Russia#Ukraine#diplomacy#Israel#Bennetthttps://news.antiwar.com/2023/02/05/former-israeli-pm-bennett-says-us-blocked-his-attempts-at-a-russia-ukraine-peace-deal/…", "Daniel Ellsberg, RIP\nThe Antiwar Movement's Hero, Dies at 92#DanielEllsberg#Ellsberg#PentagonPapers#militaryindustrialcomplexhttps://politico.com/news/2023/06/16/daniel-ellsberg-vietnam-pentagon-papers-obit-033499…", "How America Took Out The Nord Stream Pipeline\nby Seymour Hersh@SeymourHersh#NordStream#NordStream2#Russia#Germanyhttps://seymourhersh.substack.com/p/how-america-took-out-the-nord-stream…", "Remember when western media considered bombing cities as perfectly OK?"], "antiwar": [], "jonahdispatch": ["Amazing how the#ZelenskyWarCriminalis trending because Russia is butt hurt over a blown up bridge, when Russia's been blowing up schools, hospitals, and apartment complexes since February.", "Robert F. Kennedy is a dangerous crackpot, Part 3,211,921.c", "For those of you trying to drive into or out of or thru Philly along I-95, just give up. Shelter in place. Read a book, whatever.", "Weird how whenever “the Jews” are trending on Twitter it’s pretty much never to say something nice.", "Amazing how the#ZelenskyWarCriminalis trending because Russia is butt hurt over a blown up bridge, when Russia's been blowing up schools, hospitals, and apartment complexes since February.", "Robert F. Kennedy is a dangerous crackpot, Part 3,211,921.c", "If your complaint is that the Jones judgment was excessive, that’s a colorable argument, I guess. If you describe what Jones did as “speaking out” you’re carrying water for a great and obvious evil and declaring yourself a fool or a liar or both.", "If “the Regime” is offended by claims that a bunch of parents faked the wanton slaughter of their own children, maybe the “the Regime” is more right than the empty headed poseurs who use the word “regime” as if they know what it means."], "thedispatch": [".@JonahDispatch: I remember saying to Charles Krauthammer, \"This thing is gonna end in tears no matter what, so you might as well do the right thing.\n\nThe takeaway from so many people at Fox was \"this thing is gonna end in tears no matter what, so let's just make a quick buck.\"", "We’re suffering an epidemic of childishness.", "Welcome to The Dispatch. Here’s a little about what we’re doing – and why.", "We’re suffering an epidemic of childishness.", ".@JonahDispatch: I remember saying to Charles Krauthammer, \"This thing is gonna end in tears no matter what, so you might as well do the right thing.\n\nThe takeaway from so many people at Fox was \"this thing is gonna end in tears no matter what, so let's just make a quick buck.\"", "From@JonahDispatch: Defending Conservatism—From the Righthttps://thedispatch.com/newsletter/gfile/defending-conservatism-from-the-right/…", "As Mike Lee notes, a conflict with Russia in Ukraine is dangerous. But so is not doing anything––it rewards the behavior most damaging to the United States' image and interests.\n\nThis is why Russian chess grandmaster@Kasparov63has argued against appeasing Iran (and Russia).", "We’re suffering an epidemic of childishness."], "philvischer": ["Actually footage of mortally-wounded balloon falling into populated area.", "Remember kids, when God commands us to \"welcome the sojourner\" what he REALLY means is \"kick out the sojourner.\"\n\nThat's just the plain reading of Scripture.", "Next installment of our series is out, with the author of Jesus and John Wayne and target of many a theobro's ire...@kkdumez", "Trumpism, sexism, ethnic nationalism, abuse scandals.  Many have walked away from the church over the last few years.  We talk to some who have seen the worst, and yet remain.\n\nThis week I sit down with Lecrae.", "Actually footage of mortally-wounded balloon falling into populated area.", "A Bible scholar engages with a very, very pink movie and a unique cultural moment.  Amy Peeler writing for the Holy Post...", "I do find it amusing to hear people say \"But we can't indict a former head of state\" as I sit in a state that saw 3 consecutive ex-governors imprisoned for crimes committed during their terms.", "A little surprised to have to explain that a politician using state power to punish a private company for opposing a piece of legislation isn't something Republicans would historically celebrate.\n\nReagan would spit out his jelly bellies."], "kaitlynschiess": ["Advent is a good time to remember that “biblical womanhood” must include the scene in Luke 1 when two pregnant women celebrate their new motherhood by passionately discussing the overthrow of every earthly empire.\n\n“He has brought down the mighty from their thrones.”", "The gospel was preached, I got to wear a red dress, a wedding happened during the service, a baby in the balcony waved as we left. The best kind of Sunday!", "when a group of Bible & theology students watch the Left Behind movies", "“What if I am a woman? Is not the God of ancient times the God of these modern days? Did he not raise up Deborah to be a mother and a judge inIsrael? Did not Queen Esther save the lives of the Jews? And Mary Magdalene first declare the resurrection?” \n\n- Maria W. Stewart", "I’m so thankful for this endorsement from@JemarTisby- not only because of how much I respect him as a historian, but because this perfectly describes how I wanted people to experience the book!", "We sang this song at my seminary graduation, and I wept in my cap and gown because I so deeply felt the brokenness of the world.\n\nToday I sat in a church pew and we sang it and I cried because now I know that the dark won’t stop the light from getting through, praise God.", "You can’t tell, but this was the moment last night my heart burst.\n\nThe last time I wrote a book, my world fell apart. This time I laughed, cried, and hugged my dear community. Someone heard a little of this story recently and said, “That sounds like resurrection.”\n\nYes, it does.", "You cannot \"politicize\" our national disaster of gun violence when it is of our own political making."], "dukedivinity": [], "dallasseminary": [], "holypostpodcast": ["Are you just barely hanging on to your faith? Here is what@lecraewants to say to you:", "@bethmoorelpmtalks with@KaitlynSchiessabout putting her faith in Christ himself rather than in Christian people, and how that frees her up to love people better.", "I'm sorry Elon, but we're still going to say Merry Twittermas, not Merry Xmas", "NEW TRAILER! Why I'm Still a Christian - A Holy Post Special Special Series featuring@lecrae@kkdumez@JemarTisby@drmooreFirst episode drops on Monday, September 18! Make sure to subscribe to The Holy Post wherever you listen to podcasts so you don't miss it!", "Are you just barely hanging on to your faith? Here is what@lecraewants to say to you:", "@bethmoorelpmtalks with@KaitlynSchiessabout putting her faith in Christ himself rather than in Christian people, and how that frees her up to love people better.", "NEW TRAILER! Why I'm Still a Christian - A Holy Post Special Special Series featuring@lecrae@kkdumez@JemarTisby@drmooreFirst episode drops on Monday, September 18! Make sure to subscribe to The Holy Post wherever you listen to podcasts so you don't miss it!", "It only makes sense that Rainn and Skye made a pretty great interview pair!What did you think of episode 565?\n\nFull episode is below if you haven't listened yet!https://loom.ly/e2pJXg8#podcast#christianity#love#jesuschrist#holypost#bible"], "ksprior": ["… the Holy Spirit, the one who prompted this prayer and who prompted this unknown messenger who sat in the same seat before me to write these specific words to be found by me today.\n\n4/end", "I’m not sure if I’ve ever read a book as beautifully written and as quietly powerful as this one. This book is as exquisite as it is convicting.", "While traveling throughout Morocco and Marrakesh on one of several trips I made there years back, I found this ancient piece of tile in a pile of debris in a building under repair. I took it (with permission) and brought it home (it’s as heavy as concrete!). With the news of the", "“This moment is exemplified not just by rancid bigotry but also a posture of unceasing combativeness and pugilism. It's exemplified by an instinctive aversion to tenderheartedness, forgiveness, and gentleness.” — ⁦@samueld_james⁩", "I’m not sure if I’ve ever read a book as beautifully written and as quietly powerful as this one. This book is as exquisite as it is convicting.", "This morning I found a fallen nest in the grass. It spoke to me of seasons passing, of letting go of things whose time has come and gone. Like mewling, featherless hatchlings, we too must grow and fly and be free. Not for ourselves but for the purposes for which we were made.", "When I was attacked by a dog while running two days ago, two sweet, older women who were driving by saw me staggering in the road and turned around to come back and help. They stayed with me until the police and ambulance arrived. They helped me sit down and gave me water to", "While traveling throughout Morocco and Marrakesh on one of several trips I made there years back, I found this ancient piece of tile in a pile of debris in a building under repair. I took it (with permission) and brought it home (it’s as heavy as concrete!). With the news of the"], "karenswallowp": [], "dukeu": ["A statement from President Vincent E. Price. Find resources for the Duke community:https://duke.is/4/ceaq", "Tonight’s@DukeChapelcarillon recital featured the alma mater of University of North Carolina at Chapel Hill. We are standing with our friends, family and colleagues at@UNC.", "A statement from President Vincent E. Price. Find resources for the Duke community:https://duke.is/4/ceaq"], "thiaballerina": ["It’s not just health care that they’re refusing to give you. It’s peace of mind for your family, the quality of life you experience, the release of financial burden, the place in a happier society, dying w/dignity and even a longer life span, that they’re taking from you.", "Being anti-war is not ring wing or left wing. Only lunatics want war.", "Food. Water. Shelter. Health care. Medicine. Education. Are human rights. The bare fkn minimum.", "Kids are still in cages.Ppl are still cutting pills in half to live.Millions unable to afford health care will go untreated.17M children will go hungry today. And these gaslighting mfs in office aren’t even arguing about how little to give you anymore-while they expect your vote.", "Food. Water. Shelter. Health care. Medicine. Education. Are human rights. The bare fkn minimum.", "Kids are still in cages.Ppl are still cutting pills in half to live.Millions unable to afford health care will go untreated.17M children will go hungry today. And these gaslighting mfs in office aren’t even arguing about how little to give you anymore-while they expect your vote.", "Stop making excuses for a weak ass admin that refuses to give you a gd thing. Health care. Food. Water. The bare fkn minimum. Life-saving meds.The bare fkn minimum. Housing. The bare fkn minimum. Education.The bare fkn minimum.This isn’t a pony. This. Is. The. Bare. Fkn. Minimum.", "Another $2.5B to Ukraine on top of the $165B sent over the past 11 months, while Congress ends the free-lunch-for-all program and our kids go hungry. These ppl are real-life villains."], "primoradical": ["Never forget that the CIA created Al Qaeda & the Taliban as part of Operation Cyclone.\n\nOver the course of 13 years, the US government spent over $20 billion arming & training the anti-Soviet mujahideen.\n\nSince then, history has repeated itself w/ the CIA arming ISIS & Azov Nazis", "AMERICA DID START THE WAR.\n\nThat’s an objectively true statement.\n\nYou just want to ignore 30 years of post-Cold War NATO expansion, us tearing up the ABM & INF treaties, a 2014 US-backed coup, and 8 years of arming Azov Nazis.", "You’re not anti-war. You’re voting to arm Nazis and push us closer to nuclear war.\n\nThis conflict began in late 2013 via a US coup. \n\nIt then continued on with the US arming and funding the Nazi Azov & Aidar battalions.", "This war began 9 years ago, and it was started by Washington.", "Never forget that the CIA created Al Qaeda & the Taliban as part of Operation Cyclone.\n\nOver the course of 13 years, the US government spent over $20 billion arming & training the anti-Soviet mujahideen.\n\nSince then, history has repeated itself w/ the CIA arming ISIS & Azov Nazis", "George W. Bush killed one million Iraqis.", "You’re not anti-war. You’re voting to arm Nazis and push us closer to nuclear war.\n\nThis conflict began in late 2013 via a US coup. \n\nIt then continued on with the US arming and funding the Nazi Azov & Aidar battalions.", "This war began 9 years ago, and it was started by Washington."], "ronplacone": ["Two totally normal headlines. Nothing to see here.", "The Supreme Court is going to try to crush the ability to Strike…", "They just say the quiet part out loud now.", "Capitalism and lack of services, which is caused by the first thing. Can you put the $30 million to housing now? Here, I’ll even say it in academic in a following tweet so you can all have a colloquium and smell each others’ farts", "Two totally normal headlines. Nothing to see here.", "They just say the quiet part out loud now.", "I’m already enrolled in “‘We Came, We Saw, He Died’ And Other Diplomatic Solutions.” Stoked!", "The Supreme Court is going to try to crush the ability to Strike…"], "auburnfootball": ["𝓡𝓮𝓶𝓮𝓶𝓫𝓮𝓻 𝓪𝓷𝓭 𝓗𝓸𝓷𝓸𝓻 𝓽𝓱𝓮 𝓑𝓻𝓪𝓿𝓮#MemorialDay", "We could have quit, yet we chose to serve.\n\n𝗧𝗵𝗲 𝗝𝗼𝘂𝗿𝗻𝗲𝘆: 𝗘𝗽. 𝟭𝟰 → FULL episodehttp://auburntige.rs/thejourney", "𝐒𝐈𝐆𝐍𝐄𝐃Welcome to the Auburn Family,@_JayRashaan", "Locked arms and fought for the Auburn Family", "𝓡𝓮𝓶𝓮𝓶𝓫𝓮𝓻 𝓪𝓷𝓭 𝓗𝓸𝓷𝓸𝓻 𝓽𝓱𝓮 𝓑𝓻𝓪𝓿𝓮#MemorialDay", "𝐒𝐈𝐆𝐍𝐄𝐃Welcome to the Auburn Family,@_JayRashaan", "𝗢𝗻 𝘁𝗵𝗶𝘀 𝗱𝗮𝘆 in 1971, QB Pat Sullivan was awarded Auburn’s first@HeismanTrophyin program history", "Putting the nation on noticePayton Thorne has been selected to the 𝐆𝐨𝐥𝐝𝐞𝐧 𝐀𝐫𝐦 𝐀𝐰𝐚𝐫𝐝 Watch List!"], "coachbrucepearl": ["We Remember And We Will Never Forget So That It Never Happens Again! ⁦@AIPAC⁩ ⁦@CUFI⁩ ⁦@_USIEducation⁩ ⁦@StandWithUs⁩", "What a great State we live in! Honored to Light the Menorah at The Governors Mansion in Montgomery Alabama tonight, celebrating the miracle of Hanukkah and the survival of the Jewish people! Thank you Governor Ivey!", "Incredible night watching two ofIsrael's best pro teams fromTelAvivand Jerusalem. Making some great connections to get our guys some great opportunities! And yes, The Abraham Accords Peace makers are well represented in this picture!", "Happy Hanukkah! Brandy and I are Grateful and Blessed to be able to celebrate the survival of the Jewish people with Auburn Hillel!", "We Remember And We Will Never Forget So That It Never Happens Again! ⁦@AIPAC⁩ ⁦@CUFI⁩ ⁦@_USIEducation⁩ ⁦@StandWithUs⁩", "What a great State we live in! Honored to Light the Menorah at The Governors Mansion in Montgomery Alabama tonight, celebrating the miracle of Hanukkah and the survival of the Jewish people! Thank you Governor Ivey!", "Incredible night watching two of Israel's best pro teams from Tel Aviv and Jerusalem. Making some great connections to get our guys some great opportunities! And yes, The Abraham Accords Peace makers are well represented in this picture!", "Happy Hanukkah! Brandy and I are Grateful and Blessed to be able to celebrate the survival of the Jewish people with Auburn Hillel!"], "senkatiebritt": ["The Israeli people are under constant threat from Iranian proxies, including Hezbollah.\n\nWe must stand strongly withIsraelagainst terrorism.", "When you go to the border, when you look in the eyes of the overworked and overwhelmed Border Patrol agents, when you listen to the gut wrenching stories of the innocent women and children victimized by the cartels, the painful toll of this humanitarian crisis becomes clear.", "Now, more than ever, we must stand withIsrael.", "Wishing you and your family a blessed Palm Sunday!\n\nJohn 12:13", "Now, more than ever, we must stand with Israel.", "The Israeli people are under constant threat from Iranian proxies, including Hezbollah.\n\nWe must stand strongly with Israel against terrorism.", "\"If we, as leaders of the greatest nation in the world, are not fighting to protect the most vulnerable, we are not doing our job.\"", "Under President Biden’s watch, it is open season for human traffickers, drug cartels, and terrorists."], "laurenboebert": ["House Republicans will be launching a probe into Buttigieg’s non-response to the train derailment inEastPalestine.\n\nThis utter dereliction of duty cannot be normalized. People are suffering.", "It’s been nearly two weeks and Mayor Pete has yet to go toEastPalestine, Ohio.\n\nPerhaps they should consider changing the name of their town to Ukraine if they want the Biden Regime to pay better attention.", "President Trump is heading toEastPalestine next week.\n\nBiden has announced no such plans.\n\nSays everything.", "Other than Tucker, looks like the mainstream media has given up discussingEastPalestine, Ohio.\n\nWhat a disgrace our media is.", "The sacrifice of Americans willing to lay down their lives for the ideals outlined in our Constitution should never be forgotten.\n\nToday, we remember every man and woman who made that ultimate sacrifice.", "This excuse falls completely flat. Pete is absent on the job and has been from day one.", "Rather than utilizing American energy, we’re cutting dirty deals with the Saudis.\n\nBiden should be ashamed of himself, especially when this directly contradicts his campaign rhetoric on Saudi Arabia.\n\nLies and more lies.", "FEMA officials in Maui are staying at a $1,000 a night luxury hotel while they gave every family in Hawaii $700 for recovery after the fires.\n\nThe utter contempt this government has for the American people is absolutely disgusting."], "repmtg": []}