{"senkatiebritt": ["I was proud to stand with@SpeakerMcCarthyand@SenateGOPand@HouseGOPcolleagues today in support of restoring fiscal sanity across our nation.\n\nRepublicans have the only plan that avoids default, grows the economy, drives down inflation, and curbs wasteful government spending.", "When executives drive banks into failure with reckless business decisions, they shouldn’t be allowed to use their golden parachutes to escape responsibility while customers, employees, and hardworking American families are left footing the bill.https://altoday.com/archives/51842-katie-britt-and-senate-colleagues-introduce-a-bipartisan-bill-to-cut-compensations-from-failed-bank-executives…", "We must confront the Chinese Communist Party threat with strength.\n\nHappy to join@SenTomCottonin this important effort to hold the CCP accountable and protect America's critical interests.", "The spy balloon is only the latest instance in an ongoing trend of aggressive CCP behavior.\n\nThe FBI says they open a new counterintelligence case against China about twice a day. Continued weakness is not the answer. We must modernize our defense and intel capabilities.", "Dianne Feinstein lived a life of service, blazing a path for women in the Senate and girls across our nation. In the face of tragedy and tribulations throughout her career, she was fearless. Our prayers are with her loved ones.", "I want to keep the government open, and shut down the border. \n\nBut Democrats seemingly want to keep the border open, even at the expense of shutting down the government.", "It’s great to see my Democratic colleagues affirming the legitimacy of the Supreme Court today.\n\nSounds like there are some new#Keep9supporters!", "The Air Force determined that Space Command HQ belongs on Redstone Arsenal. Now, President Biden has hijacked their objective decision to play politics with our national security. My full statement:https://britt.senate.gov/press-releases/senator-katie-britt-biden-admin-not-basing-space-command-hq-on-redstone-arsenal-places-politics-over-national-security-defense-modernization/…", "I want to wish all Alabamians a happy National Peanut Day. Our state is proud to be the home of the Peanut Capital of the World!", "“Hey Y’all” vs. “Bless Your Heart”#Barbenheimer", "Community banks are the backbone of Main Streets across Alabama and America. On@BankingGOP, I’m fighting to ensure these local institutions can continue their critical work.", "To all the dads across Alabama and our great country, Happy Father’s Day!", "Now, more than ever, we must stand with Israel.", "The Israeli people are under constant threat from Iranian proxies, including Hezbollah.\n\nWe must stand strongly with Israel against terrorism.", "We wrapped up our trip with a visit to Harris Ranch this afternoon.\n\nThe raw numbers alone prove that there is an unprecedented national security and humanitarian crisis at the border. However, seeing it up close was truly eye-opening the past 24 hours.", "\"If we, as leaders of the greatest nation in the world, are not fighting to protect the most vulnerable, we are not doing our job.\""], "laurenboebert": ["The Satanic Temple is now opening abortion clinics that will perform abortion as a Satanic ritual.\n\nThis is what the Left really meant by “safe, legal and rare”.", "House Republicans will be launching a probe into Buttigieg’s non-response to the train derailment inEastPalestine.\n\nThis utter dereliction of duty cannot be normalized. People are suffering.", "It’s been nearly two weeks and Mayor Pete has yet to go toEastPalestine, Ohio.\n\nPerhaps they should consider changing the name of their town to Ukraine if they want the Biden Regime to pay better attention.", "President Trump is heading toEastPalestine next week.\n\nBiden has announced no such plans.\n\nSays everything.", "Pete Buttigieg is nowhere to be found YET AGAIN as toxic chemicals are spewing out inEastPalestine, Ohio after a train crash.\n\nWhile he’s worried about “racist highways”, our nation’s transit systems are falling apart.", "Other than Tucker, looks like the mainstream media has given up discussingEastPalestine, Ohio.\n\nWhat a disgrace our media is.", "Biden spent five hours in Kyiv.\n\nThat’s five hours more than he spent inEastPalestine.", "We hear stuff so much we forget how dire the situation really is in our nation right now.\n\n10,000 illegals coming across the border in a single day is a complete crisis.\n\nPeople on the FBI Terror Watch List coming across the border is a complete crisis.\n\nA President who has", "Joe Biden went to the murder capital of America, Chicago, to debut his BIDENOMICS plan.\n\nYes, it's actually called BIDENOMICS.\n\nChicago is the right location, since Biden has murdered the successful Trump economy and replaced it with a disaster.\n\nInflation is at levels we never", "This excuse falls completely flat. Pete is absent on the job and has been from day one.", "Two years ago today, the complete incompetence of Joe Biden and his administration caused the deaths of thirteen selfless heroes.\n\nWhen their bodies came home days later, he spent the ceremony checking his watch.\n\nNever forget what this administration has done.", "The sacrifice of Americans willing to lay down their lives for the ideals outlined in our Constitution should never be forgotten.\n\nToday, we remember every man and woman who made that ultimate sacrifice.", "FEMA officials in Maui are staying at a $1,000 a night luxury hotel while they gave every family in Hawaii $700 for recovery after the fires.\n\nThe utter contempt this government has for the American people is absolutely disgusting.", "Biden announced that he’s handing $6,000,000,000 to Iran on 9/11.\n\nEvery time I think he’s hit rock bottom, he outdoes himself.", "New York City is retrofitting airplane hangars at JFK airport and leasing out unused college dorms to deal with all the illegals that are about to arrive because of Title 42.\n\nEven CNN is now reporting what a complete disaster is about to befall our nation when Title 42 expires."], "repmtg": ["EastPalestine, Ohio is undergoing an ecological disaster bc authorities blew up the train derailment cars carrying hazardous chemicals and press are being arrested for trying to tell the story.\n\nOh but UFO’s!\n\nWhat is going on?https://x.com/AmVirtueOrg/status/1624797381739814914/video/1…", "President Trump visits the people ofEastPalestine, Ohio and brings them water & supplies while Joe Biden only cares about pushing more war and US money in Ukraine.\n\nThank you President Trump for continuing to show what America First looks like.", "Wisely, Netanyahu intends to keepIsraelout of the war in Ukraine.\n\nAnd hopefully, yesterday’s bombings don’t get perceived as involvement.\n\nBecause involvement could lead to biblical outcomes and unsurprisingly our leaders seem blinded to understanding & knowledge of this.", "Three years ago today, President Trump signed the Abraham Accords, a remarkable step in the quest for peace in theMiddleEast.\n\nToday, we are on the verge of WW3 because Joe Biden is choosing escalation of foreign wars over peace.\n\nWe need a president who seeks peace again!", "Every American should know the story of Kayla Hamilton, who was raped and murdered by an MS-13 gang member claiming asylum as an unaccompanied minor.", "East Palestine, Ohio is undergoing an ecological disaster bc authorities blew up the train derailment cars carrying hazardous chemicals and press are being arrested for trying to tell the story.\n\nOh but UFO’s!\n\nWhat is going on?https://x.com/AmVirtueOrg/status/1624797381739814914/video/1…", "President Trump visits the people of East Palestine, Ohio and brings them water & supplies while Joe Biden only cares about pushing more war and US money in Ukraine.\n\nThank you President Trump for continuing to show what America First looks like.", "The Democrats and the media declared war in American cities and on the American people.\n\nThey fundraised for it\nThey funded it.\nGot paid and paid themselves.\nAnd left communities in ashes, rubble, and ruin.\n\nAnd we have not forgotten.\n\n2/2"], "bennyjohnson": ["Sen. JD Vance UNLOADS on Regime for IGNORING suffering people ofEastPalestine\"Are we for big business and big government or are we for the people ofEastPalestine? It's a time for choosing.\"", "Chemist testing water inEastPalestine SHOCKS host after revealing children coughing up blood", "Senator JD Vance went toEastPalestine, Ohio what he EXPOSED will SHOCK you— This is what they're hiding...", "Residents ofEastPalestine, Ohio DEBUNK lie on massive deadly chemical spill, reveal how they're REALLY feeling…", "Ohio will never recover from this. \n\nPrayers for East Palestine", "Sen. JD Vance UNLOADS on Regime for IGNORING suffering people of East Palestine\"Are we for big business and big government or are we for the people of East Palestine? It's a time for choosing.\"", "As you watch this black cloud of death encompass this little town don’t miss the 500 private homes in the shot.\n32 small businesses. \n12 restaurants. \n3 city parks.\n2 playgrounds.\nAn elementary school. \nA high school. \n\nPray for East Palestine Ohiohttps://x.com/PapiTrumpo/status/1625308032291729408/video/1…", "Chemist testing water in East Palestine SHOCKS host after revealing children coughing up blood"], "marklevinshow": ["This hasn’t received any big media attention", "These are the two sisters murdered in cold blood by the Palestinians the other day.", "IsraelsendingIDFand medical assistance to assist Turkey and Syria", "1. Barak is the Justice who effectively created judicial tyranny inIsrael.  Current reform efforts to bringIsrael's democracy back into balance is in response to his years of judicial abuse.", "This is pretty amazing, Vivek. It’s called standing on your own two feet.", "This hasn’t received any big media attention", "2. He must also be aggressively questioned about his efforts at appeasing the terrorist Iranian regime.", "These are the two sisters murdered in cold blood by the Palestinians the other day."], "fdrlst": ["As Obama continues construction on his Chicago presidential center, many South Side residents fear displacementhttps://rumble.com/v2ggvru-obama-is-quietly-gentrifying-the-south-side.html…", "Target partnered with a Satan supporter who wants to “eradicate” critics of transgenderism.", "Philadelphia’s $500K Tax-Funded Abortion Bankroll Proves Democrats Want More Than To ‘Codify Roe’", "No, AOC, Abortion Is Not A Jewish Sacrament", "Adam Schiff’s Censure Is The Bare Minimum", "Three Years Later, Trump Deserves A Nobel Peace Prize For The Abraham Accordshttps://thefederalist.com/2023/09/05/three-years-later-trump-deserves-a-nobel-peace-prize-for-the-abraham-accords/…", "Ginni Thomas Transcript From J6 Panel Reveals Witch Hunt Operation Without A Witch", "No, AOC, Abortion Is Not A Jewish Sacrament"], "ksorbs": ["But Christian’s are the extremists for wanting this off prime-time TV.", "JOIN US INISRAEL, 2024!\n\nTHIS IS THE LINK FOR THE VIDEO -https://youtube.com/watch?v=A79Kuy6k1s4…THIS IS THE LINK FOR THE 2024 WEBSITE -http://sorbo2024.heritagestudyprograms.com", "And, of course, it is just a \"coincidence\".", "http://SorboIsraelTrip.comJoin us on this amazing historical trip toIsrael.", "But Christian’s are the extremists for wanting this off prime-time TV.", "And, of course, it is just a \"coincidence\".", "JOIN US IN ISRAEL, 2024!\n\nTHIS IS THE LINK FOR THE VIDEO -https://youtube.com/watch?v=A79Kuy6k1s4…THIS IS THE LINK FOR THE 2024 WEBSITE -http://sorbo2024.heritagestudyprograms.com", "Ready for a historical trip of a lifetime?  Come join me in Israel next May!http://SorboIsraelTrip.com"], "tpaction_": ["The Founders who fought so hard for our independence are rolling over in their grave at what this clown is doing to our nation…", "Too many American lives have been lost at the hands of illegal immigrants crossing our southen border.\n\nBiden and Mayorkas must be impeached for the atrocities that they have enabled to happen in our country.", "NOW ANNOUNCING: TPACTION COALITIONSWe are launching SEVEN COALITIONS to activate our grassroots army in key battleground states• Moms Coalition\n• Latinos Coalition\n• Black Americans Coalition\n• Farmers and Ranchers Coalition\n• Educators Coalition\n• Faith", "January 6 protesters have been neglected and abused in prison for over 2 years while the Biden Administration has enabled it to happen.\n\nThis is disgusting and inhumane that Biden has allowed this to happen.", "Half naked men in women’s attire should not be allowed anywhere near an elementary school, let alone anywhere near children at all.", "Roe v Wade – OVERTURNED\n\nAffirmative Action – STRUCK DOWN\n\nStudent Loan Forgiveness – NOT A CHANCE\n\nDonald Trump gave us one of the greatest Supreme Courts in American history!", "The FBI can’t be trusted. They must be defunded and dismantled", "Only dictators have prosecuted their mainstream political opponents", "Turning Point Action is leading the fight in restoring freedom and sanity to America!", "Mayorkas has failed the American people and he has failed hundreds of thousands of children who may never see their families again", "Sound of Freedom has been a HUGE success.\n\n– Steve Bannon#ACTCON2023", "It doesn’t get much more disgusting than this", "It’s a simple concept, but we need the money and the manpower to get it done"], "jimmyfailla": ["Liberal Policies destroyed the nicest city in the country ...", "There are THOUSANDS of Jordan Neely's riding the subway right now. Rather than protesting the Mayor and Governor who flooded NY with zombie attackers, AOC and the race pimps go after the guy who sprung into action to protect women and kids. GROSS.", "Friendly reminder that if you’re blocking trains or traffic you’re not a protester you’re an inconsiderate A**hole.", "The Nation’s Largest Airport now has a homeless encampment inside of it but don’t worry, your Transportation Secretary is going to make sure it’s diverse enough.", "The idea that a staff of 30 writers wrote this, rehearsed it before the taping, and still thought it was a good idea to air it should be grounds for a career death penalty. This is premeditated Murder 1.", "The backlash to this shameless charade was rightfully harsh. But the Times will chalk it up to “lite fragility”", "There are THOUSANDS of Jordan Neely's riding the subway right now. Rather than protesting the Mayor and Governor who flooded NY with zombie attackers, AOC and the race pimps go after the guy who sprung into action to protect women and kids. GROSS.", "I wanna live in a world where Dems are more concerned w/ violent criminals than a guy singing about them. Yes, the vid is provocative and coulda been called “Bring It On, Fuckers.” But there’s way too my fuckers terrorizing innocents and you can’t stop em by yelling at singers."], "w_terrence": ["Barack Hussein Obama was a racist and anti-semitic President.", "Zelensky is having meetings and steak dinners with celebrities & politicians during a WAR. He did a cover shoot for a magazine during a WAR. We need to stop sending him money! We are making him RICH & FAMOUS. As an American Tax Payer I want a Refund.#UkraineRussianWar", "Attention White People! This White Woman right here wants y’all to know why Whiteness must be destroyed.  \n\nLord Jesus and Moses help us all", "George Soros is not a Holocaust Survivor.  Soros is the Devil and one of the most corrupt humans on planet earth.  He is destroying America and should be exiled from this country\n\nAm I alone on this one or is there other people who feel the same way.", "Barack Hussein Obama was a racist and anti-semitic President.", "BRITTNEY GRINER IS NOT A HERO \n\nThe White House is calling her a Hero and Role Model! She was smuggling drugs & Hates America \n\nThe Marine should have been the first one released from the Russia Prison\n\nRaise your hand if you agree", "Dr. Umar is demanding the government to give Black people ownership of all the ports, water, oil , gold, electricity, gas and land. \n\nHe is also claiming black people deserve reparations for psychological damages for black on black crime and for blacks wanting to date whites", "\" Make no mistake about it...\n\nThe Obama's were the creators and starting point of all the division and current anti-American chaos we are  witnessing in America today. \"\n\nRaise your hand if you agree"], "atensnut": ["The biggest negative impact toEastPalestine since the train derailment ….was when this clown finally showed up.", "Governor Dewine ask CEO of Norfolk for advice before the burn.  Really?  \n\nGovernor Dewine told Biden Administration he would let them know if help was needed…….And then didn’t.   \n\nHe has a lot to answer for how he handled this disasterEastPalestine.", "This senile pathetic shell of a man is an embarrassment and a threat to our national security.", "This is a certainly a suspicious occurrence. … 3 months before disaster.", "They are coming by the thousands and nobody in this Administration gives a Fuck.", "The biggest negative impact to East Palestine since the train derailment ….was when this clown finally showed up.", "Governor Dewine ask CEO of Norfolk for advice before the burn.  Really?  \n\nGovernor Dewine told Biden Administration he would let them know if help was needed…….And then didn’t.   \n\nHe has a lot to answer for how he handled this disaster East Palestine.", "30 million people in Ohio may be in danger and Biden can’t be bothered to comment."], "scottpresler": ["Thank you, President Trump, for delivering thousands of bottles of water, cleaning supplies, & food toEastPalestine, Ohio.", "We need to plaster posters & signs across IN, KY, OH, PA, & WV that say, \n\n“Joe Biden abandonedEastPalestine, OH” \n\n“Joe Biden chooses Ukraine over Americans”", "President Trump, \n\nWhen you visitEastPalestine — since Joe Biden is in Ukraine — ask for people to donate water, non-perishable food items, socks, & mobile laundry trailers.\n\nLet’s give back to the community.", "It makes me incredibly proud that President Trump visitedEastPalestine, bringing goods to help Ohioans. \n\nAt the same time, it makes me incredibly embarrassed that Joe Biden abandonedEastPalestine & chooses to help Ukraine over Americans.#TrumpWater", "Thank you, President Trump, for delivering thousands of bottles of water, cleaning supplies, & food to East Palestine, Ohio.", "Day 38\n\n+154 will die today\n\n# of fentanyl deaths: 5,852\n\nMass shooting equivalent: 1,463", "Day 68\n\n+154 will die today\n\n# of fentanyl deaths: 10,472\n\nMass shooting equivalent: 2,618", "Day 39\n\n+154 will die today\n\n# of fentanyl deaths: 6,006\n\nMass shooting equivalent: 1,501"], "earlyvoteaction": ["It's been 60 days since@ScottPreslerasked RNC chairwoman Ronna McDaniel about her plan to defeat Biden in 2024.\n\nSign our letter today and DEMAND that Ronna give Scott and every Patriot a response.\n\nSign Here:https://wheresronna.com", "Today is day #60 of my asking the @GOPChairwoman for a response.", "It's been 60 days since@ScottPreslerasked RNC chairwoman Ronna McDaniel about her plan to defeat Biden in 2024.\n\nSign our letter today and DEMAND that Ronna give Scott and every Patriot a response.\n\nSign Here:https://wheresronna.com", "Today is day #60 of my asking the @GOPChairwoman for a response."], "pnjaban": ["Thank you@IngrahamAnglefor having me and Layla Jane on tonight!@Liberty_Ctr,@_LiMandri_Jonna& my firm are taking legal action against the Kaiser medical “professionals” who mutilated Layla with top surgery at age 13 for profit. This is malpractice &https://libertycenter.org/cases/layla/", "Thank you@IngrahamAnglefor having me on tonight to discuss the environmental catastrophe inEastPalestine, OH. If you live there and are asked to sign any waiver, get legal advice first! Government/corporate gaslighting (literally) in full effect. Believe your own senses.", "Thank you@IngrahamAnglefor having me and Layla Jane on tonight!@Liberty_Ctr,@_LiMandri_Jonna& my firm are taking legal action against the Kaiser medical “professionals” who mutilated Layla with top surgery at age 13 for profit. This is malpractice &https://libertycenter.org/cases/layla/", "This piece is not paywalled... please read and share if you care about this issue!", "Remember and honor! Freedom isn’t free, and we must remember those do died so that we may be free, as we decide whether or not to stand up for liberty today.", "More, from the thoughtful opinion which is a full rebuke of this case.", "Thank you@IngrahamAnglefor allowing me to explain why There can be no “amnesty” for those that destroyed years of our lives in the name of COVID.\nOur government must also be held accountable for its conspiracy with Big Tech to violate the First Amendment—even the ACLU agrees!", "Thank you@IngrahamAnglefor having me on tonight to discuss the environmental catastrophe in East Palestine, OH. If you live there and are asked to sign any waiver, get legal advice first! Government/corporate gaslighting (literally) in full effect. Believe your own senses."], "dhillonlaw": [], "liberty_ctr": ["We are proud to fight for justice for Layla Jane. Represented by our incredible Founder & CEO,@pnjaban, and Charles LiMandri from LiMandri & Jonna LLP, we are determined to hold her doctors accountable for mutilating her under the guise of “healthcare”.", "ICYMI: Our fearless Founder & CEO, Harmeet Dhillon@pnjaban, stood up for free speech on Capitol Hill last Thursday!#FreeSpeech#FirstAmendment", "Woke culture does not get to change a contract.@pnjabanappears on@nbcbayarea", "The White House must be held accountable for allowing swampy journalists to change the rules in order to silence their colleagues who ask the hard questions. We are ready to fight for@simonateba’s right to do his job.@pnjaban@EricSell@mark_trammell@MurdockJDF", "Freedom for some…perfectly sums up how Gavin Newsom has governed California from day one. This#ThrowbackThursday, we look back on Newsom’s disastrous first term as Governor and how Center for American Liberty fought his administration to preserve the rights of Californians.", "Doctors lied to@ChoooColeand Layla Jane, concealing less invasive treatment options from them and their families. They are now taking legal action against the doctors who irreversibly harmed them, and we are proud to represent them both.", "ICYMI: Our fearless Founder & CEO, Harmeet Dhillon@pnjaban, stood up for free speech on Capitol Hill last Thursday!#FreeSpeech#FirstAmendment", "Woke culture does not get to change a contract.@pnjabanappears on@nbcbayarea"], "mattshupepr": ["#DavidDepapeIs a ‘Former Castro Nudist Protester’ & Hemp ‘Jewelry Maker’ Who Has Children With a Well-Known Pro Nudity Activist, Reports Say", "Imagine looking at California and thinking, “you know what, this place needs more drugs, yeah, that will help.”", "NEW: California moves to decriminalize use of magic mushrooms and other natural psychedelics with@Scott_Wiener's SB 58.https://latimes.com/california/story/2023-09-07/california-magic-mushrooms-psychedelics-scott-wiener-psilocybin…", "#DavidDepapeIs a ‘Former Castro Nudist Protester’ & Hemp ‘Jewelry Maker’ Who Has Children With a Well-Known Pro Nudity Activist, Reports Say", "Imagine looking at California and thinking, “you know what, this place needs more drugs, yeah, that will help.”", "NEW: California moves to decriminalize use of magic mushrooms and other natural psychedelics with@Scott_Wiener's SB 58.https://latimes.com/california/story/2023-09-07/california-magic-mushrooms-psychedelics-scott-wiener-psilocybin…"], "richardgrenell": [], "rudygiuliani": ["Courtney lives right next to where the train derailed inEastPalestine, Ohio.\n\nI'm here to offer my experience with crisis management, as I'm concerned by the federal government's slow response.\n\nWe're going to make sure Courtney—and everyone else here—gets the help they need.", "I went toEastPalestine, Ohio to offer my experience with crisis management as a former mayor. We'll continue to help the community as they deal with consequences of derailment.\n\nIt's not about partisanship or fingerpointing. It's about leadership and helping fellow Americans.", "We've met with so many great people impacted by the train derailment inEastPalestine, Ohio.\n\nMayor Conaway is a good man, and after meeting with him, I'm confident in his ability to lead.\n\nHe asked us to use our platform to ensure they are not forgotten or ignored. We will.", "America's Mayor Live (E92): Update onEastPalestine, Ohiohttps://x.com/i/broadcasts/1YqxoAkeDvQGv…", "I went to East Palestine, Ohio to offer my experience with crisis management as a former mayor. We'll continue to help the community as they deal with consequences of derailment.\n\nIt's not about partisanship or fingerpointing. It's about leadership and helping fellow Americans.", "We've met with so many great people impacted by the train derailment in East Palestine, Ohio.\n\nMayor Conaway is a good man, and after meeting with him, I'm confident in his ability to lead.\n\nHe asked us to use our platform to ensure they are not forgotten or ignored. We will.", "Chag Chanukah Sameach! May the Festival of Lights bring blessings and joy to you and your loved ones. \n\nPictured here is the world's largest menorah, located on Fifth Avenue and 59th Street in New York City.#Chanukah#Hanukkah#NYCwithTheMayor", "Today, we remember the seven victims of the 1993 World Trade Center bombings and the heroism displayed by the FDNY, NYPD and first responders.\n\nJohn DiGiovanni, Robert Kirkpatrick, Stephen A. Knapp, William Macko, Wilfredo Mercado, Monica Rodriguez Smith and her unborn child."], "brandonstraka": ["Finally-the TRUE stories of J6 & it’s horrifying aftermath from the people who lived them.\n\nThis Fri, Jan 6, 8:30pm ET join@drsimonegold@julie_kelly2@yesnicksearcy@DerrickEvans_WV@FrontlineFlash& more for stories that will shock you. \n\nSet reminder:https://x.com/i/spaces/1MYGNgzaRjpJw…", "I think our friend Yosef might just be a bot. Hmmm… now which side of the aisle would need to create a bot that appears to be a Republican who hates gay people, since there’s obviously a shortage of that in reality??", "Help me out here, everybody- is this a mostly peaceful gathering or is it a violent right wing white supremacist riot?", "The awakening has begun. People are seeing through the lies and propaganda. \n\nThe#WalkAwaymovement will not be stopped. \n\nMore from my conversations in Harlem!", "In their sickest turn yet to infringe on your Constitutional rights, mass shootings are now becoming  a kamikaze activist mission for the radical left.", "This is worse than anything I witnessed or was “a part of” on January 6th.", "DEMAND that every one of these people be made to face:\n1. FELONY: Obstruction of an official proceeding\n2. FELONY: Occupying a restricted building or grounds\n3. FELONY: Conspiracy\n4. MIS: parading/picketing\n5. MIS: Disorderly conduct\nNO BAIL. NO RELEASE.", "Who tf are the parents who are taking their small kids to this?"], "benigma2017": ["Half of the \"anti-war\" Left has a serious \"But the CIA told me this is a good war\" weakness.", "When a pack of angry folks spends a few hours breaking windows at the Capitol we have hearings about it for years but when regular people die from lack of healthcare, housing or wages that can’t pay for food for their families that’s “fine”.\n\nOur government has abandoned us.", "As long as there are Democrats publicly defending what's going on now in Palestine you shouldn't vote for any Democrats.\n\nThis shit is not hard.", "Before you get too excited about the protests inIsraelunderstand these folks are protesting what’s being done to THEM by Netanyahu and still don’t give a damn about what their government does to Palestinians in their name.", "If you didn't have anything to say about US atrocities in Iraq etc then I don't give a fuck what you have to say about Russian war crimes because you don't give a shit about peace you are just an opportunistic nationalist trying to point the glare of scrutiny at your enemy.", "I don’t care if Obama slept with a guy unless he then blew that guy up with a drone like he did to so many women and children in the Middle East.", "Today id like to pause for a second and remember every soldier who died protecting Americas ability to bully the world and protect it’s oligarchs business interests against burgeoning competition.", "Half of the \"anti-war\" Left has a serious \"But the CIA told me this is a good war\" weakness."], "thebabylonbee": ["Ilhan Omar: 'Antisemitism Wouldn't Be A Problem If We Got Rid Of All The Jews'https://buff.ly/3vHGtZ2", "Wandering Israelites Getting Real Tired Of Guy Who Keeps Saying, 'At Least We're Getting Our Steps In'https://buff.ly/3RG4nSj", "Ilhan Omar BlastsIsraelFor Refusing Palestine's Generous Gift Of Rocketshttps://buff.ly/2VszUeM", "Wandering Israelites Getting Real Tired Of Guy Who Keeps Saying, 'At Least We're Getting Our Steps In'https://buff.ly/3RG4nSj", "Ilhan Omar: 'Antisemitism Wouldn't Be A Problem If We Got Rid Of All The Jews'https://buff.ly/3vHGtZ2", "Ilhan Omar Blasts Israel For Refusing Palestine's Generous Gift Of Rocketshttps://buff.ly/2VszUeM", "Orcs March On Minas Tirith In Mostly Peaceful Protesthttps://buff.ly/3f2KJJq", "AOC Added To Iwo Jima Memorial For Surviving Capitol Riot"], "hodgetwins": ["Trump Goes toEastPalestine, OH and Brings Trump Water", "Never forget what they did to people for “health and safety”. No amnesty, throw these people in prison.", "Any city with Soros DAs is not free and not safe", "Forgot to mention, the “peaceful protesters” used explosives too", "Never forget what they did to people for “health and safety”. No amnesty, throw these people in prison.", "The media is about to have a meltdown. They lied to us the whole time.https://iapps.courts.state.ny.us/fbem/DocumentDisplayServlet?documentId=JK5E3gx5XV1/ku37jnWR_PLUS_w==&system=prod&TSPD_101_R0=08533cd43fab2000d3a9d54698398f992ebf545035ab6db1f4b6460ff26a258493c1e5f11d89bcc60892a7e6461448000a3782921889f4357929f22a3b84742103afc539b90eeb116b573648518aecf1ed73754da31b1a319fe52136022046a2e9ff2af547eb66a218ed3445947919c50ea353c3de758e5d…", "Millions of lives were destroyed over a forced shot that they admit was never tested on stopping transmission.", "Wish they would’ve done this to BLM and Antifa leaders when they burned and looted cities", "#BREAKING: Twitch streamer Kai Cenat will be charged with at least two counts of inciting a riot and unlawful assembly after thousands of people descended on Union Square in New York City police officials say"], "thetwinspod": []}