{"michaelmalice": ["On this Day ofJihad,@JohnFettermandelivers a prayer for peace in Arabic", "Elderly man assaulted in his own home by an invader\nThis is what Hamas' Day ofJihadhas resulted in", "Kudos to my Mossad comrades for engineering it so that the Libertarian Party couldnt be an effective force againstIsraelthis year.\n\n...and, lock comments", "Hamas to endorse college debt relief shortly", "On this Day of Jihad,@JohnFettermandelivers a prayer for peace in Arabic", "Elderly man assaulted in his own home by an invader\nThis is whatHamas' Day of Jihad has resulted in", "Looks likeHamascured that new Covid wave", "Hamasto endorse college debt relief shortly", "this is the literal demon who wrote this propaganda", "Some news - I started as a breaking news reporter for@thehilltoday! \n\nI'll be covering all kinds of political and policy news and anything in between. Reach out with any news tips at lsforza@thehill.com", "All Iran needs to say was that they were trying to drone strike Afghan kids and everything will be forgiven", "CNN has confirmed that as theHamasfighters were slaughtering innocent people they could be heard to be chanting \"This is MAGA country\"", "Guys Israel just needs to send John Fetterman to negotiate withHamasAfter trying to listen to him their translator will just blow himself and the leadership up, and steps towards a lasting peace can commence", "Hand over all the universities toHamasto govern as they see fit#WorldPeace"], "tomilahren": ["CivilizedMuslimnations want to make peace withIsrael. Palestinians do not and that’s the fact of the matter.https://x.com/i/broadcasts/1dRJZEwXOnXGB?t=16m53s…", "We need to stop referring to these people as “anti-Israel” protesters. They couldn’t findIsraelon a map. \n\nThey are misfits and losers who are carrying the banner for Islamic terrorism and many of them are doing it because it’s their only opportunity to fit in and be a part of", "Terrorist sympathizers plus well meaning morons calling for a “ceasefire” like to absorb Hamas propaganda I guess EXCEPT when leaders of Hamas directly say they will repeat October 7 for as long as it takes untilIsraelis wiped off the map…", "Let’s just be honest, these “pro-Palestine” encampments are little more than the misfits of the world living out the sleepovers they never got invited to during their childhood years. \n\nSure, there are some true jihadis hiding in there but most of them are just your typical", "Israel has the full right to do whatever it has to do to eradicateHamas.", "Hamas Official Ghazi Hamad: We Will Repeat the October 7 Attack Time and Again Until Israel Is Annihilated; We Are Victims - Everything We Do Is Justified#Hamas#Gaza#Palestinians", "Terrorist sympathizers plus well meaning morons calling for a “ceasefire” like to absorbHamaspropaganda I guess EXCEPT when leaders ofHamasdirectly say they will repeat October 7 for as long as it takes until Israel is wiped off the map…", "There is no “pro-Palestine” side to this. Palestine is controlled byHamas. If you’re screeching for aceasefireyou’re coddling terrorists.https://x.com/i/broadcasts/1eaJbgkBnvoxX?t=8m53s…", "It’s time to get real. Yes, there are civilians in Gaza who will be caught up in the crossfire and that is a tragedy. It is also important to remember that Palestine ELECTEDHamas(Muslim terror group) to represent its people. Israel isn’t failing these people, their “leadership”"], "monicacrowley": ["Jihadi insurrection happening now in your nation’s capital.\n\nThe enemy within is emboldened.\n\nPrepare.", "The rightful President welcoming Israeli Prime Minister@netanyahuto Mar-a-Lago", "Four years ago today, President Trump’s historic ABRAHAM ACCORDS were signed at the White House.\n\nI was there. It was a momentous and moving day.\n\nThe firstMiddleEastpeace agreements in 26 years, the Abraham Accords began a new era of enduring peace betweenIsraeland many", "Told you something was up in NYC. \n\nThis is Grand Central Station, brought to a halt by pro-Palestinian/pro-Hamas protesters.", "Here’s the Taliban showing off $85 Billion in military equipment Biden & Harris left behind in their catastrophic withdrawal - 13 American soldiers were killed & our terrorist-supporting enemy is now armed to the teeth", "The rightful President welcoming Israeli Prime Minister@netanyahuto Mar-a-Lago", "Terrorist sympathizers stage a massive protest outside the White House Correspondents’ Dinner, complete with a “die-in” and the unfurling of a huge Palestinian flag from a hotel window.\n\nThey are scaling up - as they always do.", "Biden/Harris/Mayorkas have so much blood on their hands as a result of their evil NO BORDERS policy.\n\nBut just wait until the inevitable catastrophic terror attacks.\n\nThese 3 should be tried for treason now - we shouldn’t have to wait until after thousands (millions?) of"], "glennbeck": [".@bennydav, aJewwho survived the 1976 terrorist plane highjacking, explains why the Jewish people can't just 'leave'Israelfor safety reasons: \"Where do you want us to go? The people ofIsraelwill stand and defend our land. Because this is the only one we’ve got.\"", "Many Americans have moved past the Hamas terrorist attack. They think it’s over or that it’s time to move on. But nothing could be FURTHER from the truth. Tonight on Glenn TV, I explain why I’m afraid we’re heading toward a LARGER, maybe even BIBLICAL, war.", "FormerIDFSpokesperson, Lt. Col. (Ret.)@jconricus, told me who the mastermind is behind all ofIsrael’s conflicts: “We are fightingGaza, Lebanon, Syria, the Yemenites, the Houthis, Palestinians, and Iran. And the common denominator here is that it all emanates from Iran.", "Biden now wants to create a separate label for Jewish-made products from theWestBank(AKA Judea & Samaria). Maybe it's just me, but creating separate labels for Jews doesn't exactly have the best track record.", "Many Americans have moved past theHamasterrorist attack. They think it’s over or that it’s time to move on. But nothing could be FURTHER from the truth. Tonight on Glenn TV, I explain why I’m afraid we’re heading toward a LARGER, maybe even BIBLICAL, war.", "The attack on Israel is not over a territory dispute. It's about annihilating the Jews.", "Former IDF Spokesperson, Lt. Col. (Ret.)@jconricus, told me who the mastermind is behind all of Israel’s conflicts: “We are fighting Gaza, Lebanon, Syria, the Yemenites, the Houthis, Palestinians, and Iran. And the common denominator here is that it all emanates from Iran.", "As the narrative that Israel bombed a hospital in Gaza continues to fall apart, I have to ask: Why was the media so quick to believe the words of jihadi terrorists who murdered American citizens?"], "lpnh": ["FuckIsrael. Fuck the ADL. All my homies hateIsraeland the ADL. -@ScottAdamsSays", "Dear Zionists and their American shills,\n\nWe're not going to let you shame us into backing the genocide of the Palestinian people.#PalaestinianGenocide#Israel#Gaza", "Libertarians have been talking about Osama Bin Laden’s#Letter_to_Americafor over two decades now. \n\nWe've been talking about it, not to excuse the terrorist acts, but as a lesson, that history doesn't start on the day of this terrorist act, or that terrorist act. That actions", "“There would be no Hamas without Iran.”\n\nWrong, you bloodthirsty psychopath. There would be no Hamas withoutIsrael. \n\nThis insane rhetoric will lead to the end of the United States long before Iran, Russia, or China would.#NoWarWithIran", "Libertarians have been talking about Osama Bin Laden’s#Letter_to_Americafor over two decades now. \n\nWe've been talking about it, not to excuse the terrorist acts, but as a lesson, that history doesn't start on the day of this terrorist act, or that terrorist act. That actions", "“There would be noHamaswithout Iran.”\n\nWrong, you bloodthirsty psychopath. There would be noHamaswithout Israel. \n\nThis insane rhetoric will lead to the end of the United States long before Iran, Russia, or China would.#NoWarWithIran", "Fuck Israel. Fuck the ADL. All my homies hate Israel and the ADL. -@ScottAdamsSays", "Dear Zionists and their American shills,\n\nWe're not going to let you shame us into backing thegenocideof the Palestinian people.#PalaestinianGenocide#Israel#Gaza"], "antiwarcom": ["UN Report Says Over 570,000 People are Starving inGazaIsraelis using starvation as a weapon of war\nby Dave DeCamp@DecampDave#Gaza#Israel#UnitedNations#Starvation#StarvationIsWarCrime#GazaCeasefireNOWhttps://news.antiwar.com/2023/12/21/un-report-says-over-570000-people-are-starving-in-gaza/…", "US Rushes Weapons Shipments ToIsraelAccording to flight data, there's been a spike in US arms deliveries toIsraelsince the end of July\nby Dave DeCamp@DecampDave#Israel#Gaza#Palestinians#MilitaryIndustrialComplexhttps://news.antiwar.com/2024/08/29/us-rushes-weapons-shipments-to-israel/…", "IsraelBombs Areas of SouthernGazaWhere It Told Palestinians to FleeIsrael's defense minister suggestedIsrael's onslaught in the south will be more intense than in the north\nby Dave DeCamp@DecampDave#Israel#Gaza#Palestine#Palestinianshttps://news.antiwar.com/2023/12/04/israel-bombs-areas-of-southern-gaza-where-it-told-palestinians-to-flee/…", "US To Release $3.5 Billion in Military Assistance forIsraelby Kyle Anzalone@KyleAnzalone_#Israel#Gaza#Palestinians#militaryindustrialcomplexhttps://news.antiwar.com/2024/08/09/us-to-release-3-5-billion-in-military-assistance-for-israel/…", "UN Report Says Over 570,000 People are Starving in Gaza\nIsrael is using starvation as a weapon of war\nby Dave DeCamp@DecampDave#Gaza#Israel#UnitedNations#Starvation#StarvationIsWarCrime#GazaCeasefireNOWhttps://news.antiwar.com/2023/12/21/un-report-says-over-570000-people-are-starving-in-gaza/…", "Israel Bombs Areas of Southern Gaza Where It Told Palestinians to Flee\nIsrael's defense minister suggested Israel's onslaught in the south will be more intense than in the north\nby Dave DeCamp@DecampDave#Israel#Gaza#Palestine#Palestinianshttps://news.antiwar.com/2023/12/04/israel-bombs-areas-of-southern-gaza-where-it-told-palestinians-to-flee/…", "Julian Assange Is Free!\nby Andrew P. Napolitano@Judgenap@WikiLeaks#WikiLeaks#JulianAssangeIsFreeNOW#JulianAssange_is_FREE#AssangeFreehttps://original.antiwar.com/andrew-p-napolitano/2024/06/26/julian-assange-is-free/…", "Pentagon Admits It Has No Evidence Iran Was Behind Drone Attack That Killed 3 US Troops in Jordan\nRegardless, the#Pentagonsays#Iran'bears responsibility'\nby Dave DeCamp@DecampDave#Jordan#Tower22#droneshttps://news.antiwar.com/2024/01/29/pentagon-admits-it-has-no-evidence-iran-was-behind-drone-attack-that-killed-3-us-troops-in-jordan/…"], "coachbrucepearl": ["There is a Palestinian State inGazarun by Palestinian Terrorists! How's that 2 State Solution working out? There are millions of Arabs living in peace and prosperity inIsraelright now. Those who want WAR ORISRAELMUST LEAVE!", "Does anybody in Green want to assist or live next door to the Palestinians, or is it just up toIsrael? In 2005, Jews were forcibly removed fromGazaand the Palestinian  state was created! They elected Hamas, became terrorists and attackIsraelagain and again! I sayNEVER AGAIN!", "In response to Hamas attack onIsrael, slaughtering 1200 innocent civilians with promises to do it again and again, Gov Walz wants to REWARD THEM with their own state? Sir, they have had their own Terrorist State since 2005! That swap of land for peace did not work then or now!", "Walz goes all in for the pro-Hamas crowd, wow.\n\nWalz: “We need to continue, I think, to put the leverage on” (meaning pressure Israel)\n\nWalz: “I think those folks who are speaking out loudly in Michigan are speaking out for all the right reasons.”\n\nYikes. x.com/dylanewells/st…", "I just recited the Mourners Kaddish for an American, Hersh and the other hostages murdered by these barbarians! There is NO JUSTIFICATION! There doesn't need to be a deal, a ceasefire or a reward to Hamas or Hezbollah with the creation of a terrorist Palestinian state!Israel", "A few hours ago, I awakened to the heartbreaking news that six hostages were murdered in cold blood by Hamas in captivity.  Among the hostages was Hersh Goldberg Polin, whose parents—Jon Polin and Rachel Goldberg—have been at the forefront of telling the stories of the hostages", "134 Innocent Hostages including 6 Americans are still being held byHamas, Gazans and Palestinians. Not one word DEMANDING THEIR RELEASE from our President. On Oct 7th the Jewish People experienced the worstgenocidesince the Holocaust and we hear more about the suffering of", "I just recited the Mourners Kaddish for an American, Hersh and the other hostages murdered by these barbarians! There is NO JUSTIFICATION! There doesn't need to be a deal, aceasefireor a reward toHamasor Hezbollah with the creation of a terrorist Palestinian state! Israel", "A few hours ago, I awakened to the heartbreaking news that six hostages were murdered in cold blood by Hamas in captivity.  Among the hostages was Hersh Goldberg Polin, whose parents—Jon Polin and Rachel Goldberg—have been at the forefront of telling the stories of the hostages", "There can be no “managing” ofHamas. It is a genocidal, jihadist org whose charter is the destruction of Israel and the murder of Jews worldwide. Israel must destroyHamas, help the world rebuild Gaza and find peaceful Arab leaders like Abraham Accords", "The Biden Admin fundedHamasin Gaza, the PA in Judea and Samaria and most importantly Iran, who is behind it all. Our rhetoric and support for Israel's sworn enemies emboldened and empowered them. Citizens of Israel, 3 million Arabs and 6 million Jews live with this threat daily"], "senkatiebritt": ["Peace cannot prosper as long as Hamas’ forces of evil exist.\n \nWatch my full remarks on returning from theMiddleEasthttps://youtube.com/watch?v=k3UeLf45dvU…", "We made a promise after World War II — a promise that’s now under attack inIsraeland here at home.\n\nAs Americans, we must ensure “Never Again” actually means “Never Again.”", "What is happening inIsraelis pure evil. Hamas terrorists don’t care how many men are killed, how many women are raped, and how many children — babies and toddlers — are kidnapped.\n\nSee morefrom today’s press conference on our unequivocal support forIsrael", "It’s well past time for this Administration to take concrete, meaningful action to restore order on college campuses. Jewish students across America deserve protection NOW. Not six months down the road. Not next year.", "It’s a shame Vice President Harris literally will not be here today to stand with Israel. Time and time again she fails to do her job.She was put in charge of the border—she failed at that.She's expected to preside over joint sessions of Congress in which foreign", "This shouldn’t be complicated—\n\n1). Deport any non-citizen in the U.S. who supportsHamas.\n\n2). Defund any educational institution that authorizes, facilitates, or otherwise supports these pro-terrorist activities.https://x.com/thizzl_/status/1781520706640982159/video/1…", "We made a promise after World War II — a promise that’s now under attack in Israel and here at home.\n\nAs Americans, we must ensure “Never Again” actually means “Never Again.”", "Peace cannot prosper as long asHamas’ forces of evil exist.\n \nWatch my full remarks on returning from the Middle Easthttps://youtube.com/watch?v=k3UeLf45dvU…"], "laurenboebert": ["It’s pretty obvious that the Democrat Party has now fully morphed into the Hamas Party.\n\nThe pick was Shapiro. That got leaked last week from the Mayor of Philadelphia.\n\nThe Hamas wing of the party couldn’t stomach a Jewish man on the ticket so Kamala bent the knee and went with", "Tim Walz ran away from cameras when asked about the six hostages killed inGaza.\n\nWe’ve got a Presidential and Vice Presidential candidate who can’t give an answer without their team crafting it first.\n\nThat’s not leadership. That’s cowardice. That’s not acceptable.", "Any student participating in violent antisemitic protests on college campuses and is in this country on a student visa needs to be immediately deported.\n\nAny student on a federal student loan caught in these protests needs to have their loan revoked.\n\nEnough is enough with this", "The White House came out against a standalone aid bill toIsraelbecause it says that doing so would delay aid toIsrael.\n\nOther than the fact that the above statement makes NO SENSE, the takeaway is they don’t want to helpIsraelwithout tying it directly to Ukraine.\n\nJoe Biden", "Tim Walz ran away from cameras when asked about the six hostages killed in Gaza.\n\nWe’ve got a Presidential and Vice Presidential candidate who can’t give an answer without their team crafting it first.\n\nThat’s not leadership. That’s cowardice. That’s not acceptable.", "Bar none, the Biden Administration is the most incompetent and dishonest in American history.", "It’s pretty obvious that the Democrat Party has now fully morphed into theHamasParty.\n\nThe pick was Shapiro. That got leaked last week from the Mayor of Philadelphia.\n\nTheHamaswing of the party couldn’t stomach a Jewish man on the ticket so Kamala bent the knee and went with", "My heart is with the 13 families who lost loved ones in Afghanistan three years ago because of Joe Biden and Kamala Harris’ pathetic withdrawal.\n\nBiden and Harris were the last two people in the room and made this final decision that resulted in the most embarrassing moment in"], "repmtg": ["Honored to haveRabbiJonathan Gross, a dedicated attorney seeking justice for J6ers, join me for Prime Minister Netanyahu’s address to Congress today.", "Watch Tlaib’s aggressive insurrectionist come at me in Cannon todayAfter Hamas murdered and kidnapped innocent Israelis, this antisemite screams “LetGazalive” and claims I have blood on my hands.\n\nNow Biden wants to give $100 million toGazato fund more Hamas terrorism!", "The Hamas-loving insurrectionists, led by Rashida Tlaib, have ties to the SPLC and Jewish Voices for Peace. \n\nOne of their group messages was named \"Gobal Intifada,\" which means \"Arab uprising.\" \n\nThese people support terrorists. Rashida Tlaib must be censured for her actions.", "Major roadways are being blocked by pro-Hamas protesters.\n\nThey’re disrupting people’s lives, trade and commerce, and any emergencies, and they organized this on the morning of the National Prayer Breakfast.\n\nThe Free Palestine disruptive movement is not winning anyone over.", "I said from the beginning if you support Israel, America should stay out and let them fight their own war and don’t let the Biden admin get involved.\n\nNow that Mike Johnson sent $26 billion to Israel AND $9 billion to Gaza (Hamas), the Biden admin has stopped shipping ammo to", "Watch Tlaib’s aggressive insurrectionist come at me in Cannon todayAfterHamasmurdered and kidnapped innocent Israelis, this antisemite screams “Let Gaza live” and claims I have blood on my hands.\n\nNow Biden wants to give $100 million to Gaza to fund moreHamasterrorism!", "TheHamas-loving insurrectionists, led by Rashida Tlaib, have ties to the SPLC and Jewish Voices for Peace. \n\nOne of their group messages was named \"Gobal Intifada,\" which means \"Arab uprising.\" \n\nThese people support terrorists. Rashida Tlaib must be censured for her actions.", "After Biden ordered US air strikes in Yemen, millions filled the streets of Yemen in anger.@SpeakerJohnsonbetter make HR2 the most important part of his talks bc these people can enter our wide open border and many already have!\n\nNO HR2 = NO FUNDING!"], "bennyjohnson": ["High Rise buildings inGazathat have been used for terror operations are getting *completely* leveled.\n\nNever seen anything like this…", "Protester who shouted racist slurs at Rep.@ByronDonaldsas he called on DC police to clear The George Washinton University Pro-Hamas encampment REVEALED to be terrorist-sympathizing PROFESSOR Zein El-Amine at GWU, Georgetown, and American.\n\nWhy do Universities act surprised at", "Israeltells residents of NorthernGazaandGazaCity to immediately relocate south, warning of an “ImpendingIDFoperation”", "BREAKING:Israelsays “IDFtanks & infantry struck numerous terrorist cells, infrastructure and anti-tank missile launch posts” in NorthernGaza“In preparation for the next stages of combat”", "BREAKING: Israeli PM BenjaminNetanyahu: “Just as the United States would not agree to aceasefireafter the bombing of Pearl Harbor or after the terrorist attack of 9/11. Israel will not agree to a cessation of hostilities withHamasafter the horrific attacks of October", "Israel tells residents of Northern Gaza and Gaza City to immediately relocate south, warning of an “Impending IDF operation”", "BREAKING: Israel says “IDF tanks & infantry struck numerous terrorist cells, infrastructure and anti-tank missile launch posts” in Northern Gaza “In preparation for the next stages of combat”", "BREAKING: Israeli PM BenjaminNetanyahusays the “second stage” of the war has begun which will focus on destroyingHamas’ capabilities and returning hostages"], "marklevinshow": ["Palestinians, a culture of Islamist terrorism", "Hamas terrorist are operating in Judea and Samaria and Biden-Blinken-Scarborough are smearing the Israelis defending themselves there.", "IDFprepared for total eradication of Hamas, Netanyahu says", "Palestinian terrorists slaughtering Israeli civilians", "HamasNazis shooting at civilians to keep them away from aid trucks. Blinken silent.", "Israel unleashes fire and fury againstHamasNazis", "IDF prepared for total eradication ofHamas,Netanyahusays", "Hamasterrorist are operating in Judea and Samaria and Biden-Blinken-Scarborough are smearing the Israelis defending themselves there."], "ksorbs": ["Wait, I thought they were the party of peace?", "These people were prosecuted and had their lives destroyed more than any BLM/ANTIFA terrorist ever will.https://x.com/CollinRugg/status/1720604668412428591/video/1…", "We received about 20 inches of snow this week. So……….\n\n8:00 am: I made a snowman.\n\n8:10 - A feminist passed by and asked me why I didn't make a snow woman.\n\n8:15 - So, I made a snow woman.\n\n8:17 - My feminist neighbor complained about the snow woman's voluptuous chest saying", "A man died using his body as a shield to protect his family. The left makes jokes that the shooter missed and wishing more people were killed.", "Heartbreaking.\n\n“This is not what those boys died for”", "These people were prosecuted and had their lives destroyed more than any BLM/ANTIFA terrorist ever will.https://x.com/CollinRugg/status/1720604668412428591/video/1…", "Thank you to everyone who bought a shirt! The proceeds have been donated to the families of the victims.", "With all the insanity going on with the Biden/Harris team for the last 4 years it just gets worse.  They are giving  $157 million to Lebanon...to Lebanon???  and a grand total of $2 million to the clean up effort from Hurricane Helene."], "atensnut": ["But… but.  He apologized for being Jewish.", "This disgusting little narcissist can’t stand not being the center of attention.  He’s going toIsraelto get attention from media. \n\nHow does he travel so much with a war going on?", "You, the American taxpayer, are paying to clean up this disgusting Pro Hamas mess.  \n\nWere any of these degenerates animals arrested for decimating these historic structures?", "Good heavens.  Women in London removing posters of missing Israeli kids.", "Biden and Harris decline to attend.  \n\nNo wonder.  They are responsible for the deaths of the thirteen brave men and women.", "This is leadership. \n\nTrump gives a solemn tribute to the 13 service members lost due to Kamala Harris' disastrous Afghanistan withdrawal.", "So many died alone thinking their family didn’t care.   It was appalling and inhumane.", "You, the American taxpayer, are paying to clean up this disgusting ProHamasmess.  \n\nWere any of these degenerates animals arrested for decimating these historic structures?", "This would not be happening if Trump was in office.  He protected Israel. There were no wars under President Trump.  \n\nI repeat.  NO WARS."], "scottpresler": ["I hope that the RNC sees this messaging for the Jewish community. \n\nWe are already seeing an impact.", "HOLY COW! \n\nWe are texting no party affiliated Pennsylvania Jewish voters: \n\n“Joe Biden is funding Hamas. \n\n4 years ago, we had peace in theMiddleEast.\n\nThe Jewish community deserves protection here & abroad. \n\nConsider Trump this November.” \n\nI’m texting w/ the voter RIGHT NOW", "“[Palestinians] do not have the capabilities to establish their own homeland and make it successful even with the aid ofIsraeland the United States.\n\nThey are too battle-minded to be able to establish a peaceful homeland of their own.”\n\n-Josh Shapiro", "To every member of the Jewish community, \n\nthe reason why Josh Shapiro wasn’t chosen is because he’s Jewish. \n\nThe democrat party has left you behind. Instead of protecting & defending your families, democrats have chosen the Palestinian Authority & Hamas.\n\nConsider Trump.", "Democrats can’t support the Jewish community, while also fundingHamas.", "“[Palestinians] do not have the capabilities to establish their own homeland and make it successful even with the aid of Israel and the United States.\n\nThey are too battle-minded to be able to establish a peaceful homeland of their own.”\n\n-Josh Shapiro", "To any member of the Jewish community seeing this post, \n\nremember that a vote for democrats this November is a vote forHamas. \n\nWe had peace in the Middle East under President Trump. \n\nIt’s time for change.", "All counties are trying not to escalate? \n\nIran just attacked Israel \n\nwith money funded by Obama & Joe Biden."], "pnjaban": ["This hearing was a start but the lazy conflation of hate crimes with trans-national repression lets bad foreign actors off the hook and repeats comfortable, tired political tropes. Indian death squads on North American soil deserve a higher and more serious level of scrutiny.", "FBI Director addresses House Committee on TNR (Foreign Interference) on threats against American Sikhs.#USIntel Law Enforcement", "Proud to represent three such brave young women, including Layla Jane, pictured. What adults did to them is shocking.", "I am not an expert on trans issues, and like you, I have endless empathy for individuals facing them. \n\nHowever, I am confident that children are not able to make irreversible surgical and hormonal decisions in their teen and pre-teen years.\n\nI’ve never met a parent who thought", "Free@EithanHaim! He did nothing wrong! Probably saved many lives!", "The DOJ has indicted Dr. Eithan Haim, a little-known surgeon who exposed Texas Children’s Hospital for secretly conducting transgender surgeries on minors, on four felony counts related to his alleged violation of a medical-records law. |@dezward01https://trib.al/IQig1V7", "Sue Yale. Sue every university that refuses to keep students safe based on their religion. Make them regret their choices. Deplete their endowments. Sue each and every violent protester and organizers.\nDrain theirbankaccounts. Sow salt in their career plans.", "Tonight at Yale, I was assaulted by a student today at an anti-Israel protest. He stabbed me in the eye with a Palestinian flag. Now I'm in the hospital. This is what happens when visibly Jewish students try to attend and document these rallies.", "This is why we@Liberty_Ctrare suing to stop these barbaric practices!", "BREAKING: New documents released in the legal defense of North Carolina's age limits on pediatric sex-trait modification are shocking. \n\nThey reveal that WPATH hired experts at Johns Hopkins to do a series of systematic reviews on the evidence supporting “gender affirming”", "She argued against the applicability of well-settled religious liberty norms, before finally caving in and settling the case for attorney fees, back pay and a job after a national coalition of civil rights groups across the political spectrum joined hands to demand justice.", "Huge First Amendment victory in federal court for our@liberty_ctrclient@revmahoney! Court just struck down Pelosi-driven rules that allow Congressmen/women to use the Capitol steps for speech but don’t allow public prayer or protests. The people win!https://libertycenter.org/wp-content/uploads/2024/05/Mahoney-Order-Granting-MSJ.pdfwii…", "What’s funny is some of the Indian American yewts are so far-left brainwashed because of their craven desire to fit in, their reaction to Kamala is “wtf Aunty Kamala is a genocidal Zionist! Free Palestine! Noooooo!!”", "You ladies are heroines! You are saving lives! Thank you!", "I found@ChoooColeand@basedlittlelady!!!", "My prayer tonight started with thanks as five Sikh immigrants who are so thankful for the liberty we enjoy as Americans.We prayed for the hostages in Gaza & women in repressive countries & people suffering everywhere. And prayed for our America to remain strong and free.", "Hamasdid this because Harris/Biden are weak enablers of terror, not its sworn enemy. Remember it when you vote.\n\nA strong America is vital to protecting our citizens all over the world. I’m so sorry we let this family down. It is a national disgrace.", "The family of American hostage Hersh Goldberg Polin have confirmed he’s among the bodies that the IDF recovered from Gaza today.\n\nHersh was severely tortured by the Palestinian terrorists. As a reminder — they blew off his arm and took him to Gaza with the bones sticking out.", "I'm back at work this week. I ate alone for the first time at home last night after my loved ones went home. \n\nSarv loved America so much, and we thanked God for bringing us here and bringing us together here, every night. We have a country to save, and I will give it my all.\n\nI", "Very grateful for the sacrifices of the\nmen and women of the armed services who gave the ultimate sacrifice so that we may enjoy liberty. May their deaths not be in vain!"], "rudygiuliani": ["America's Mayor Live (E261): 500+ Americans STUCK inGazaas Hamas REFUSES to Let Them Leavehttps://x.com/i/broadcasts/1RDGllVNplkGL…", "The war crimes being committed by the Palestinian Authority against the civilian population ofIsraelare at least as heinous as Putin's invasion of Ukraine. \n\nListen to Dr. Maria and me at 10AM ET on UNCOVERING THE TRUTH on", "MUST WATCH VIDEOThe two-state solution, from the very beginning, has been an excuse for Arafat, Fatah, Hamas, and the privileged in Palestine to take billions in fraudulent humanitarian aid w/ no intent of actually acknowledgingIsrael’s right to exist as a Jewish state.", "10:00 AM THIS MORNING\n\nThe war crimes being committed by the Palestinian Authority against the civilian population ofIsraelare at least as heinous as Putin's invasion of Ukraine. \n\nListen to Dr. Maria and me at 10AM ET on UNCOVERING THE TRUTH onhttp://WABCRADIO.COM", "MUST WATCH VIDEOThe two-state solution, from the very beginning, has been an excuse for Arafat,Fatah,Hamas, and the privileged in Palestine to take billions in fraudulent humanitarian aid w/ no intent of actually acknowledging Israel’s right to exist as a Jewish state.", "Hamashas executed 6 hostages, including an American. These are prosecutable war crimes. Meanwhile, for over 300 days Harris and Biden have prevented Bibi from eliminatingHamas. They do nothing to save the hostages.", "10:00 AM THIS MORNING\n\nThe war crimes being committed by the Palestinian Authority against the civilian population of Israel are at least as heinous as Putin's invasion of Ukraine. \n\nListen to Dr. Maria and me at 10AM ET on UNCOVERING THE TRUTH onhttp://WABCRADIO.COM", "America's Mayor Live (Special Report): Israel Declares War onHamasFollowing Wide-Scale Attackhttps://x.com/i/broadcasts/1ZkKzjDVamNKv…"], "thebabylonbee": ["Hamas Terrorist Explains Complex, Nuanced Goals In Palestine Conflict", "Palestine Protesters Scatter As Riot Police Charge In With Sticks Of Deodoranthttps://buff.ly/4bvIhc7", "Mrs. O'Leary's Third-Grade Social Studies Class Passes Official Resolution OrderingIsraelOut Of Rafahhttps://buff.ly/3WRSYRV", "GazaHealth Ministry Confirms 8 Billion Dead In Israeli Hostage Rescuehttps://buff.ly/3Kyamnk", "Nikki Haley Says We Must Avoid Peace In The Middle East At All Costshttps://buff.ly/3uopWxp", "8 Harrowing War Stories From Tim Walz, The Man Who Was There", "Biden Declares Administration Will Never Leave Anyone Behind, Except Those Americans Held Hostage ByHamas, Or Trapped When Afghanistan Fell, Or Killed Accidentally By A Drone, Or Murdered By Illegal Immigrants (Continued)https://buff.ly/3ydwQHF", "War Ended For All Time After San Francisco Board Of Supervisors Votes For World Peacehttps://buff.ly/3NYSaW7", "HamasScientists Struggling To Figure Out How To Make Emergency Food Rations Explodehttps://buff.ly/3PsIe8f"], "hodgetwins": ["1954 Video of President Truman’s Plan to Fix Jews & Palestians Problems That Has Now Backfired!", "Rashida Tlaib’s Shocking response to Hamas attacks inIsrael", "Kamala pissed off the free Palestine people AND the Jews in less than 30 seconds", "Think about this\n\nThe Biden administration gave billions of dollars to Iran\n\nThey also gave billions of dollars toIsraelAmerican taxpayers are funding both sides of this damn war!\n\nThis is crazy y’all, no more of our money should be sent to any foreign country", "Read it and compare then vs now\n\n“IN CONGRESS, JULY 4, 1776\nThe unanimous Declaration of the thirteen unitedStates of America\n\nWhen in the Course of human events it becomes necessary for one people to dissolve the political bands which have connected them with another and to", "1954 Video of President Truman’s Plan to Fix Jews & Palestians Problems That Has Now Backfired!", "Rashida Tlaib’s Shocking response toHamasattacks in Israel", "They knew there was a threat before Trump took the stage but didn’t do anything\n\nThey knew there was a threat while Trump was speaking but still didn’t do anything\n\nThat’s more than negligence, that’s deliberate, and people died because of it\n\nLock up everybody responsible"]}