{"briebriejoy": ["No mention of pro-Israelsupporters shouting \"I hope they rape you\" or calling a peace protester a \"bitch ass nigga\" or the physical violence instigated by this pro-Israelprotester today (at 26 seconds):", "A zionist counter-protester DIVE BOMBED onto a crowd of pro-Palestinian USC student protesters—and started throwing punches. Footage shot by@TinaDesireeBerg. \n\nSo far, mainstream media has ignored this college campus violence...perpetrated by a pro-Israel counter protester.", "Who does this guy think has been shutting down Grand Central, the Statue of Liberty etc?\n\nAnyway, learn more about these courageous Jewish activists who are saying they don’t want war crimes committed in their name on the latest@BadFaithPod.#NotInMyName", "You're repetitive and weak insults about my intelligence reveal your own stupidity and lack of a cohesive argument.\n\nYou're a Jew, defending Hamas.\n\nIt doesn't get any dumber than that.\nYou win. x.com/kthalps/status…", "This is the form letter they've sent over 100 times. Note how they're complaining about me relating basic facts about Zaka's lies that have (belatedly) been reported out by mainstream news organizations.   Zionism cannot survive with free speech. So they suppress it.", "This section is so hard to listen to. Benny is just screaming “human shields”andshouting “Hamas numbers” any time Motion & Norm try to speak about 30k Palestinians in moral terms. True depravity.", "Israel is definitionally a Jewish-supremacist ethno-state. If Arab Palestinians had equal rights in Israel & the right of return, Israel could start to claim it's a democracy. \n\nAs it is, it's an apartheid state that's just murdered 15,000 people in six weeks. \n\nWhatever you call", "Leftism is a Mental Disorder Exhibit 204B: \n\nJesus was a Jew from Judea. That’s also where the story of Chanukah, which has been celebrated by Jews for thousands of years and will once again be celebrated next week, took place. \n\nAlso everything else you said was pure bullshit. x.com/briebriejoy/st…", "\"You know, the whole 'never again' thing while it's happening again -- & it's not happening to Jews & it's not happening on that kind of industrialized scale, or industrialized set up. But what is it going to take for the people who are still defending Israel to realize what", "BG: \"I'm heartened that the public attitude has shifted [on Israel]. But this is a really telling moment for the left, & a difficult moment, because... we won the opinion war on Medicare for All, we won the war on $15 minimum wage. You've won the opinion war on Palestine now, &", "Remember: Israel shot three Israeli hostages in cold blood back in December, but our political and media class continued to maintain the fiction that this was about hostage safety for months, while tens of thousands of Palestinians were slaughtered.", "New Radar on the bipartisan meltdown over the prospective ICC warrants for Israeli &Hamasleaders. \n\nEveryone from Biden to Tim Scott is echoing the refrain \"false equivalences.\" But it'sHamas, not Israel who should balk at the comparison given the scale of Israel's"], "HouseJudiciary": [".@RepRaskin: RepublicansandDemocrats together passed the assault weapons ban three decades ago in 1994. In 2004, we allowed the ban to expire.Andwe know this weapons ban worked.", ".@ChrisMurphyCT: These articles are absurd…there is not a single high crime or misdemeanor alleged.", ".@RepRaskin: Democracyandfreedom are under siege todayandall Republicans can think to do is to sell out our Democratic alliesandsell out the cause of human rightsandthen impeach a cabinet secretary working to solve the immigration problem that they claim to care about.", "Ranking Member@RepJerryNadlerdelivers his opening statement during today's hearing featuring far-right advocates who want to dismantle the agencies charged with protecting our healthandsafety.", "Rep.@StaceyPlaskett: I know the American people don't believe that this is an appropriate use of the $20 million allocated to this committee. Holding six full hearings to bolster disproven lies.", "“Not even 24 hours after passing a do-nothing bill under the guise of ‘fighting antisemitism,’ Speaker Johnson drags out one of the oldest antisemitic tropes in world.” -@RepJerryNadler", "Under Donald Trump, murder rates surged by 30% to the highest rates since the 90s.", "Violent crime is dropping at record levels in America. We are now living in the post-Trump crime wave era.", "ATF Director Dettelbach: Even with our progress, the toll of gun violence remains crushing. More than 40,000 people died from gun violence last year...The leading cause of death for American children is gun violence. Not cars. Not cancer. Guns. That is unacceptable.", "Maddow: A fifth of the Republicans in Congress last week voted to defund NATO. Don't just forget being the leader of the free world, forget the whole idea of there being a free world at all. They saved that for the anniversary of D-Day.", "Joe: Republicans are saying, don't support Israel, don't support Ukraine, don't support Taiwan, don't support Gazans— and by the way, 'let's cut defense spending'? What party is this?"], "LPNational": ["No. \n\nNo more aid,@ZelenskyyUa. \n\nThe Ukrainian government should have never been given aid by the US in the first place.\n\nEnd all foreign aid now.", "Amendment I\n\nCongress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble,andto petition the Government for a redress of", "If you aren't outraged that Zelenskyy left Gonzalo Lira to die in prison, or that Julian Assange rots away in jail for exposing US war crimes, we don't believe your outrage about the death of Alexei Navalny.", "The Fed is actively waging a war against your wealth.\n\nIt's why gasandfood costs have skyrocketed.\n\nIt's why the dollar is worth 3% of what it was in 1913. \n\nIt's why Americans suffer.\n\nEnd the Fed, repeal all legal tender laws,andlet liberty thrive.", "We would disband NATO.\n\nWe would withdraw from the UN.\n\nWe would terminate all involvement in the WEF.\n\nWe would leave the WorldBankto rot. \n\nWe reject globalism on every level because we seek to bring political power closer to the individual. \n\nNo exceptions.", "You are most certainly not. Even as Americans languish, you send billions of dollars to UkraineandIsrael.\n\nAll while the IRS seizes our wealth,andthe Fed destroys what's left of it through the money printers.", "Libertarians: Can you at LEAST stop killing innocent people with our stolen tax dollars overseas?\n\nWashington DC:", "Getting involved in foreign wars enables politically connected bankers to destroy your money.\n\nGetting involved in foreign wars enables politicians to restrict your speech.\n\nGetting involved in foreign wars enables the military industrial complex to kill innocents in your name.", "Overseas military intervention makes us poor domestically, and allows the state to curtail our civil liberties.  \n\nThese schemes are never worth it, and a $33 trillion national debt is completely unsustainable.  \n\nWe will always stand against the war machine.", "Why are we spending fortunes and spilling blood overseas? \n\nIt’s time to bring our troops home and stop the endless wars. We should be building bridges of trade, not dropping bombs. \n\nPeace and respect—these are principles worth standing for.", "You can't have limited government with unlimited military intervention.", "Modern police forces aren't designed to protect, they're designed to murder.\n\nEnd their patrols.\nDisarm their traffic personnel. \nEnd their no-knock raids.\nEnd their qualified immunity.\nLiquidate their LRAD, MRAP, and other military-grade equipment.", "You are most certainly not. Even as Americans languish, you send billions of dollars to Ukraine and Israel.\n\nAll while the IRS seizes our wealth, and the Fed destroys what's left of it through the money printers.", "We would say you are betraying your eyes and ears to portray it as a violent insurrection, but you're a professional propagandist.\n\nAll the murderous foreign wars you supported that killed millions? Those were truly violent.", "FISA 702 shreds the Fourth Amendment without shame. It must be opposed at all costs."], "beinlibertarian": ["C’mon Mexico, \n\nOpen the damn gate toGaza.", "MAGA will be so infuriated by today’s verdict that they’ll just go to work tomorrow mad instead of burning down Targetsandthe media will call them deplorable.", "Dear Donald Trump & MAGA,\n\nIf you’re looking for a libertarian coalition to partner with… here it is. \n\nSupportandendorse “Defend the Guard”andjoin us.  \n\nRespectfully,@beinlibertarian•Dan McKnight, Chairman of Bring Our Troops Homeandret. U.S. Marine Corps\n\n•Ron", "End the Fed \nEnd the Wars \nEnd the Drug War\nEnd immunity for drug companies \nEnd the Gov-Media Complex\nEnd corporate bailouts \nEnd fake inflated money\nEnd the Patriot Act\nEnd spying on Americans\nEnd censorship \nEnd unaccountable politicians \nEnd the CIA\nEnd the IRS \nEnd the FBI", "You say “Global Day ofJihad\" but all I’m hearing is Global Day of Open Carry", "A highly strategic port full of Navy vessels was hit with a surprise attack by an invading fleet of aircraft that sunk a fleet. \n\nThe most protected man on the planet was allowed to ride in an open cab around Dallas\n\nThe most secure airspace in history allowed planes to be", "New info: Marcee Gray (shooter's mom) called to warn Apalachee High School. 10 minute long call to the school at 9:50 a.m. to warn them of a possible threat after receiving an odd text message from him. Police were notified of the shooting around 10:20 that morning.", "They called you an anti-vaxxer because you didn’t want to take that one multi shot vax that hadn’t proven itself to be safe or effective even though you had every other vaccine they recommended \n\nThey call you an antisemite if you question the one Israeli policy of bombing", "MAGA will be so infuriated by today’s verdict that they’ll just go to work tomorrow mad instead of burning down Targets and the media will call them deplorable.", "End the Fed \nEnd the Wars \nEnd the Drug War\nEnd qualified immunity \nEnd laws with no victim\nEnd corporatism \nEnd fake inflated money\nEnd the Patriot Act\nEnd spying on Americans\nEnd censorship \nEnd unaccountable politicians \nEnd the CIA\nEnd the IRS\nEnd the Gov/Media Complex", "End the Fed \nEnd the Wars \nEnd the Drug War\nEnd whistleblower punishment \nEnd laws with no victim\nEnd corporatism \nEnd fake inflated money\nEnd the Patriot Act\nEnd spying on Americans\nEnd censorship \nEnd unaccountable politicians \nEnd the CIA\nEnd the IRS\nEnd the FBI\nEnd the", "You’re never going to believe this…\n\nBut the CIA lied about Lee Harvey Oswald and JFK", "This is like Jeffery Dahmer complaining about all the dead people in his house", "No U.S. President can go to war without congressional approval either, but here we are.", ".@RealSpikeCohenis amazing.  So is Rand, Amash, and Massie. \n\nDave and Vivek are getting the attention right now in their news feeds"], "theintercept": ["IsraelandIsraelAlone Kicked Off This Escalation — In a Bid to Drag U.S. Into War With Iranhttps://interc.pt/3TQeQtWby@mazmhussain", "Hundreds of Palestinian Doctors Disappeared Into Israeli Detentionhttps://interc.pt/3KcoSB8by@KaviChek", "The U.N. is powerless to helpGaza—andthat’s exactly how the U.S. wants it.\n\nRead more from@schwarzbelow.", "American Medical Missions Trapped InGaza, Facing Death by Dehydration as Population Clings to Lifehttps://interc.pt/3UDG0o7by@ryangrim,@Hind_Gaza", "Kathy Hochul’sIsraeltrip bankrolled by group funneling tax-exempt money to illegal settlementshttps://interc.pt/3SqvFN4by@akela_lacy,@chrisgelardi", "The U.N. could call for a humanitarianceasefirein Israel’s bombing of Gaza.\n\nInstead, it’s little more than a powerless debating society, thanks to the U.S. and other countries.\n\nRead more below.", "ICJ Ruling on GazaGenocideIs a Historic Victory for the Palestinians That Israel Vows to Defyhttps://interc.pt/3ScOi5kby@jeremyscahillhttps://interc.pt/3ScOi5k", "While the world focuses on theHamasmassacrein Israel and Israel’s bombing of Gaza, settlers in the West Bank are taking advantage of the chaos to attack and expel Palestinians from small villages.\n\nIn partnership with@972mag.", "Israel responds toHamascrimes by ordering mass war crimes in Gazahttps://interc.pt/3FaiyYkby@alicesperi", "Leaked NYT Gaza Memo Tells Journalists to Avoid Words “Genocide,” “Ethnic Cleansing,” and “Occupied Territory”https://interc.pt/3UhuSyhby@jeremyscahill,@ryangrim", "The U.S. political class has decided to call all actions supporting aceasefire“pro-Hamas.” This is simultaneously vicious, dangerous, and extraordinarily stupid, writes@schwarz."], "nbcnews": [], "NPR": [], "TheAtlantic": [], "gmail": ["Reaching out via#Gmailis the ultimate act of love. We don't make the rules", "That moment when you thought EOD meant ‘End of December’", "Sending good vibes to everyone who has received an email saying they were kicked out of the family phone plan", "Is it \"Let's circle back after the holidays\" season yet?", "Slamming the laptop shut til Monday felt soooooo good at the time. →https://goo.gle/442WMRS", "Let's be vulnerable for a second: How many unread emails do you have in your inbox?", "Anyone else's New Year's resolution getting to inbox zero? For the 4th year in a row...?", "Pro-tip: Don't just report spam. Take it a step furtherandblock→https://goo.gle/48UPgtq", "You're welcome. Reach out if you have any questions in the future. We're just a tweet away.", "Hi Suraj. Have a look at this article to block or unsubscribe from emails:https://goo.gle/2Q0I7m4. Also, could you submit feedback regarding this by following the steps in this article:https://goo.gle/3cJz4il? Appreciate it.", "Tag the person who is always at inbox zeroandwhy are you scared of them?", "A PUPPY NAMED AFTER US!! We've officially made it!!", "Welcome to earth gmail", "Make that list, check it twice. Then track your holiday packages with ease in#GmailOpt-in to get package trackinghttps://goo.gle/46eT3Af", "No but why are you logging in from a new device?", "Still thinking about that accidental \"Reply all\" from two years ago", "Pro-tip: Free up space in your Gmail by deleting large files that are no longer needed. In the search bar, type \"larger:5M\".\n\nThis retrieves all emails bigger than 5 mb. Simply delete the ones you don't need! Learn more →https://goo.gle/3UQsCys", "As of now, everything is a next week problem. This mailbox is closed for the week#longweekend", "What should we call the#Gmailfandom?", "Note to self: Use less exclamation marks!!!", "2 more weeks till \"see you next year\" season", "Ask for their#Gmailinstead of their phone number", "On Wednesdays we learn how#Gmailcan help you save time↓", "Snooze in#Gmailhelps you postpone emails and temporarily remove them from your inbox until you have time for them→https://goo.gle/45GGsW9", "Feeling nostalgic. How old were you when you first made your#Gmailaccount?", "Not us spending hours coming up with our own emoji recipes. Try it now and thank us later→https://goo.gle/3Ob3SNK", "Drop aand we'll reply with a#GoogleMeetbackground that suits you", "It’s the New Year, but our brains are still on holiday.Try Formalize my draft with Duet AI in#Gmailto ask for an assignment extension. →https://goo.gle/48gZowV", "Nothing feels as good as sending a work email and realizing it's only 9 am", "Go ahead, emoji react to that email from your boss", "What's some good news you received via#Gmailin 2023?", "Tuning into a#GoogleMeetcall only to realize everyone is joining the call from the same office", "Gmail’s AI-powered defenses stop more than ___% of malware and phishing attacks from reaching inboxes:"], "AP": ["BREAKING:Israel’s military has directed the hundreds of thousands of residents inGazaCity to evacuate “for their own safetyandprotection,” ahead of a feared Israeli ground offensive.", "The Israeli military says a misfired Palestinian rocket caused a deadly explosion at aGazahospital. The Hamas-run Health Ministry says it was an Israeli airstrike that killed hundreds.", "In theGazaStrip, at least 256 people were killed in Israeli strikes, including 20 children,andclose to 1,800 wounded, the Palestinian Health Ministry said.Israelstruck 426 targets inGaza, flattening residential buildings, its military said.", "Israel’s national rescue service says the death toll has risen to 70 in the Hamas militant group’s incursion in southernIsrael.\n\nThe figures make Saturday the deadliest day of fighting on the Israeli side in decades.", "UPDATE: The massive blast killed hundreds at aGazaCity hospital, the Hamas-run Health Ministry said. Hamas blamed an Israeli airstrike, while the Israeli military said the hospital was hit by a rocket misfired by Palestinian militants.", "BREAKING: At least 50 Palestinians killed in Gaza airstrikes during the Israeli rescue operation of 2 hostages", "Israel’s military campaign in Gaza seen as among the most destructive in recent history, experts say", "No refuge: Over 180,000 Palestinians in the Gaza Strip are packed into U.N. shelters as Israel pounds the territory of 2.3 million people. Residents say there is no escape from the bombings. The U.N. says a shelter was hit directly and five others damaged.", "BREAKING: Health officials say more than 12,300 Palestinian minors have been killed in Israel's war onHamasin Gaza", "BREAKING: Israeli Prime Minister BenjaminNetanyahusays soldiers were beheaded and that women were \"raped and slaughtered\" inHamasmilitants' attack."], "BadFaithPod": [], "BreitbartNews": ["If you let your government disarm you, they can then send criminals to your home for a \"random\" break-in/murder/rape/etc. to avoid the PR hit of another Ruby Ridge.https://trib.al/CraquVh", "The French government announced it was banning pro-Palestinian protests on Thursday, explaining they cause a disturbance to public orderandgive rise to racial hatred. Paris announced it would arrest organizersanddeport “trouble makers.”", "Sen.@MarcoRubio: “If you’re in America on a student visaandyou’re supporting Hamas, then it’s time for you to go!”", ".@PatriciaHeaton: “While the normies were having their lives, these psychopaths have been plotting on how to kill Jews,andthen Christians after that,andhow to take down Western civilizationanddemocracy,andhow to install Sharia law.”", "\"Think about all of these little angels that shouldn’t have been taken away… It happens all over the country. We need a safer country.”", "\"Think about all of these little angels that shouldn’t have been taken away… It happens all over the country. We need a safer country.”", ".@RealDonaldTrump: \"The drone attack on a U.S. Military Installation in Jordan, killing 3 American Servicemembers, and wounding many more, marks a horrible day for America.\"https://trib.al/3w8k6bB", "Communists hate humans.\nCommunists love death.\nCommunism cannot create, it only destroys.\n\nPass it on.https://trib.al/ZwZy7DR", ".@SpeakerMcCarthy: \"This had to be planned for quite some time. And anyone who tells you that Iran is not involved they are lying to you.\"", "An American life sacrificed to appease the \"uncommitted\" radicals."], "foxnews": ["'FAR FROM OVER': Nearly 11 months after the toxic crash,EastPalestine resident blasts the rail companyandthe government, saying \"Biden still hasn't been here.\"https://trib.al/g96wBNn", "‘BRUTALITYANDBARBARISM’: Dov Hikind gives a firsthand account of what he saw while visitingIsraelduring its war with terror group Hamas.https://trib.al/hFlXy4q", "Biden's arms embargo onIsrael'emboldens' Hamas missile strikes against Jewish state", "Israelactivist blasts 'Squad' Democrats' calls for ceasefire as war rages in Holy Land: 'Highly offensive'", "UN agency calls for ceasefire inIsrael-Hamas war: 'Matter of lifeanddeath for millions'", "‘ALLAHU AKBAR’: Pro-Hamas agitators burned American flagsandhoisted Palestinian ones as they descended on Washington, D.C. in a chaotic scene. Israeli PM Netanyahu was in the nation’s capital to address a joint session of Congress.https://trib.al/8Za0RRu", "BREAKING NEWS: Israel,Hamascease-fire deal with hostage release reportedly in final stages", "United Nations slammed for silence overHamasrapes, mutilation and murder of Israeli women, critics say", "Israel launches 10,000th airstrike againstHamas, as Palestinians seek shelter in crowded southern Gaza", "'SECURITY WILL BE RESTORED': Israeli soldier gives update on war withHamas, saying it's time to show the terrorists \"that terror will not\" continue.https://trib.al/m0XaTDO", "UN overwhelmingly votes for humanitarianceasefirein Gaza, rejects US, Austria amendments condemningHamas", "‘WOULD MURDER ALL OF US’: Israeli Prime Minister BenjaminNetanyahuis pledging to defeatHamas, likening the terrorist group to ISIS and the Nazis.https://trib.al/qGfNsPW", "\"This is Jihad. There are no rules in Jihad. They're raping women in fields, they're beheading babies.\" Woman whose family member was murdered byHamasdelivers  testimony to@SteveDoocyon@foxandfriends, detailing the gruesome scenes from the attacks.https://trib.al/PnDzOd6", "'LET ME BE CLEAR': Israeli Prime Minister BenjaminNetanyahureminds U.S. lawmakers that Israel is not alone in their fight againstHamas, adding the country will do \"whatever it must do to restore security\" and return \"our people safely to their homes.\""], "washingtonpost": ["AsIsrael’s war inGazacontinues, violence by Israeli settlers in theWestBankhas increased. But even before the war, settler attacks were on the rise.\n\nFollow our live coverage:http://wapo.st/3SO5dND", "Exclusive: Videosandphotos show settlers with guns trying to break down the gate of a home in Qusra, a Palestinian community in the Israeli-occupiedWestBank.\n\nSeventeen-year-old Obada Sae’ed Abu Srour was killed, alongside two others,andat least 12 were injured — the", "The historic Church of St. Porphyrius,Gaza’s oldest active church, was struck Thursday as it sheltered hundreds of Palestinians displaced by the war, according to religious officials.", "At least 43WestBankPalestinians have been killed by Israeli forcesandsettlers since Saturday. Even before the latest round of violence, at least 179 Palestinians in theWestBankhad been killed since January, according to the U.N.", "Israeli Prime Minister BenjaminNetanyahusaid “we are at war, and we will win it” Saturday afterHamaslaunched an assault and took captives following the 50th anniversary of the start of the 1973 Yom Kippur war.\n\nFor more live updates follow here.https://wapo.st/3ttsHg1", "Of the more than 1,400 people killed byHamas, there are some 200 badly damaged bodies that reman unnamed. Israel has turned to archeologists for help.", "A Human Rights Watch investigation published Thursday said an Israeli attack on a Gaza building in October had no apparent militant target, but killed 106 civilians, including 54 children, making it an “apparent war crime.”https://wapo.st/4aBZn89", "Breaking news: Israel issued a formal declaration of war againstHamason Sunday, promising retaliation for an unprecedented attack by the militant group, as the combined death toll for both sides passed 900."], "lpnational": ["No. \n\nNo more aid,@ZelenskyyUa. \n\nThe Ukrainian government should have never been given aid by the US in the first place.\n\nEnd all foreign aid now.", "Amendment I\n\nCongress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble,andto petition the Government for a redress of", "If you aren't outraged that Zelenskyy left Gonzalo Lira to die in prison, or that Julian Assange rots away in jail for exposing US war crimes, we don't believe your outrage about the death of Alexei Navalny.", "We would disband NATO.\n\nWe would withdraw from the UN.\n\nWe would terminate all involvement in the WEF.\n\nWe would leave the WorldBankto rot. \n\nWe reject globalism on every level because we seek to bring political power closer to the individual. \n\nNo exceptions.", "The Fed is actively waging a war against your wealth.\n\nIt's why gasandfood costs have skyrocketed.\n\nIt's why the dollar is worth 3% of what it was in 1913. \n\nIt's why Americans suffer.\n\nEnd the Fed, repeal all legal tender laws,andlet liberty thrive.", "You are most certainly not. Even as Americans languish, you send billions of dollars to UkraineandIsrael.\n\nAll while the IRS seizes our wealth,andthe Fed destroys what's left of it through the money printers.", "Libertarians: Can you at LEAST stop killing innocent people with our stolen tax dollars overseas?\n\nWashington DC:", "Getting involved in foreign wars enables politically connected bankers to destroy your money.\n\nGetting involved in foreign wars enables politicians to restrict your speech.\n\nGetting involved in foreign wars enables the military industrial complex to kill innocents in your name.", "Overseas military intervention makes us poor domestically, and allows the state to curtail our civil liberties.  \n\nThese schemes are never worth it, and a $33 trillion national debt is completely unsustainable.  \n\nWe will always stand against the war machine.", "Why are we spending fortunes and spilling blood overseas? \n\nIt’s time to bring our troops home and stop the endless wars. We should be building bridges of trade, not dropping bombs. \n\nPeace and respect—these are principles worth standing for.", "You can't have limited government with unlimited military intervention.", "Modern police forces aren't designed to protect, they're designed to murder.\n\nEnd their patrols.\nDisarm their traffic personnel. \nEnd their no-knock raids.\nEnd their qualified immunity.\nLiquidate their LRAD, MRAP, and other military-grade equipment.", "You are most certainly not. Even as Americans languish, you send billions of dollars to Ukraine and Israel.\n\nAll while the IRS seizes our wealth, and the Fed destroys what's left of it through the money printers.", "We would say you are betraying your eyes and ears to portray it as a violent insurrection, but you're a professional propagandist.\n\nAll the murderous foreign wars you supported that killed millions? Those were truly violent.", "FISA 702 shreds the Fourth Amendment without shame. It must be opposed at all costs."]}