{"ProudSocialist": ["Imagine thinking Democrats are “saving democracy” as they sue to kick third parties off the ballotandsuppress voters from having better choices on election day.", "Anyone who promises “hopeandchange” within a corrupt political system that is designed to serve Wall Streetandthe military industrial complex is a con artist so yes that means your favorite Democrat politicians are con artists just like the Republicans they pretend to resist.", "2016 was the last general election that I voted blue & I still regret it.\n\nI won’t waste one more vote on a party that promises change every election to get our votes only to sell us out to their corporate donors once they have power.\n\nI’m voting for Jill Stein & the Green party!", "Our third party vote counts alright, which is exactly why the Democrats are ramping up attacks on Jill Steinandthe Green party.", "Nobody should be surprised that@AOCis attacking@DrJillStein& the Green party:\n\nAOC along with Bernie have become the DNC’s biggest assets because they take grassroots energy & funnel it into a corporate party that fights AGAINST progress for the poor & working class.", "Our third party vote counts alright, which is exactly why the Democrats are ramping up attacks on Jill Stein and the Green party.", "Leaving this corrupt, vapid, corporate party is the best decision that I ever made.\n\nAnyone who thinks that the Democrats represent anything other than corporate interests is being duped.\n\nFind some courage and break free from the duopoly. It is the only way to make change.", "Imagine thinking Democrats are “saving democracy” as they sue to kick third parties off the ballot and suppress voters from having better choices on election day.", "RussiaGate is back so let’s clear something up: Russia didn’t make me leave the unDemocratic party. Democrats made me leave their party because they would rather collude with Republicans to serve big corporations and the military industrial complex than fight for everyday people."], "ComicDaveSmith": ["LiveIsrael/Palestine debate starting right now", "For the amount of times it’s been demanded that I condemn this kidandhaving never done it, you’d think if he were going to come outandcriticize me, he would at least have something to say other than “look at this guy believing in freedom while being Jewish.”\n\nFor the record,", "So now we’re all going to pretend that Dave Smith is THE redpilled guy and not a libertarian Jew who is willing to talk about neocons and deflect accusations of antisemitism?\n\nI like him but let’s be honest.", "Is there a dumber or more pathetically dishonest argument than@Rabbi_Barclay‘s here?\n\nWhat the hell does “self hating” even mean? I don’t hate myself. I’m awesome.\n\nJews are a people.Israelis a government. I can believe that whatIsraelis doing,andhas done, to the", "For those interested: From the great@scotthortonshowand@FreemansMind96", "I don’t think there’s anything secret about it. Anyone can read “A clean break’ A major contributing factor to the neocons desire to remove Saddam was Israeli interests.Andthey were openly supportive of the war. Of course, that doesn’t absolve anyone.\n\nMy point is more that", "I’m sorry but it is just incredibly dishonest for@bungarsargonto claim that@cenkuygurandI said anything that resembles whatIsraelis doing is what ought to be the response to 10/7. Anyone who watched the debate knows this is BS. I’m disappointed in her,@wethefifth", "Noam, I’ve debated this issue in long form shows against formidable opponents many times,andI’ll do more.\n\nI asked point blank ifIsraelwould be justified in mowing down childrenandhe said the answer is yes. Seems pretty clear.\n\nThe fact that rather than call out this", "Wait, so because the war made Yitzhak sad that means it wasn’t preemptive? Btw, what did Dayan say was the reason Arabs hated them? I’ll give you a hint: it wasn’t for their freedom.", "Picking and choosing quotes to serve your opinion.\nYitzhak Rabin, who was the IDF Cied of Staff, didn't function most of the 6 Day War because he was in deep depression because he thought that would be the end of Israel. Dayan had to step in.", "It’s wild that you have the nerve to say I’m incapable of dealing with an argument after our last exchanges. There’s a reason why everyone is telling you that they are embarrassed on your behalf.\n\nI’ve already torn this ridiculous argument to pieces when I debated Austin.", "I can't imagine you care, but you seem incapable of actually dealing with the argument and instead are looking for details to use to defend yourself. Understandable, but disappointing.\n\nYou're talking past the issue to \"win.\" The issue is the framing of conversations around all", "Leaving aside the stupidity of judging someone off of what they don’t say, you’re just wrong. I’ve repeatedly called out the protesters behaving this way and taken heat from “my side” for it, most recently on@piersmorganI hate protests like this. I can’t stand people who chant", "@ComicDaveSmith, the reason Jewish people call you a self-hating Jew is because you're completely quite on the \"protests\" on college campuses that are straight up calling for \"more Oct 7th 10,000 times\", &\"Go home to Poland Jew\".\n\nYou're vocal on many things, why quite on this?", "Because Israelis have built a home there for generations. Both the PLO and evenHamashave accepted those terms at different points and it just seems like the best, most reasonable compromise.", "Can you please elaborate why 67 borders?", "This was the piece that I mentioned yesterday on JRE by@scotthortonshowand@FreemansMind96", "The deranged lefties who are openly celebrating whatHamaspulled off are the worst enemies of people who are actually concerned with the plight and oppression of Palestinians. If they were working for Mossad, they couldn’t do a better job.", "Noam, I’ve debated this issue in long form shows against formidable opponents many times, and I’ll do more.\n\nI asked point blank if Israel would be justified in mowing down children and he said the answer is yes. Seems pretty clear.\n\nThe fact that rather than call out this"], "LPTN1776": ["Taxation is, OF ANY TYPE, is still theft.", "Milei is NOT like Donald Trump, pass it on.", "“If they can do this to Trump they can do it to you.” \n\nIdk if y’all have noticed, but they’ve been doing this to the common man for awhile.", "Those saying, “oh, I’m voting Trump now because he said he’ll free Ross!” Please, ask yourself, “why didn’t he do that in his first term?”", "Who said this? “Take the guns first go through due process later.”", "Except when it’s the Covid vaccine, then screw your bodily autonomy.", "Stop making them sound more based than they actually are.", "You’ve turned your back on the American people.", "A fair tax code would be to abolish the IRS.", "Time to turn the Pentagon into apartments.", "“Why did the housing prices go up by $10,000?”", "At least he showed up to the convention. Y’all couldn’t wake up Joe for a speech?", "@MarshaBlackburn@BillHagertyTNhow does it feel that Bernie Sanders knows when there’s a fourth amendment violationandyou don’t? What does that make y’all?", "You should not be forced to fund anything you’re morally against. Taxation is theft.", "If Tennessee ever secedes from the United States () we’re coining the term Tennesseeyalater.", "We should abolish the FBI. They’ve been politicized and have just tried to go after political enemies since their inception.", "You’re ending the federal reserve, abolishing the IRS, and putting us back on the gold standard?", "Coming from the bank that didn’t shut down Jeffrey Epstein’s accounts… sure bud.", "“Why did the housing prices go up by $10,000?”", "Nothing stopping you from opening your own wallet and donating to the them, or even joining the Ukrainian army. So why don’t you do it?", "At least he showed up to the convention. Y’all couldn’t wake up Joe for a speech?", "You are not entitled to the labor of someone else.", "Let the market decide if lab grown meat if it is a good idea. Not banning it.", "The cost of living would skyrocket if we did this… you realize this right?", "Then you should volunteer and go yourself.", "Do you not realize that will make the price of cars skyrocket?"], "checkmatestate": ["Republicans: “Gun-free zones are stupid because murderers don’t follow laws.”\n\nAlso Republicans: “Gun control laws for illegals are smart because illegal immigrants will follow the law.”", "I see libertarians saying Trump’s conviction makes them more excited to vote for him.\n\nWhy?\n\nThis was clearly a politically motivated prosecutionanda perversion of justice.\n\nSo what? Did it make Trump less authoritarian somehow?\n\nExplain yourselves.", "Republicans: “Gun-free zones are stupid because murderers don’t follow laws.”\n\nAlso Republicans: “Gun control laws for illegals are smart because illegal immigrants will follow the law.”", "Underrated meme.\n\nNuclear power is the solution to so many problems."], "ajc": ["Georgia senators secure $80 million for housing authorities", "“I’m not here as a Democrat or Republican,” former Lieutenant Governor Geoff Duncan said. “I’m here as an American that really, truly cares more about the future of this country than I do about Donald Trump’s future.”", "#BREAKING: A portion of Midtown Atlanta’s Peachtree Street is closed at the top of Thursday morning’s commute after a person locked themselves to equipment at a construction site to protest Atlanta’s planned public safety training center.", "#BREAKING: According to cellphone data in a court filing by Donald Trump attorneys, Nathan Wade appeared to make three dozen visits to the Hapeville neighborhood before she hired him, raising questions about the relationship between the two prosecutors", "#BREAKING: A federal judge ruled Thursday that Georgia’s district lines must be redrawn to ensure adequate representation of Black voters in Congressandthe General Assembly, finding that the state’s maps illegally weakened their political power.", "#BREAKING: The personal diary of Manuel “Tortuguita” Teran, an activist who died after exchanging fire with police near the site of the planned public safety training center, was filled with phrases such as “Cop cars love being on fire;” “Prisons were built to be burnt down,”", "WATCH: Shawn Sanders and Oneida Oliver-Sanders were in their living room Tuesday morning, less than 48 hours after learning that their 24-year-old daughter, Spc. Kennedy Ladon Sanders, was killed in a weekend drone attack on U.S. service members in Jordan. Then President Joe", "The parents of Spc. Kennedy Ladon Sanders, one of three U.S. reservists from Georgia killed in the drone strike in Jordan, received a phone call from President Biden, offering condolences and promoting her posthumously to sergeant. Read more:https://bit.ly/3HGf7tJ", "From Atlanta Journal-Constitution cartoonist Mike Luckovich: Rosalynn’s farewell", "The AJC has made our coverage of former first lady Rosalynn Carter free to all during this time. Readers are able to access our content on her life and legacy after registering.\n\nFollow our continuing coverage as the world pays tribute Mrs. Carter:https://bit.ly/3MREQlR"], "RBReich": ["I’m Jewish. I detest Hamas. I know what it’s like to have family members murdered because of their beliefsandethnicity.\n\nWhich is why I take social justiceandhuman rights so seriously.Andwhy I, like millions of others, am committed to a ceasefire inGaza.", "It’s time for all of us who care about human rights to demand a ceasefire inGaza. Now.", "It’s time for all of us who care about human rights to demand a ceasefire inGaza. Now.", "It’s time for all of us who care about human rights to demand a ceasefire inGaza. Now.", "I’m Jewish. I detestHamas. I know what it’s like to have family members murdered because of their beliefs and ethnicity.\n\nWhich is why I take social justice and human rights so seriously.\n\nAnd why I, like millions of others, am committed to aceasefirein Gaza.", "It’s time for all of us who care about human rights to demand aceasefirein Gaza. Now.", "It’s time for all of us who care about human rights to demand aceasefirein Gaza. Now.", "It’s time for all of us who care about human rights to demand aceasefirein Gaza. Now."], "theintercept": ["The New York Times, LA Times,andWashington Post paid little attention to the unprecedented impact ofIsrael's siegeandbombing campaign on both childrenandjournalists in theGazaStrip, according to The Intercept's analysis of their coverage.", "Israelhas killed more than 24,000 peopleandwounded another 61,000+ inGaza. Bernie Sanders forced a vote on directing the State Department to look into the damage, opening up the possibility for the U.S. to limit aid toIsrael. \n\nThe Senate shut it down.", "The Misgav Institute for National Security & Zionist Strategy published a paper last week stating that thanks to the vicious Hamas attacks of October 7, “There is currently a uniqueandrare opportunity to evacuate the entireGazaStrip.”", "Facing international charges of genocide, Israeli officials said they’ll be ramping down their wide-scale assault onGaza.\n\nNevertheless,Israelcontinued dropping bombs on ambulances, hospitals,andDoctors Without Borders shelters this week.", "“The IDF didn’t anticipate that there would be this much backlash to Israel. And, with the prospect of an even longer-termceasefire, are putting together an all-hands-on-deck PR blitz to keep senators at bay.”", "“It’s just a slow death, just waiting to die. There’s no food, they get water now four hours a day, no electricity. It’s horrifying. What’s happening is literally slow death.”\n\nMaram Al-Dada joins@ryangrimto discuss his family’s experience in Gaza.", "“My family is being killed on my dime,”@gazamomtold the court. “President Biden could, with one phone call, put an end to this.”", "“It’s not too late to change your stance and stand on the righteous side of history.”\n\nSixteen former campaign staffers for Sen. John Fetterman penned an open letter urging him to support an Israel-Hamasceasefire.\n\nRead more here.", "\"If we lived in a just society... U.S. officials would be appearing in international war crimes tribunals alongside the Israeli leaders whose criminal actions they are facilitating in every measurable manner,\" writes@jeremyscahill.", "We might not like it, but as Americans, our money is paying for Israel’s atrocities in Gaza.\n\nJon@Schwarzcalculated how much of his money the U.S. sent to kill Palestinians. You can, too.", "NetanyahuInsulted and Smeared the Pro-Palestine Protest Movement. Congress Clapped.https://interc.pt/3Wmge8Xby@jonahmv", ".@prem_thakkerasked the State Department about the hundreds of thousands of children suffering in Gaza to the point of wanting to take their own lives — and whether there’s concern Israel’s war on Gaza may radicalize an entire generation of Palestinians.\n\nHere’s what they said:", "Despite Israel’s war on Gaza being perhaps the deadliest war for children — almost entirely Palestinian — in modern history, there is scant mention of the word “children” in the headlines of articles surveyed by The Intercept.", "“There was always somewhere to go, no matter how horrible the refugee situation was, or the war situation. And this is the first time where there was no — and there is to this day, which I find just mind-boggling — there is no safe place to go. Nowhere.”", "“What we’re seeing every single day in Gaza is gut-wrenching,” Antony Blinken told New York Times columnist Thomas Friedman at an event in Davos, Switzerland, as though he has not been one of the premiere enablers of the destruction of Gaza.", "The ICJ Ruling Confirms What Palestinians Have Been Saying for 57 Yearshttps://interc.pt/3Lv9IHJby@jonahmv"], "TheRickWilson": ["If you think it's bad thing that the leaders of HamasandHezbollah got whacked yesterday, just unfollow.", "No, he doesn't. \n\nThis is a war of aggressionandgenocide targeting civilians brought about by Vladimir Putinandhis corrupt regime,andhe's clearly fine with it.", "You’re upset because he wants to stop a war…\n\nYikes.", "All your gifts, wasted on a dissolute con man, a rapist, serial adulterer, a bankrupt wastrel,andan eager authoritarian who has stoked more violence, hatred, division, death,andchaos than any President in modern history.\n\nYou, sir, are the cause of deathandbomb threats", "Yesterday, Donald J. Trump nearly lost his life. An armed gunman waited for him in the bushes. He brought a go-pro camera to record it. A secret service agent spotted the barrel of a gun through a fence and shot at the gunman. The gunman fled. He was caught. And now we slowly", "Russia’s ally Iran is attackingIsrael.\n\nMAGA brain melt imminent.", "1. The traces are constellation of charnel campsandmass graves across a continent. Ovens. Gas chambers. Bullets. Pits. Starvation. Slave labor until death. \n\n2. The Nazis meticulously documented their evil. While some orders were deliberately vague or euphemistic, there arehttps://x.com/MinTonyAdams/s/MinTonyAdams/status/1732359875433222264…", "I mean, I say this with some hindsight perspective...but De-Ba'athification ended up helping Iran, mostly.", "JD Vance: “We need a De-Ba’athification program in the U.S....We should seize the administrative state for our own purposes. We should fire all of the people...every single middle-level bureaucrat, every civil servant in the administrative state. Replace them with our people.”", "They put \"Israeli\" in quotes for a little more license to attackanddehumanize them.https://x.com/chaim89/status/chaim89/status/1719174781889663013…", "I think what people are having a hard time believing is that if you won’t even say the word “antisemitism” while describing this problem, at some level you fundamentally don’t really think it’s a problem.", "X’s point of view has always been very clear that discrimination by everyone should STOP across the board -- I think that's something we can and should all agree on. When it comes to this platform -- X has also been extremely clear about our efforts to combat antisemitism and", "Does the Islamic State understand the fury they've unleashed? The dread they should feel? \n\nTayqaeda is unleashed. Nothing will stop them.", "BREAKING:\n\nIslamist terror attack likely targeting Taylor Swift concert in Austria foiled.\n\nThe authorities revealed that the IS supporting terrorists where planning to detonate, most likely at one of the three Taylor Swift concerts taking place in Vienna this weekend.\n\n2 men", "As always on this grim anniversary, I ask you keep Terry Hatton, Mychal Judge OFM, Barbara Olson,andthe thousands lost on that terrible morning in your hearts today.", "Fixed it for you: \"...is declared the winner by his own corrupt and despotic regime.\"", "BREAKING: Venezuela's President Nicolás Maduro is declared the winner in the presidential election amid opposition claims of irregularities.https://apnews.com/live/venezuela-election-updates-maduro-machado-gonzalez?taid=66a71701473b6400017a3c3f&utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Twitter…", "I mean, I say this with some hindsight perspective...but De-Ba'athification ended up helping Iran, mostly.", "JD Vance: “We need a De-Ba’athification program in the U.S....We should seize the administrative state for our own purposes. We should fire all of the people...every single middle-level bureaucrat, every civil servant in the administrative state. Replace them with our people.”", "If you think it's bad thing that the leaders ofHamasand Hezbollah got whacked yesterday, just unfollow.", "No, he doesn't. \n\nThis is a war of aggression andgenocidetargeting civilians brought about by Vladimir Putin and his corrupt regime, and he's clearly fine with it.", "You’re upset because he wants to stop a war…\n\nYikes.", "All your gifts, wasted on a dissolute con man, a rapist, serial adulterer, a bankrupt wastrel, and an eager authoritarian who has stoked more violence, hatred, division, death, and chaos than any President in modern history.\n\nYou, sir, are the cause of death and bomb threats", "Yesterday, Donald J. Trump nearly lost his life. An armed gunman waited for him in the bushes. He brought a go-pro camera to record it. A secret service agent spotted the barrel of a gun through a fence and shot at the gunman. The gunman fled. He was caught. And now we slowly", "Does the Islamic State understand the fury they've unleashed? The dread they should feel? \n\nTayqaeda is unleashed. Nothing will stop them.", "BREAKING:\n\nIslamist terror attack likely targeting Taylor Swift concert in Austria foiled.\n\nThe authorities revealed that the IS supporting terrorists where planning to detonate, most likely at one of the three Taylor Swift concerts taking place in Vienna this weekend.\n\n2 men", "All civilian targets. I'm sure David Sacks will condemn it...right?", "Minutes from now, Kyivwill sustain a significant attack frommissiles.", "As always on this grim anniversary, I ask you keep Terry Hatton, Mychal Judge OFM, Barbara Olson, and the thousands lost on that terrible morning in your hearts today."], "FreemansMind96": ["In a society with even a moderate level of self-respect, Graham would be behind bars", "It is blood libel and BS to say Israel is using starvation as a tool of war.", "I'm gonna go out on a limbandsuggest the LP bump the other candidatesandnominate@ComicDaveSmithfor this task, even if he's not running. \n\nDave Smith, Kennedy,andTrump is the debate we deserve.", "If this happens and the LP gets a candidate up there, it would really be something x.com/RobertKennedyJ…", "Everybody can see that you went to Time Squareandthe skate rink looking for Muslims to harassandprovoke so you could stoke hate against antiwar protesters, Muslims, Arabs,andPalestinians. All while the foreign apartheid state you’re acting on behalf of commits this genocide", "I guess they’re angry with the Israeli apartheid spokeswoman because they’re also upset about the genocide taking place in PalestineGet a life, amirite?", "In a society with even a moderate level of self-respect, Graham would be behind bars", "It is blood libel and BS to say Israel is using starvation as a tool of war.", "I'm gonna go out on a limb and suggest the LP bump the other candidates and nominate@ComicDaveSmithfor this task, even if he's not running. \n\nDave Smith, Kennedy, and Trump is the debate we deserve.", "If this happens and the LP gets a candidate up there, it would really be something x.com/RobertKennedyJ…", "Everybody can see that you went to Time Square and the skate rink looking for Muslims to harass and provoke so you could stoke hate against antiwar protesters, Muslims, Arabs, and Palestinians. All while the foreign apartheid state you’re acting on behalf of commits thisgenocide", "I guess they’re angry with the Israeli apartheid spokeswoman because they’re also upset about thegenocidetaking place in PalestineGet a life, amirite?"], "AmpedUpPodcast": [], "nbcnews": ["Rep. Rashida Tlaib is facing backlash from some her fellow Democrats, including from her state of Michigan, over her recent remarks about Palestinians amid the ongoing war betweenIsraelandHamas.", "How did the U.S.andIsraelmiss what Hamas was planning?\n\nThe surprise attack by air, landandsea suggests a massive intelligence failure as the Israeli government appeared blindsided.", "How did the U.S.andIsraelmiss what Hamas was planning?\n\nThe surprise attack by air, landandsea suggests a massive intelligence failure as the Israeli government appeared blindsided.", "A series of shocking reports have spread horrific claims of baby beheadings by Hamas militants across socialandmainstream media in recent days. But the reports are unconfirmed,andin some cases have been retracted.", "Hamas says it has taken “dozens” of Israeli soldiers hostageandmoved them to theGazaStrip.\n\nFootage verified by@NBCNewsappears to show Israeli hostages, many of them women, being walked up the street by gunmen wearing military fatigues.", "Senior Biden administration officials have privately urged Israeli officials to show restraint and avoid mass civilian casualties, according to two current and one former U.S. official.", "BREAKING: Iran launches drones toward Israel, according to an IDF spokesperson, in an attack that Tehran had promised to carry out after its embassy in Damascus was hit last week.", "The White House is criticizing former President Trump's response to the Israel-Hamaswar, characterizing his call for an expanded travel ban \"revolting and dangerous.\"", "Researchers have uncovered a propaganda network of 67 accounts on the X social platform that are coordinating a campaign of posting false, inflammatory content related to the Israel-Hamaswar.", "Water has begun to run out in Gaza, a U.N. agency says, putting 2 million people at risk of dehydration and contracting water-borne diseases from consuming contaminated fluids.\n\n\"It has become a matter of life and death.\"https://nbcnews.to/3ZXRogMMahmud Hams / AFP", "According to@NBCNewsanalysis of videos, photos, and interviews with university staff and students, at least 5 of Gaza’s 7 major universities have been destroyed or partially damaged since the start of the Israel-Hamaswar.http://nbcnews.app.link/nLNnEi5VwIb"], "NPR": [], "DailyCaller": ["Netanyahu thanks President Trump for his leadership in brokering the Abraham Accordsandcondemns the assassination attempt he faced:", "NETANYAHU: \"Some of these protesters hold up sign proclaiming 'gays forGaza' they might as well hold up signs saying chickens for KFC!\"", "WATCH: Protestors at GW try to raise Palestinian flag, but police immediately cut it down.https://x.com/sfmcguire79/st/sfmcguire79/status/1787678673379750398/video/1…", "An anonymous group has set up a massive TV outside the UCLA encampment showing footage of the Oct. 7th Hamas attack onIsrael", "ADL CEO: “I love this network. But I’ve gotta ask ‘Who is writing the scripts?!’ \nHamas — they are not fighters — they are not militants — they are TERRORISTS!”", "AFTERMATH: Anti-Israelprotestors tryandwash eyes after police deploy pepper spray", "Netanyahuthanks President Trump for his leadership in brokering the Abraham Accords and condemns the assassination attempt he faced:", "AFTERMATH: Anti-Israel protestors try and wash eyes after police deploy pepper spray", "An anonymous group has set up a massive TV outside the UCLA encampment showing footage of the Oct. 7thHamasattack on Israel", "Rashida Tlaib holds up a 'War Criminal' sign atNetanyahu's address to Congress:", "ADL CEO: “I love this network. But I’ve gotta ask ‘Who is writing the scripts?!’Hamas— they are not fighters — they are not militants — they are TERRORISTS!”"], "Morehouse": ["Morehouse College will welcome Joseph R. Biden, the 46th President of the United States of America, as its keynote speaker for the 140th Commencement Exercises on Sunday, May 19, 2024, at 9 a.m. on the College's Century Campus.\n\nFor more info, visithttp://morehouse.edu/commencement.", "Dr. David A. Thomas to retire as president of Morehouse College at the end of the 2024-2025 academic year. View the full news releaseandread Dr. Thomas's letter to the Morehouse community on the Morehouse Newsroom athttp://news.morehouse.edu.", "#MorehouseCommencement2024140 commencement ceremonies celebrating excellence, empowerment,andenlightenment!Congrats to the Class of 2024 on reaching this incredible milestone. Here's to forging ahead with purpose, passion,andpride!#Morehouse140#MorehouseCollege", "Let's#TBTto 1972andwish our brother - with over 200 movie credits - the oneandonly Samuel L. Jackson ’72 (@samuelljackson) - a joyous 75th birthday!\n\nCredit: Morehouse College Torch Yearbook, 1972#Morehouse#MorehouseCollege", "#MorehouseBaccalaureate2024: “But all of my help!…” \n\nSenior pastor of the Fellowship Missionary Baptist Church in Chicago, IL, Reginald W. Sharpe Jr. '13, charged the class of 2024 to hold their head up despite looming challenges as they prepare for the world after graduation.", "MorehouseCommencement2024As the sun sets on another remarkable chapter in Morehouse College's history, we stand in awe of the brilliance, resilience, and determination of the class of 2024. \n\nCongratulations, graduates! The world awaits your brilliance.", "“We are destined for GREATNESS!”On their annual service trip to high schools across the nation, Morehouse College students participated in the#GetontheBusinitiative at Evans High School in Orlando, Florida.#Morehouse#MorehouseCollege#MorehouseisEverywhere", "Dr. David A. Thomas to retire as president of Morehouse College at the end of the 2024-2025 academic year. View the full news release and read Dr. Thomas's letter to the Morehouse community on the Morehouse Newsroom athttp://news.morehouse.edu."], "LPNH": ["- The border crisis\n- Kyle Rittenhouse vs the hidden Kansas City shooters\n- Daniel Penny\n- The Black Lives Matter riots\n\nThe government doesn't exist to create order.\n\nIt exists to protect criminals from upstanding citizens.", "A reminder: Reason magazine is propaganda.\n\nThe majority of their funding comes from just 4 entities, not subscriptions or advertisements.\n\nThey literally exist to lie to people about libertarianism.\n\nTucker may get some things wrong, but Reason journalists are no better.", "Since everyone is sharing their I-told-you-so receipts about Tucker Carlson today, here's mine:https://reason.com/2023/05/11/tucker-carlson-is-lying-to-you/…", "Free Ross Ulbricht\nFree Edward Snowden\nFree Julian Assange\nFree Ian Freeman\nFree Roger Ver\nFree Donald Trump\nFree Hunter Biden", "If you're a libertarian, please do not condemn \"political violence\".\n\nViolence is violenceandit's either justified or not justified.\n\nLibertarians do not believe that politicians are a special class of person with separate moral rights.", "People who still believe 1/6 was an insurrection are almost as dumb as the people still supporting Donald Trump", "Thank God that Trump wasn't shot. Now he can have a second term to:\n\n- Print more money than any president in history\n- Steal money to develop fake vaccines\n- Sue companies for \"racism\" when they perform background checks\n- Seize guns\n\nOh wait that was the first term.", "Sandy Hook:government school\nUvalde:government school\nParkland:government school\n\nTo mirror the language of the anti-gun tyrants, the only explanation for supporting government schools is that they hate childrenandwant them to die", "Memorize this line:\n\nI don't want to change your mind, but I don't want to share a country with you, either.", "No one should be bragging about their time in Iraq.\n\nEvery single one of these people should be apologizing.", "Does this look like the spending of a joint defensive force?", "A legal challenge has been mounted to decertify Chase Oliver and Mike ter Maat, alleging their selection is illegitimate.\n\nThis letter was leaked to us by a party member concerned about the integrity of the Libertarian Party.", "Sandy Hook:government school\nUvalde:government school\nParkland:government school\n\nTo mirror the language of the anti-gun tyrants, the only explanation for supporting government schools is that they hate children and want them to die", "Reminder: the left is willing to kill you \n\nThe left uses violence constantly and all of the time\n\nThey only freak out at the idea of violence when it is suggested the right play by the same rules", "Reminder: Nina Turner and other socialists support owning human beings"], "TheAtlantic": ["\"At a military base north ofTelAviv, theIsraelDefense Forces held a grisly matinee screening of 43 minutes of raw footage from Hamas’s October 7 attack,\"@gcawwrites. Read his full report here:https://theatln.tc/ylLP85ke", "“If Americans now have anything useful to tell Israelis,” George Packer argues, it’s this: “Don’t … Don’t imagine that overwhelming military force can solve an immensely complex historicalandpolitical problem.”", "\"Neither Israelis nor Palestinians are going anywhere,andneither will give up their national identity. Those who truly want peaceandjustice in the Holy Land should start by recognizing this reality,\"@arash_tehranwrites:", "\"Covert anti-Semitism tends to turn into overt anti-Semitism. Until we start seriously confronting the former, we can expect more of the latter,\" writes@Yair_Rosenberg:", "\"Againandagain, people say they intend to murder Jews,\"@Yair_Rosenbergwrites. \n\n\"Andyet, century after century, the world produces new, tortuous justifications for why anti-Jewish bigots don’t really mean what they say—even though they do.\"", "\"It is becoming clear that Hamas achieved ... a short-term victory so staggering that its leaders did not predict itandcould not handle it even as it was happening,andwhose massive long-term consequences are likely dire for Hamas,“@gcawwrites", "\"Againandagain, people say they intend to murder Jews,\"@Yair_Rosenbergwrites. \n\n\"Andyet, century after century, the world produces new, tortuous justifications for why anti-Jewish bigots don’t really mean what they say—even though they do.\"", "“If Americans now have anything useful to tell Israelis,” George Packer argues, it’s this: “Don’t … Don’t imagine that overwhelming military force can solve an immensely complex historical and political problem.”", "\"At a military base north of Tel Aviv, the Israel Defense Forces held a grisly matinee screening of 43 minutes of raw footage fromHamas’s October 7 attack,\"@gcawwrites. Read his full report here:https://theatln.tc/ylLP85ke", "\"Neither Israelis nor Palestinians are going anywhere, and neither will give up their national identity. Those who truly want peace and justice in the Holy Land should start by recognizing this reality,\"@arash_tehranwrites:", "\"Again and again, people say they intend to murder Jews,\"@Yair_Rosenbergwrites. \n\n\"And yet, century after century, the world produces new, tortuous justifications for why anti-Jewish bigots don’t really mean what they say—even though they do.\""], "people4liberty": [], "TeamWarnock": [], "OversightDems": ["The CCP is putting members of the Uyghur minority into forced labor camps to eradicate their identityandway of life.@RepRaskinreminds us that Donald Trump told President Xi these concentration camps were “exactly the right thing to do.”", ".@SecretService’s slow pace of providing even basic information about last week’s shooting has left space for misinformationandconspiracy theories to fill its silence.@RepJasmineis calling for opennessandtransparency in this investigation.", "From Kushner's $2B sweetheart deal to LIV Golf's use of Trump's courses to Trump's new hotel & golf resort in Oman, all bankrolled by Saudi cash, Trump & Crown Prince MBS sure had lots to talk about! \n\nIf@GOPoversightwants to investigate influence peddling, let’s get started!", "New: Former President Donald J. Trump spoke recently with Saudi Arabia’s de facto ruler, Prince Mohammed bin Salman, their first publicly disclosed conversation since Trump left office, according to two people briefed on the discussion. w@maggieNYThttps://nytimes.com/2024/04/03/us/politics/trump-spoke-recently-with-saudi-leader.html…", "Trump's far-right Supreme Court reversed 50 years of precedent, demolishing what was a fundamental right for U.S. women. Now, an extreme MAGA abortion ban has taken the life of a mother in Georgia who was denied timely medical care as she suffered a horrific sepsis infection.:", "Here they are:\n\nFalsely denied the existence ofbankrecords in the Committee’s possession.https://themessenger.com/politics/gop-touts-bombshell-biden-payments-but-records-suggest-otherwise…", "Trump took $5.5 million from the CCP.Kushner received $2 billion from Saudi Arabia.\n\nTrump and his family used the White House to cash in from authoritarians. This is a danger to democracy.", "While Trump wants to gaslight the American public about his involvement in Project 2025, the facts speak for themselves.\n\nMore than 200 former Trump Administration officials are responsible for crafting this blueprint to end democracy as we know it.", "Former President Trump and his minions in Congress are committed to turning a blind eye to America’s gun violence epidemic.\n\nTrump’s plan to gut the federal workforce threatens the health and safety of Americans nationwide.", "“Under the Biden-Harris Administration, OMB has made excellent strides in modernizing and revitalizing a federal government that was demoralized and gutted after four years of undermining and mismanagement.”—RM@RepRaskin", "The CCP is putting members of the Uyghur minority into forced labor camps to eradicate their identity and way of life.@RepRaskinreminds us that Donald Trump told President Xi these concentration camps were “exactly the right thing to do.”", "Trump's DOJ shut down the investigation into a potential $10 million cash bribe he pocketed and now Donald Trump won't even answer the most basic question: Did he or his campaign get any money from Egypt's dictator, AbdelFatahEl-Sisi?https://thehill.com/homenews/house/4860121-trump-egyptian-government-probe/…"], "Weaponization": ["The Biden ATF unnecessarily executed a search warrant in March 2024andkilled Arkansas firearm owner Bryan Malinowski.\n\nBud Cummins represents Malinowki’s widow. Watch his powerful testimony detailing this horrific raid.", "HEARING ADVISORY: Next week we’ll examine the use of lawfare tactics to weaponize the rule of law. \n\nDon’t miss it.", "“Donald Trump was railroaded. Judge Merchan was the driver of that train.” \n\nWatch the Honorable John H. Wilson outline how President Trump was denied a fairandimpartial trial in NYC.", "“Who gets to decide what to ban?” \n\nListen to@mtaibbi’s warning about the dangers of Big TechandBig Government censorship.", "HEARING ADVISORY: Next week we’ll examine the use of lawfare tactics to weaponize the rule of law. \n\nDon’t miss it.", "Freedom of speech 83% of the time doesn't sound free to me.", "Unelected bureaucrats and Big Tech companies NEVER should collude to dictate what Americans can say or read online.\n\nBut here we are.@RepStefanikblasts the Censorship Industrial Complex", ".@America1stLegalExecutive Director Gene Hamilton slams the Biden Administration for chilling dissent, silencing speech, and weaponizing the federal government against the American people."], "MeidasTouch": ["Gov. Josh Shapiro forcefully denounces the anti-Semitic protests in Philadelphia that targeted a Jewish-owned restaurant: \"People have a right to peacefully protest a difference of policy in theMiddleEastor inIsrael. They do not have a right to comeandprotest a restaurant", "Hamas terrorists are evil.AndHamas threatens the lives of both IsraelisandPalestinians.\n\nEquating Hamas terrorists with Palestinians who are sufferingandare in harm’s way is evil, too,andonly plays into the terrorists’ hands.", "BREAKING: 13 Israeli hostagesand12 Thai hostages held by Hamas have been released.", "Kushner Calls For Removal Of Palestinians inGazato Build Beachfront Properties", "BREAKING —\n\nPresident Biden discusses the release of hostages held byHamasand says the goal is to extend theceasefirebeyond four days.", "BREAKING: President Biden and the Israeli government confirm that babies were decapitated byHamas", "Hamasterrorists are evil. \n\nAndHamasthreatens the lives of both Israelis and Palestinians.\n\nEquatingHamasterrorists with Palestinians who are suffering and are in harm’s way is evil, too, and only plays into the terrorists’ hands.", "BREAKING: 13 Israeli hostages and 12 Thai hostages held byHamashave been released."], "StJude": ["We couldn’t do it without youandyour community", "Years of community support, solidified forever at@stjude.\n\nAs always, thank you for everything you all have done to support a cause so close to my heart.\n\nFor being a positive force in gaming.\n\nAnd for being part of something bigger than yourselves.", "Every year@DrLuporaises funds to advance cures for St. Jude kids! \n\nCome join us live, right now on YouTube!http://bit.ly/buildagainstcancer2023…", "Cheers to Finding cures. Saving children. Everywhere. Together.", "year 6 of the@DrLupoBuild Against Cancer stream. over $15.1 million raised by his community for the kids. infinite gratitude for this annual event", "We couldn’t do it without you and your community", "Years of community support, solidified forever at@stjude.\n\nAs always, thank you for everything you all have done to support a cause so close to my heart.\n\nFor being a positive force in gaming.\n\nAnd for being part of something bigger than yourselves.", "year 6 of the@DrLupoBuild Against Cancer stream. over $15.1 million raised by his community for the kids. infinite gratitude for this annual event", "We may not agree on everything, but when it comes to childhood cancer, we can all agree on what matters most:\n\nFinding cures. Saving children.", "Cheers to Finding cures. Saving children. Everywhere. Together."], "BadFaithPod": [], "whitecoatwaste": ["New@DailyCallerop-ed by@SenJoniErnst& WCW Prez/Founder@anthonybellotti\"First, we defunded China’s Wuhan Institute of Virology & got the lab’s mad scientists blacklisted from receiving another cent of taxpayers’ money...Then, we clipped the wings of EcoHealth Alliance, the", "BREAKING VICTORY!Following WCW investigations, the House just voted unanimously to DEFUND@DeptofDefenseexperiments on dogs & cats!#NDAAThank you@RepMoskowitz@RepNancyMace@RepDonDavisfor A+ leadership to stop the Pentagon’s pet abuse!https://blog.whitecoatwaste.org/2024/06/14/instant-impact-congress-defunds-dod-dog-cat-tests-cites-wcw-exposes/…", "BREAKING:The Washington Post just admitted that it repeatedly published disinformation fed to it by NIH to discredit WCW & defend Fauci from our true claims that he funded beagle abuse in TunisiaUnpacking the story of Fauciandpainfulexperiments involving dogs\nDocuments", "Fauci Exposed AGAIN! We’ve obtained new emails proving Dr. Fauci lied to Congress about NIH’s beagle experiments. He testified under oath: \"I do not do government business on my private email.\"  \n\nFauci committed PERJURY. Get the facts:", "GAIN OF FAUCI! We 1st exposed how Fauci funded the Wuhan Lab. Watch how NIH’s tax $ for ANIMAL experiments almost certainly caused COVID.", "WCW is the MOST EFFECTIVE group for getting animals out of labs. \n\nWATCH: here’s how we SHUT DOWN more government animal labs than all other groups…combined.", "WATCH: WCW exposes Fauci’s Monkey Island. 3,500 monkeys are held captive here & shipped to max-pain govt labs. Your TAX bill? $13.5M!", "EXPOSED BY WCW: Infamous#gainoffunctionexperimenters at an NIH bioagent lab that works with EcoHealth Alliance are infecting animals with Ebola, COVID & other deadly viruses in maximum pain experiments"], "InequalityMedia": ["A Colorado judge has temporarily halted the $24.6 billion merger between KrogerandAlbertsons.\n\nThis merger would be a disaster for consumers, workers,andthe economy as a whole. It should be scrapped for good.", "This is a major victory for working people! \n\nNon-compete agreements prevent workers from seeing better wages or working conditionsandenlarge corporate monopolies by stifling competition.", "BREAKING: The Biden administration's ban on noncompete clauses has been upheld in court.\n\nA Pennsylvania judge denied an injunction seeking to block the rule.\n\nAs of now, virtually all noncompete agreements with bosses will be banned and voided beginning September 4.", "NEW: Billionaire elites, vast inequality,andpolitical corruption have ushered in a Second Gilded Age.\n\nThe question now is the same as it was at the start of the 20th century: will we fight for an America that works for all rather than a wealthy few?", "We are living in a Second Gilded Age. Here's how we get out of it.", "This is a major victory for working people! \n\nNon-compete agreements prevent workers from seeing better wages or working conditions and enlarge corporate monopolies by stifling competition.", "BREAKING: The Biden administration's ban on noncompete clauses has been upheld in court.\n\nA Pennsylvania judge denied an injunction seeking to block the rule.\n\nAs of now, virtually all noncompete agreements with bosses will be banned and voided beginning September 4.", "You've probably heard a lot of lies about immigrants this week. \n\nHere's the truth: immigrants are good for the economy and our society.", "NEW: Billionaire elites, vast inequality, and political corruption have ushered in a Second Gilded Age.\n\nThe question now is the same as it was at the start of the 20th century: will we fight for an America that works for all rather than a wealthy few?", "Billionaire sports team owners want to funnel our tax dollars into their bank accounts. \n\nAnd if we don’t play ball, they threaten to take our favorite teams away. \n\nDon't fall for the sports stadium scam.", "The Chiefs just threatened to leave Kansas City unless theirfanspay for their stadium.\n\nHere's the full story.1/8"], "GOP": ["Sen.@TedCruz: “We need to cut off the funding that has enabled this attack to happened… Joe Bidenandthe Biden administration have flowed nearly $100 billion to Iran. Understand, Hamas is a proxy for Iran. Without Iran, there would be no Hamas.”", "Sen.@KatieBrittforAL: \"[Hamas] is absolutely, complete evil.\" \n\n\"We must stand withIsrael.\"", "Sen.@KatieBrittforALdescribes the importance of standing with our allyIsraelandwhy the Hamas terrorists must be eradicated.", "Sen.@KatieBrittforAL: Hamas is “absolute, pure evil.”\n\n“When you see evil rear its head – which is exactly what we saw happen on October 7th – we must look it in the eyesandwe must take it down.”", "On this Holocaust Remembrance Day, we mourn the 6 million Jews who were murdered, and commemorate the liberation of Auschwitz-Birkenau.", "After days of pro-Hamasmobs terrorizing college campuses, Joe Biden praised their agitators, is considering giving \"permanent safe haven\" to refugees from Gaza, and announced he was forcing the middle class to pay off more student loan debt.  \n\nThis is Biden’s campus chaos.", "Yesterday, the Biden administration unilaterally approved another sanctions waiver that unlocks a fresh $10 billion in frozen funds for the Iranian regime.\n\nWe may never know how much makes it's way into the pockets of terrorists.", "TOWNHALL: \n\nWeapons Left In Afghanistan, Thanks to Biden's Botched Withdrawal, Are Being Used To Attack Israel", "Before Biden took office, peace agreements were being signed in the Middle East. In just three years, Biden surrendered Afghanistan to the Taliban, terrorists have attacked Israel, and Iranian proxies have targeted American troops in over 165 attacks just since October.", "Experts warnHamas’ terrorism may target American institutions.", "Nearly half of Democrats oppose Israel’s effort to destroy the brutal terrorist groupHamas. The Republican Party stands with Israel.\n\n'Majority of Americans Back Israel as Democrats Split Over War WithHamas, WSJ Poll Finds'", "Sen.@TomCottonARcalls on Biden to “change course on his disastrous Iran policy.”\n\n“Iran is the world's worst state sponsor of terrorism.Hamascould not exist on the scale and the brutality it does without the support from Iran.”", "\"Babies, their heads cut off.\" \n\nIsrael is facing down pure evil.", "13 American heroes dead. Hundreds of Americans stranded. Tens of thousands of allies abandoned. \n\nJoe Biden calls this an \"extraordinary success.\"", "\"We defeated ISIS, we killed the world’s top terrorists, we secured our borders, we achieved Energy Independence, we stood up to China, we protected Israel, we made PEACE in the Middle East with the Abraham Accords and more\"\n\n-President Trump"], "Josh_Moon": ["....she said outside of that president's trial for paying a porn star to keep secret their 1-night stand that came weeks after the birth of his son. Thankfully this guardian of morals was there to save us from the 8 scandal-free years of a loving father/husband that was Obama", "Alina Habba, speaking on Fox News outside Trump's criminal hush money/election interference trial, claims America was on an \"upward trajectory of morals\" under President Trump. Even a Fox News host calls her out for the absurdity of this comment.", "What an absolute embarrassment to the stateandcountry. Never in my life would I have imagined seeing an American politician openlyandshamelessly supporting a communist dictator.", "Tuberville says Putin has only wanted peace all along but the U.S. wants war: “He dudn’t want Ukraine. He dudn’t want Europe. Hell, he’s got enough land of his own. He just wants to make sure he does not have US weapons in Ukraine.”", "What kills me about the people who piled on the Smiths Station mayor is that they've almost all sat by quietly as pastor after pastor got busted for various sex crimes, theftandcrimes against children. But let a pastor dress up as a womanandthey're \"outraged\"", "So… we’re going to keep taxing people for eating so we can pay for rich families to send their kids to unregulated private schools. What a disgrace.", "New GOP message: we'd win more if we stopped the voting on stuff", "this Newsmax copium is actually hitting pretty good", "....she said outside of that president's trial for paying a porn star to keep secret their 1-night stand that came weeks after the birth of his son. Thankfully this guardian of morals was there to save us from the 8 scandal-free years of a loving father/husband that was Obama", "Alina Habba, speaking on Fox News outside Trump's criminal hush money/election interference trial, claims America was on an \"upward trajectory of morals\" under President Trump. Even a Fox News host calls her out for the absurdity of this comment.", "What an absolute embarrassment to the state and country. Never in my life would I have imagined seeing an American politician openly and shamelessly supporting a communist dictator.", "Tuberville says Putin has only wanted peace all along but the U.S. wants war: “He dudn’t want Ukraine. He dudn’t want Europe. Hell, he’s got enough land of his own. He just wants to make sure he does not have US weapons in Ukraine.”", "So… we’re going to keep taxing people for eating so we can pay for rich families to send their kids to unregulated private schools. What a disgrace."], "HoustonChron": ["Supreme Court guts federal agency power after Texas billionaire showers justice with gifts", "A look at when Memorial Drive flooded at Buffalo Bayou in Houston after Hurricane Beryl brought heavy rainandwind to the region Monday.", "Buffalo Bayou was one of the many locations around Houston suffering from floodingandhigh water after Hurricane Beryl swept through south Texas on Monday. ⁠", "HISD parents organized protests at Meyerland PerformingandVisual ArtsMiddleSchool, Browning Elementary SchoolandCrockett Elementary Schools.https://trib.al/dcn7zKo", "In one of the most high-profile City Council races on the ballot, incumbent Mary Nan Huffman has defeated Houston trial lawyer Tony Buzbee in the race for District G.https://trib.al/ZRCCen7", "Sheila Jackson Lee is facing fresh criticism that she is a tough and demanding boss whose behavior sometimes strays into abuse.", "Molly Cook ekes out close win over Jarvis Johnson, as the two face off in the race to secure Whitmire's old Texas Senate seat.https://trib.al/Qz29Cie", "Harris County Judge Lina Hidalgo told Houstonians Monday they'd be hard pressed to find an administration that has done more for the Hispanic community than President Joe Biden’s and Vice President Kamala Harris.'", "Lt. Gov. Dan Patrick threatens to remove President Biden from the Texas ballot"], "HannahDCox": ["Lefties are mad at Starbucks because they think it's fundingIsrael.\n\nMeanwhile, it's really their taxes fundingIsraelandthey're like \"yes government queen, more taxes please!\"", "The boycott is happening because people believe that Starbucks is funding Israel. What's incredible about this is that Starbucks is not funding Israel. x.com/missfalsteenia…", "I think that's based.\n\nThe Iraq war was an abomination that killed tons of innocent people, hurt our economy,andthat was fought on false grounds. Few people opposed it at the time, those who stood strong against it were proven right in the end.\n\nI just don't think draft dodging", "You know what really bothers me about Tim Walz?\n\nWhen the US Marine Corps asked me to go to Iraq to serve my country, I did it. \n\nWhen Tim Walz was asked by his country to go to Iraq, he dropped out of the Army and allowed his unit to go without him. I think that's shameful.", "Screw this.@RepThomasMassiesaid nothing wrong.\n\nAnti-zionism is NOTandhas NEVER been anti-semetic. There are tons of anti-zionist Jews for crying out loud.\n\nThis is an intentionally disingenuous comparison that the military industrial complexandits puppets need to justify", "Rep. Massie, you’re a sitting Member of Congress.\n\nThis is antisemitic, disgusting, dangerous, and exactly the type of thing I was talking about in my Senate address.\n\nTake this down. x.com/RepThomasMassi…", "I’ll never understand how AOC became so prominent on the left, she’s not particularly smart - even for a congresswoman.\n\nA ceasefire,anda peace deal,andan end to the open air prison conditions inGazaare all great in theory - most people want that. The reality is none of", "Wow. \n\nReally excellent job by@abbydphillipputting AOC on the spot to ezplain her nonsensical and poorly thought out calls for a ceasefire.", "The imbeciles mad at this are why we will end up moving further and further to the left.", "", "It’s honestly unfathomable to me how squatter’s “rights” were ever put in place in this country.\n\nAnyone who voted for them ought to be in jail, they’re thieves.", "We are never going to talk about policy again in 2024, are we?", "I’m just pissed because all I want is some freaking economic relief but we’re not going to get it because Republicans are actually insane.", "Before you reproduce, you should ask yourself: am I going to need the government's help in doing the basic job of raising this kid?\n\nAnd then if the answer is yes, don't have kids.", "Daniel Perry intentionally sought out a fight at a protest in 2020 & murdered a man in cold blood simply because he had a gun on him.@GregAbbott_TXpardoning him is a direct attack on the 2A and legal gun owners everywhere.@brad_polumbo& I discuss this week on the", "Both Julian Assange and@Snowdenrisked their lives to tell Americans about the crimes their government was committing against them/with their money.\n\nObama and Biden persecuted both heavily - because the crimes they exposed occurred during their administration.\n\nNow tell me why", "According to@RandPaulgov officials from 15 federal agencies knew in 2018 that the Wuhan Institute of Virology was trying to create a coronavirus like COVID-19.\n\nThey funded it. They covered it up. They used it to strip you of your rights.\n\nJAIL.", "Real men NEVER touch their babies!!\n\nI really can’t believe there’s still people alive with this mentality. Like who gave great grandpa Twitter?https://x.com/LaCombatCrazy//LaCombatCrazy/status/1744521049159450996…", "exactly. they really think they don't owe her anything and it's wild."], "KyleKulinski": ["Every single congressperson cheering Netanyahu is morally depraved. They're overlooking or outright supporting one of the great atrocities of our time. The history books will judge all of these cretins as akin to nazis. The Lancet has the Palestinian death rate at 186,000 so the", "As soon asIsraelannounced a total siege ofGazashutting off power, food, fuel & water to 2.3m people they obviously gave up any pretense of caring about civilian casualties. But Biden still pretends they’re being super careful & moral. Pathetic lie", "Hamas ACCEPTED the dealIsraelproposed, even afterIsraelwatered it down multiple times! Netanyahu blocked it because he cares more about genocideandmaintaining his power than the hostages. Pompeo knows the truthandhe will never tell you it. He's a corrupt genocidal neocon", "After Hamas savagely murdered hostages—including an American—Biden & Harris are demanding Israel cave to Hamas’s demands.\n\nThis is a dangerous reward for terrorism.\n\nAnd what a message to our enemies.", "They drop thousands of bombs, destroy half ofGazaandkill 10,000 but then turn aroundandclaim Palestinians are faking it??? Israeli propagandists aren't even trying they just throw a bunch of contradictory shit against the wallandhope it sticks", "The Israeli PM's spokesperson to the Arab world falsely claims this video shows Palestinian civilians \"fake injuries\", using the term \"Pallywood\".\n\nIt's behind-the-scenes footage of a Lebanese short film about Palestinians called \"The Reality\", as stated by the film's director.", "They're gonna glaze Israel so hard at this debate bro", "Seems like a big deal that a plurality of Americans think our top ally is committinggenocidewith US arms. Quick call more college kids anti-semites!", "\"Do you believe Israel is committing genocide against the Palestinian people in Gaza?\"\n\nYes: 39%\nNo: 38%\n\nUnsure: 23%\n\nData For Progress / Apr 29, 2024 / n=1265", "The Iraq war was very bipartisan and supported by the media. Wall Street bailouts, same thing. Now we witnessed it with smearing these protesters too and look at what it lead to. People who fetishize bipartisanship are insane. Whenever these loathsome ghouls cry out in unison", "They really thought they could just propagandize into compliance. It turns out watching children get carpet bombed with US made weapons is a true moral red line to young people - go figure!", "Nikki Haley calling for bombing Iran as well. Everybody on this stage is insane.#GOPDebate", "When the US invaded Iraq dissenters were accused of being Saddam Hussein apologists. It reminds me of how everybody critical of Israel today is accused of beingHamasapologists. It's such a dishonest, weaselly argument but it's all over the place.", "Tim Scott casually calls for bombing Iran and starting another war. What a psychopath.#GOPDebate", "The outrage over the pro-Palestine protests are the dumbest thing I’ve ever seen. Just wall to wall dishonesty from charlatans trying to take away free speech and protect Israel from legitimate criticism.", "Killing civilians is evil. This is a comment that would’ve been viewed as banal and obvious not too long ago but now it makes you an edgy outsider to say it and believe it.", "All of the fucking morons who jack themselves off about 'steel manning and not straw manning' others immediately straw man young people concerned about babies being carpet bombed and millions being starved. Absolutely pathetic losers."], "EricTrump": ["There is still time to order your Christmas wine!Head over to@trumpwineryto complete your orderanduse promo code ETRUMP20 for 20% off", "Black Friday Promo Code: 20% off orders from@TrumpWineryusing code ETRUMP20", "Great job@LaraLeaTrump&@ChairmanWhatley!April@GOPfundraising numbers!!\n\n         Trump -> $76M\n         Biden -> $53M", "Excited to announce the launch of@WorldLibertyFi! A new era in finance is here.#Crypto#DeFi", "I am truly honored to just received the  unanimous vote, of The Republican Party of Florida, to be Chairman of the 2024 Delegation at the Republican National Convention in Milwaukee! Let’s Make America Great Again!#Trump24#MAGA", "Indicted again! They will stop at nothing!@realDonaldTrump", "Bond filed. We look forward to vindicating our rights on appeal.", "Rose’ 5K run/walk at@TrumpWinerybenefiting@StJudethis Saturday, April 27th! Sign up online!#Charlottesville#Virginia", "Everyone is in shock: The judge will NOT allow Blanche to ask “if it was appropriate for Mr. Trump to rely on you (Michael Cohen) as his lawyer and legal counsel!” \n\nThis entire trial is a sham."], "LaraLeaTrump": ["Your support right now will get President Trump back in the White House.\n\nDONATE!", "STOP SCROLLING IF YOU SUPPORT PRESIDENT TRUMPCan we count on you to chip in any amount before his deadline?\n\nEven $1 makes a huge difference.\n\nTogether we will defeat Joe BidenandMake America Great Again.", ".@Univision's@RodzViancaand@PragerU's@AldoButtazzonijoin me to discuss the Harris/Walz ticket, Kamala copying Donald Trump's ideas, Kamala ducking debates,andMUCH MORE!#TheRightView", "April fundraising numbers: \nTrump -> $76M\nBiden -> $53M\n\n…all while@realDonaldTrumpwas forced to sit in a courtroom for a sham, Soviet-style trial. \n\nDespite their desperate attempts to stop him, the momentum & grassroots support is GROWING & will continue all the way to Nov 5", "I am proud to announce that last weekend the@GOPhad the largest digital fundraising weekend since 2020. Much more to come…we are just getting started!@realDonaldTrump@ChairmanWhatley@LaCivitaC", "I don’t know who needs to hear this, but", "All you need to know about Project 2025 - SHARE & SPREAD THE WORD!!!", "HAPPY THANKSGIVING EVERYONE! HE WILL BE BACK SOON!", "WATCH:@DineshDSouzajoins me to discuss his new movie, \"Police State,\" the current outlook for America, being a new grandfather, AND MUCH MORE!#TheRightView"], "seanhannity": ["Hamas Official Ghazi Hamad: We Will Repeat the October 7 Attack TimeandAgain UntilIsraelIs Annihilated", "Israelforensic team says victims were abused, tortured, burned alive", "Israeli officials: Hamas reported cease-fire deal is a ‘deception’", "This is the worst terrorist attack inIsrael's history", "'No question' thatIsraelhas to go intoGazafor deterrence: Elbridge Colby", "'DECEPTION':IDFSays Ceasefire Deal Not Approved byIsrael, is Softened Deal; Report", "'We're not going to take it anymore': Pro-Israelprotesters gather outside Columbia", "NETANYAHU: “Israelrefuses a temporary cease-fire that does not include the return of our hostages.\"", "HamasOfficial Ghazi Hamad: We Will Repeat the October 7 Attack Time and Again Until Israel Is Annihilated", "Fox News:HamasPlanned for the Aftermath of Israel’s Invasion of Gaza as They Planned for the October 7th Terror Attacks", "HamasLeader IsmailHaniyehKilled After Residence Hit in Tehran", "Israeli officials:Hamasreported cease-fire deal is a ‘deception’"], "RacePowerPolicy": [], "ProjectLincoln": ["Damn right. Law & order vs. unlawful & disorder.", "Watters: They like the fact that this a young Black woman against an old white guy.. the like the fact that she was a prosecutor and he’s a felon", "He sent bloodthirsty mob after these people on January 6th.", "Trump gets an ovation from Republican senators", "\"'Donald Trump has no right to use our most hallowed ground for his political aims,' Fred Wellman, a 22-year Army combat veteran, said Wednesday. 'For a lot of us,andI'm not the only one, people are aptly furious.'\"", "\"Fox News Correspondent Fact-Checks Claims About $6 Billion Released By US to Iran\"\n\n\"‘Not a single cent from these funds has been spent...These funds have...nothing to do with the horrific attacks today...this is not the time to spread disinformation.’\"", "\"Gaetz believes their freedomand'money settlements' will be assured only by reelecting back into office MAGA's leader: former President Donald Trump.\"https://bit.ly/3K6jsHT", "“These are horrible people. They’re just awful. Their nihilism and their bloodlust is horrible at this point.”@TaraSetmayerspeaks on Kristi Noem bragging about killing her dog and what it represents for MAGA on@MSNBC.", "He sent bloodthirsty mob after these people on January 6th.", "Trump gets an ovation from Republican senators", "It looks like it may be more than just rhetoric -- Trump might be committed to emulating him in conduct too.https://mediaite.com/trump/ivana-trump-revealed-in-1990-vanity-fair-interview-that-her-ex-kept-hitler-speeches-in-a-cabinet-by-his-bed/…", "This type of rhetoric is dangerous and vile. He is blatantly copying language used by Hitler to construct a similar fascist regime. x.com/Acyn/status/17…", "\"In her dissent...Justice Sonia Sotomayor painted a grim portrait... 'Orders the Navy’s Seal Team 6 to assassinate a political rival?' she wrote. 'Immune.'\n\nAs extraordinary as that prospect might sound, constitutional law experts say she’s right.\"", "This#MemorialDay, we pay tribute to the brave American heroes of all walks of life who selflessly gave their lives to defend and protect our cherished democracy. We honor their sacrifice and admire their unwavering fight for liberty, justice, and freedom for all.", "This type of rhetoric is dangerous and vile. He is blatantly copying language used by Hitler to construct a similar fascist regime.", "Trump: They’re poisoning the blood of country.. They poison mental institutions and prisons all over the world not just in South America… but all over the world they’re coming into our country from Africa, from Asia"], "UALawSchool": [], "PeoplesParty_US": ["Standing with Palestine#FreePalestine", "Standing with Palestine#FreePalestine"], "nytimes": ["Breaking News: The UN Security Council passed a resolution for a cease-fire inGaza, breaking an impasse after the U.S. vetoed several calls to end the war.https://nyti.ms/4cyPuJt", "A majority of the 240 Palestinian prisonersanddetaineesIsraelreleased during a weeklong truce with Hamas had not been convicted of a crime, a New York Times data analysis showed,andmost were teenagers.", "Watch as womenandchildren who had been held hostage by Hamas reunite with loved ones at a hospital inIsrael. Their return comes after nearly seven weeks of uncertaintyandfear over their fates inGaza.https://nyti.ms/3MVw1Yb", "Israelfaced a charge of genocide at the International Court of Justice on Thursday, as South Africa argued thatIsrael“means to create conditions of death” inGaza,anddemanded the court order an emergency suspension of the military campaign.", "Thousands of children in the Gaza Strip are at risk of dying from malnutrition after two months of war that has decimated the territory’s economy and destroyed its infrastructure, a humanitarian aid group warned on Saturday.", "Six days afterHamasaccused Israel of bombing a hospital in Gaza City, the group has yet to produce any evidence to support its claims.https://nyti.ms/3rVuN8n", "An analysis of satellite imagery shows the tremendous structural damage that northern Gaza has sustained since Oct. 17, adding to already significant damage from the preceding 11 days. \n\nWe’re mapping the conflict.https://bit.ly/3rU6Z4q", "Tens of thousands of demonstrators crowded the streets of U.S. cities on Saturday to denounce the scope and scale of Israel’s military campaign in Gaza in response to last month’s terrorist assault byHamas.https://nyti.ms/470s3Wf", "In@nytopinion\"After eight months of unremitting horror in the Middle East, Biden should recognize that his Gaza policy is a moral, practical and political failure that has not helped anyone butNetanyahu,\" our columnist@NickKristofwrites."], "funder": ["Who else agrees-we need to get funding for Ukraine immediately.\n\nRIP Navalny.", "Screaming \"fight! fight! fight\" like a bunch of rabid cult members is not toning rhetoric down. Just FYI.", "Project 2025 is more horrifying than I ever thought", "Today’s hearing with Lev Parnas was another reminder that James Comer must resign or be expelled.", "Greedy corporations have been making record profits, price gougingandoverpaying their executives. President Biden is fighting backandwinning. Target, Walmart, McDonalds, Wendy'sandothers are all lowering prices thanks to his pressure. Go Biden go!#BidenFightsPriceGouging", "First, you’re using dead soldiersandtheir families for a PR stunt.\n\nWhich is terrible. It’s low, even for you.\n\nSecond, be specific as to what you think VP Harris should do. Crickets.\n\nThird, Biden was forced to clean up Trump’s mess in Afghanistan.", "This is derangedanddisgusting. If Biden did this it would be the front page of every newspaper for weeks. Trump should get the same treatment.", "So Long, Moscow Mitch\n\nYou won’t be missed.\n\nA must read:", "Today’s hearing with Lev Parnas was another reminder that James Comer must resign or be expelled.", "Republicans doing nothing to stop shootings is a national security threat. Instead of taking a 2 week vacation they need to get their asses back to work. It’s the guns. Deal with it. Do your damn jobs for once.", "These MAGA pathological liars ran around spewing Russian propaganda, resulting in threats against meandcountless other Americans. They’re accomplices—not victims. They may not have known drugs were in the box, but they delivered the package.\n\nStory here:", "“I’ve never seen a moment quite like this. I’ve never seen this level of actionandenthusiasm among workers, especially among young workers,” said Lane Windham. \n\n“People drew a line in terms of their expectations. For 40 years, workers have been putting up with low wagesand", "“When 26 billionaires have as much wealth as half of humanity, that’s a crisis…It’s time, and it’s up to organized labor to lead that movement.”\n\nUAW President Shawn Fain is a hero.#SolidaritySeason", "Are you serious@CNN? This headline is absolutely hideous. This is pure, steaming hot garbage. Delete it.", "Screaming \"fight! fight! fight\" like a bunch of rabid cult members is not toning rhetoric down. Just FYI.", "Don’t let anyone lie about January 6th. It was an armed terrorist attack. Pipe bombs, guns, Molotov cocktails, stun guns, machetes, a crossbow, hockey sticks, baseball bats, flagpoles, pepper spray, bear spray, brass knuckles, scissors, needles, screwdrivers, and an axe. Over"], "WashingtonPost": ["AsIsrael’s war inGazacontinues, violence by Israeli settlers in theWestBankhas increased. But even before the war, settler attacks were on the rise.\n\nFollow our live coverage:http://wapo.st/3SO5dND", "Hundreds of pro-Palestinian activists, including American Jews, gathered by the Capitol to demand a cease-fire inGaza. “We are here as Jews — many descendants of survivors of genocide — to stop a genocide from unfolding in real time,” one protester said.", "The historic Church of St. Porphyrius,Gaza’s oldest active church, was struck Thursday as it sheltered hundreds of Palestinians displaced by the war, according to religious officials.", "Exclusive: Videosandphotos show settlers with guns trying to break down the gate of a home in Qusra, a Palestinian community in the Israeli-occupiedWestBank.\n\nSeventeen-year-old Obada Sae’ed Abu Srour was killed, alongside two others,andat least 12 were injured — the", "Israeli Prime Minister BenjaminNetanyahusaid “we are at war, and we will win it” Saturday afterHamaslaunched an assault and took captives following the 50th anniversary of the start of the 1973 Yom Kippur war.\n\nFor more live updates follow here.https://wapo.st/3ttsHg1", "Of the more than 1,400 people killed byHamas, there are some 200 badly damaged bodies that reman unnamed. Israel has turned to archeologists for help.", "Breaking news: Israel issued a formal declaration of war againstHamason Sunday, promising retaliation for an unprecedented attack by the militant group, as the combined death toll for both sides passed 900.", "A Human Rights Watch investigation published Thursday said an Israeli attack on a Gaza building in October had no apparent militant target, but killed 106 civilians, including 54 children, making it an “apparent war crime.”https://wapo.st/4aBZn89"], "GOPoversight": ["“In too many corners of the globe, individualsandentire communities face the stark reality of violence, displacement,anddiscrimination solely because of their faith.\n\n“Look at what is happening in Nigeria today.\n\n“Last year, 90% of Christians killed globally because of their", "GW has asked for our help. Part of the encampment is outside of their jurisdiction. Mayor Bowser must step upandenforce DC’s trespassing laws.", "Since they set up their unlawful camp at GWU, the pro-Hamas mob has called for genocideandthe murder of GWU faculty.\n \nThe GWU President is urging Mayor BowserandMPD to clear out this unlawful, antisemitic encampment.\n\nWhy are D.C. officials refusing to act?", "At a press conference outside of the pro-Hamas camp city on GW’s campus, Chairman Comer calls on DC Mayor Bowser to step inanduphold the rule of law before next week’s oversight hearing.\n\nOur committee has already rescinded DC’s radical, soft-on-crime bill.", "Tom Homan has worked in immigration enforcement under six different presidents and says President Biden is the first president to unsecure the border on purpose.", "TOM HOMAN:The Biden Admin has created the greatest national security crisis since 9/11 through their open border policies.", "MUST WATCHMACE:“So, Director Cheatle, I have a series of questions. I want very specific answers… Both sides of the aisle today have asked for your resignation. Would you like to use my five minutes to draft your resignation letter? Yes or no?”CHEATLE:“No. Thank you.”", "Since they set up their unlawful camp at GWU, the pro-Hamas mob has called forgenocideand the murder of GWU faculty.\n \nThe GWU President is urging Mayor Bowser and MPD to clear out this unlawful, antisemitic encampment.\n\nWhy are D.C. officials refusing to act?"], "yhn": ["University of Alabama System closing DEI offices, redirecting resources to serve all students#alpolitics", "Senator Ted Cruz will host a bipartisan roundtable with some of the biggest names in college sports in attendance, including Nick Saban.", ".@GovernorKayIveyjoins forces with Texas in border security showdown: ‘You can count on Alabama’#alpolitcs", ".@KatieBrittforAL: \"For a secure border, a strong homeland,anda safe world – President Trump is the choice in 2024.\"#alpolitics", "University of Alabama System closing DEI offices, redirecting resources to serve all students#alpolitics", ".@GovernorKayIveyjoins forces with Texas in border security showdown: ‘You can count on Alabama’#alpolitcs", ".@KatieBrittforAL: \"For a secure border, a strong homeland, and a safe world – President Trump is the choice in 2024.\"#alpolitics"], "rbreich": ["I’m Jewish. I detest Hamas. I know what it’s like to have family members murdered because of their beliefsandethnicity.\n\nWhich is why I take social justiceandhuman rights so seriously.Andwhy I, like millions of others, am committed to a ceasefire inGaza.", "It’s time for all of us who care about human rights to demand a ceasefire inGaza. Now.", "It’s time for all of us who care about human rights to demand a ceasefire inGaza. Now.", "It’s time for all of us who care about human rights to demand a ceasefire inGaza. Now."]}