{"PatTheSocialist": ["Listen to half the damn panel try to silence Nina. Genocide isn't playing well for Biden and these fkn clowns know it, but are paid to shill forIsrael. CNN is such a trash", "Watch David Axelrod look stunned as CNN panel shouts and attacks@ninaturnerduring a heated discussion over Israeli's genocide in Gaza and the Uncommitted vote in#MichiganPrimary", "Biden’s unconscionable support for genocide has ensured Dems lose the White House.", "Even if Kamala Harris calledIsraelgenocidal maniacs, it wouldn't mean shit without stopping funding\n\nDon't believe a word she says, ever", "If only the people who see that Biden is clearly gaslighting us aboutIsraelwould actually do some basic research on Covid. They'd understand that we've all been lied to and Covid is very present and dangerous for everyone, especially kids.", "People are dying and becoming disabled from an airborne virus during this ongoing airborne pandemic and our government has dismantled public health to the point that now more airborne pathogens are causing more harm. \n\nWhite House: “No comment.”", "\"What can Kamala do though?\" the shitlibs say, as she has the exact same platform regardingIsraelas Biden", "Biden’s unconscionable support forgenocidehas ensured Dems lose the White House.", "$20 billion could end homelessness in the US, but I guess we have to spend $14 billion more ongenocide", "BREAKING: The House of Representatives just voted to give Israel $14.3 billion in more weapons to deepen US complicity in Israel's genocidal attacks against Palestinians in Gaza. A shameful day in Congress.", "Anyone thinking this guy's gonna win are delusional. He's losing every swing state. The public knows it'sgenocideand that we could stop it. He's a dead man walking.", "Joe Biden gaslights when asked people are accusing him of genocide: \"That's not widely shared... That's not what all those people said..They're saying Joe, do something; do something, but the idea they all think it's genocide that is a different situation\"x.com/halalflow/stat…", "\"KaMaLA's bEtTer oN pALeStiNe\" said the paid influencer accounts", "To recap today, the Biden-Harris administration:\n\n- released $3.5Bn in military funding to Israel\n- lifted a ban on offensive weapons sales to KSA\n- ended an investigation into an IDF unit accused of human rights violations (including the killing of an 80 year old"], "SabbySabs2": ["Israeli host threatened genocide ofGaza, Lebanon and Iran. The US government is backing this every time they send weapons toIsrael.@POTUSis the face of genocide.", "Israeli host threatens the Arabic world with  genocide, live on TV", "ICJ RULESISRAEL'S TREATMENT OF PALESTINIANS SHOWS DISCRIMINATION & THE OCCUPATION IS ILLEGAL.@joebiden@realDonaldTrump@RepJeffries@tedcruzsold their souls to AIPAC for a political career. Contact your representatives and tell them they support an illegal occupation!", "JUST IN: ICJ Rules by a vote of 14-1 that Israel's occupation of Palestinian territory is 'illegal'and must evacuate settlers/immediately halt all new settlement activities", "He's right. A ceasefire also doesn't stop land expansion in theWestBank. Doesn't stop the torture of Palestinian prisoners. Doesn't stop apartheid either. This is why politicians are trying to limit the discussion to October 7th.", "Calling for a ceasefire or arms embargo at this point is farcical.\n\nThen what? We go back to \"normal\" i.e. occupation until the next slaughter?\n\nThe only fair and legal remedy under intl law is decolonization. Anything else denies Palestinians, Syrians and Lebanese their land,", "Israeljust killed an American activist in theWestBank, and Trump is worried aboutIsraelbeing doomed. I don't care ifIsraelis doomed. They spent decades dooming Palestinians.", "TRUMP: “If I don't win this election... Israel is doomed. That's a tough statement. Israel will be gone...”", "Biden has announced thatIsraelis LOSING Support due to indiscriminate bombing. Even CNN is admittingGazais a disaster. I have no doubt that had it not been public pressure, these statement would not exist.", "Israeli minister is calling for the replacement of Palestinians inGazawith Israelis. This is so blatant and yet our government pretendsIsraelis doing everything to protect civilians.", "Khamenei, has issued an order for Iran to strikeIsraeldirectly, in retaliation for the killing in Tehran of Hamas's leader. SHIT JUST HIT THE FAN!", "I highly encourage everyone coveringIsrael's attack onGazato connect the Congo.Israeloppressed and exploited the Congolese as well. This is helpful when debating Zionists.", "Even Reuters is reporting that Hamas has accepted the ceasefire deal. And yet Blinken, Biden and the state department cronies continue to tell you that Hamas has not accepted the deal. Make it make sense!", "Since taking office, Kamala and Biden funded a genocide that killed over 30,000 Palestinians (probably closer to 100K once all bodies are counted). Fixed it for you!", "Since taking office,@JoeBidenand I:\n\nCut the cost of prescription drugs for seniors\nExpanded access to Medicare and Medicaid\nMade historic investments in youth mental health\nTook on the maternal health crisis\nStrengthened the Affordable Care Act\n\nAnd we’re not stopping there.", "The assault onGazais just the beginning. IfIsraelis not held accountable, which country will be next? Lebanon? Syria?", "NOW: DC comes out as 144 countries come out for Global March for Rafah#FreePalestine", "HAARETZ  finally admitting IDF was ordered to use Hannibal Directive on October 7th!", "BREAKING NEWS: ICJ SAYS ISRAEL MUST HALT MILITARY OPERATION IN RAFAH!", "ISRAEL ORDERS ALL PALESTINIANS TO LEAVE GAZA. They have nowhere to go. Along with the approval of the annexation of the West Bank, this is full-scale ethnic cleansing. And our government is funding it.", "Israel vows to continue war after hostages are released. As I said before they want to ethnically cleanse the land."], "TristanSnell": ["Donald Trump held a SUMMIT with Israeli Prime Minister Netanyahu.\n\nAs a private citizen. At Mar-a-Lago. \n\nThe Logan Act is a federal law forbidding private citizens from negotiating with foreign governments.\n\nTRUMP IS BREAKING THE LAW — YET AGAIN", "Donald Trump should be INDICTED — AGAIN.\n\nPBS now reports Trump told Israeli Prime Minster Netanyahu to NOT agree to a cease fire because it would help Kamala Harris.\n\nThis is a violation of the Logan Act and should be investigated and prosecuted to the fullest extent of the law.", "Trump usually spends the summer in Bedminster, New Jersey.\n\nYet he met with Netanyahu at Mar-a-Lago.\n\nWHY?\n\nBecause he KNEW it was a violation of the Logan Act — and wanted to avoid being prosecuted by the Feds in New Jersey — whereas in Florida he could draw Aileen Cannon again.", "I’ve seen enough. I just ENDED my New York Times subscription. I’m DONE with their both-sides-ism and appeasement of fascism and America’s enemies. \n\nWhat about you?", "Donald Trump should be INDICTED — AGAIN.\n\nPBS now reports Trump told Israeli Prime MinsterNetanyahuto NOT agree to a cease fire because it would help Kamala Harris.\n\nThis is a violation of the Logan Act and should be investigated and prosecuted to the fullest extent of the law.", "Donald Trump's crime spree continues:\n\n- Logan Act - pressuringNetanyahuto kill cease fire\n- RFK Jr. - promising job in exchange for endorsement\n- Logan Act - discussions with Putin on invading Ukraine\n- Holding campaign event at Arlington National Cemetery", "BIG NEWS -- Big cities' murder rates are down 19% compared with last year -- this comes directly from police data from 236 major cities.", "The United States is taking military action against militias allied with Iran.\n\nDonald Trump took the U.S. battle plan vs. Iran, a highly classified document, and waved it around at lunch at his golf club with randos without security clearances, after he'd left office, ILLEGALLY."], "BernardKerik": ["Homes and businesses in France being are marked for Jewish occupants.\n\nWe are witnessing a modern day holocaust, and unfortunately, the enemies ofIsraeland Jews around the world, have saturated western communities, while our FBI and DOJ were targeting PTAs and churches.", "#Hamasis the new#ISISand should be treated as such.", "Iran, and the Iraqi militia Al-Hashd al-Shabbi proclaims they are with the Hamas terrorists!\n\nOur CIA/DOJ/FBI better be working overtime here at home because the chameleon radical Muslims already in the United States, are planning their next moves.", "I love how state leaders in the Arab region are calling for restraint, and refuse to denounce the initial attacks onIsrael.\n\nHaving lived and worked in theMiddleEastfor more than 10 years, I can promise you, if the tables were reversed, and it was them, there would be hell to", "Iran, and the Iraqi militia Al-Hashd al-Shabbi proclaims they are with theHamasterrorists!\n\nOur CIA/DOJ/FBI better be working overtime here at home because the chameleon radical Muslims already in the United States, are planning their next moves.", "#Hamasis the new#ISISand should be treated as such.", "I love how state leaders in the Arab region are calling for restraint, and refuse to denounce the initial attacks on Israel.\n\nHaving lived and worked in the Middle East for more than 10 years, I can promise you, if the tables were reversed, and it was them, there would be hell to", "'We see a pregnant lady on the floor, and we turn her around...and the stomach is wide open, there's an unborn baby connected to the cord, stabbed with a knife, and the mother shot in the head' -Yossi Landau Commander, Zaka South\n\nThis is the justification for a complete and"], "spann": ["Another look at the Gadsden Steam Plant demolition this morning… video from Michael McNutt", "No milk and bread sandwiches for these UNA college boys! \nLogan Pollard, Joseph Estes, Devandrius McCollum. Video from Janet Pollard", "Before Wrigley, before Fenway, there was Rickwood…", "Video of the tanker truck explosion on I-22 near Carbon Hill in Walker County. Video from Aaron Alexander. The interstate is shut down in both directions; reports indicate one fatality.", "Hillsboro this afternoon (Lawrence County)…video from Joshua Cofield", "Another look at the Gadsden Steam Plant demolition this morning… video from Michael McNutt", "No milk and bread sandwiches for these UNA college boys! \nLogan Pollard, Joseph Estes, Devandrius McCollum. Video from Janet Pollard", "Today’s flyover at Jordan-Hare Stadium… video from Jenn Whitman"], "jeff_poor": ["Checking the Georgia elder abuse statute, just in case any laws are being broken...", "Who do y'all think David Muir is voting for?", "So, I guess the question is who is really running the country?", "Checking the Georgia elder abuse statute, just in case any laws are being broken...", "So, I guess the question is who is really running the country?", "Who do y'all think David Muir is voting for?"], "DavidAFrench": ["This, from@BenSasse, is powerful and true. If you're going to make an institutional statement, this is how it is done:", "He's pro-choice.\n\nEvery single pro-life evangelical voting for him is voting for a man who is pro-choice *and* found liable for sex abuse by a jury of his peers. \n\nI never, ever thought I'd see this day. To restore the pro-life movement in the GOP, he has to lose.", "\"I think the six week is too short, there has to be more time,\" former President Trump says how he'll vote on an abortion rights amendment in Florida.", "This is incredible. A beautiful way to love your neighbor.", "A church in Tennessee recently paid off the medical debts of thousands of local people, adding up to $8 million.\n\nPartnering with@UndueMedDebt, The Altar Fellowship in Johnson City paid $50,000 to buy off debts owed by 3,921 households in 7 area counties.https://julieroys.com/tn-church-pays-off-medical-debt-for-thousands-to-bless-community/…", "Good. Institutional neutrality is far better than overt ideological posturing that can chill the expression of dissenting students and faculty.", "BREAKING: The University of Pennsylvania has announced it will stop issuing official statements on social and political events.\n\n“It is not the role of the institution to render opinions—doing so risks suppressing the creativity and academic freedom of our faculty and students.", "I think about these charts quite a bit. If you want to know why people often freak out when you talk about crossing party lines, they're operating under false impressions about the other side. People consistently think their opponents are more extreme than they really are /1", "This, from@BenSasse, is powerful and true. If you're going to make an institutional statement, this is how it is done:", "\"Ukraine is the enemy of this country.\" \n\n\"One of the greatest enemies of our nation right now is Ukraine.\"\n\n\"We should apologize to Russia\"\n\nJust wild, deranged material.", "Wow suddenly Tim Pool having takes like this makes way more sense.x.com/AricToler/stat…", "This is incredible. A beautiful way to love your neighbor.", "A church in Tennessee recently paid off the medical debts of thousands of local people, adding up to $8 million.\n\nPartnering with@UndueMedDebt, The Altar Fellowship in Johnson City paid $50,000 to buy off debts owed by 3,921 households in 7 area counties.https://julieroys.com/tn-church-pays-off-medical-debt-for-thousands-to-bless-community/…"], "NancyAFrench": ["The Clarks posted a photo of@KanakukCEO Joe White with their daughter.  White is the main person at the helm as hundreds of children were assaulted at the camp. /9", "Campers could not communicate with parents what was happening at the camp - except through hand-writtten letters.  Little did parents know Kanakuk the counselors were instructed to monitor to prevent criticism (even suicide threats) from reaching home. /6", "Slight, positive update: On the way to the grocery store just now, I saw a#Westhavenhomeowner taking DOWN their Gabrielle Hanson and Jeff Feldman signs.", "In the book, Gilpin mentions some of her friends died via suicide because of the abuse there.  Gilpin was at Carlbrook the same time as my neighbor’s son, Joe Benton Burns (who attended 2001-04 approximately). /3", "Slight, positive update: On the way to the grocery store just now, I saw a#Westhavenhomeowner taking DOWN their Gabrielle Hanson and Jeff Feldman signs.", "The Clarks posted a photo of@KanakukCEO Joe White with their daughter.  White is the main person at the helm as hundreds of children were assaulted at the camp. /9", "Campers could not communicate with parents what was happening at the camp - except through hand-writtten letters.  Little did parents know Kanakuk the counselors were instructed to monitor to prevent criticism (even suicide threats) from reaching home. /6", "After a pastor posted a photo with the@KanakukCEO and a camp director, victims and their family members urged people to hold the camp accountable. \n\nRead some of their anguished posts below. /2"], "BillOReilly": ["Harris asked how she would get aGazadeal.  Dodges.  Says the war must end.  Had no plan.#PresidentialDebate#NoSpin", "Evil on display inGaza.  Please read the Message of the Day onhttp://BillOReilly.com.", "After all the blood and treasure the United States extended for Iraq, it is clear that the country is not our friend.", "Here's an undeniable statement: the evil done by far-right people is eagerly exposed by the corrupt corporate media, while heinous actions on the left are often ignored or even justified.\n\nHatred of Jews is that rare mental disorder that cuts across extremist boundaries.", "Harris asked how she would get a Gaza deal.  Dodges.  Says the war must end.  Had no plan.#PresidentialDebate#NoSpin", "Evil on display in Gaza.  Please read the Message of the Day onhttp://BillOReilly.com.", "The corporate media has enabled far-left fanatics for years. Now, the enabling is on full antisemitic display across the country.\n\nThe#progressivemovement believes Israel is a fascist country that practicesgenocideor some such stupidity.\n\nAppalling doesn't even come close.", "Here's an undeniable statement: the evil done by far-right people is eagerly exposed by the corrupt corporate media, while heinous actions on the left are often ignored or even justified.\n\nHatred of Jews is that rare mental disorder that cuts across extremist boundaries."], "Jaybefaunt": ["Supporting genocide & illegal occupation is not progressive no matter how you spin it. Attempting to 'Both sides' an extermination shows how you're either\n1. Ignorant of the history & nuance of what's going on\nor\n2. Purposefully trying to ride the fence to avoid angering Zionists", "\"The governments may be withIsraelbut the streets are with Palestine\"-@tex", "Just a small sampling of ppl flooding Washington DC in largest#FreePalestinemarch in U.S. history", "To all the people going to free Palestinemarches and rallies this weekend... Please stay safe, ignore the Zionists and make as much noise as you can. Network! Get to know others and build connections to help your community. Talk about the link between Zionism and capitalism.", "Everyone is talking about a ceasefire which is a step in the right direction... But what we NEED to talk about is a cease-OCCUPATION. Also...Israelnow owes reparations to Palestinians for their crimes against them. Palestine has the right to defend itself and RESIST occupation!", "ATTENTION: The narrative that we have seen fromis that crimes were committed byand it all started on October 7th. Here's proof that it started LONG before that day, narrated by BenjaminNetanyahuand Michael Rapaport. Share this with everyone willing to listen to see the", "This should be abundantly clear:HAMASWOULDN'T EXIST IF IT WEREN'T FOR THE ILLEGAL OCCUPATION OF PALESTINE\n\nIf you want to get rid ofHamas, end the ILLEGAL occupation.", "Everyone is talking about aceasefirewhich is a step in the right direction... But what we NEED to talk about is a cease-OCCUPATION. Also... Israel now owes reparations to Palestinians for their crimes against them. Palestine has the right to defend itself and RESIST occupation!", "If Israel didn't commitgenocidethen let the process in the ICJ prove it... Why y'all so defensive?"], "donwinslow": ["Shame on anyone who called this awful person a hero.\n\nWhy has no reporter ever asked her:\n\n1. Where are these babies being killed?\n2. What hospital is this happening at?\n3. What doctors/nurses committed these murders?\n\nDisgusting. Foul. Not a hero.", "Adam Kinzinger did not sacrifice ANYTHING.\n\nHe was REDISTRICTED and QUIT.\n\nGoogle: Adam Kinzinger Redistricted.\n\nMillions of Democrats fell for a completely BS narrative just as they did with Steve Schmidt.\n\nThis is ALL FOR PROFIT.", "Imagine calling someone who spread this evil lie for YEARS a hero.\n\nThis is not a hero.\n\nNot of one thing.\n\nNot of anything.", "I'm retiring.\n\nI wrote the first words of this book 30 years ago.\n\nAnd now#CityInRuinsis on sale in 24 hours.\n\nI hope you will consider ordering my final novel.\n\nClick here to order:http://bit.ly/42T9MZ8", "Shame on anyone who called this awful person a hero.\n\nWhy has no reporter ever asked her:\n\n1. Where are these babies being killed?\n2. What hospital is this happening at?\n3. What doctors/nurses committed these murders?\n\nDisgusting. Foul. Not a hero.", "Listen to this and tell me how this horrific person is a hero. Just listen to her own words and try to defend this. I want to hear the same Democrats who called her a HERO defend this vile garbage.\n\nI'll wait.\n\nAnd don't give me this BS about well I agreed with her on 1 issue.", "Adam Kinzinger did not sacrifice ANYTHING.\n\nHe was REDISTRICTED and QUIT.\n\nGoogle: Adam Kinzinger Redistricted.\n\nMillions of Democrats fell for a completely BS narrative just as they did with Steve Schmidt.\n\nThis is ALL FOR PROFIT.", "Imagine calling someone who spread this evil lie for YEARS a hero.\n\nThis is not a hero.\n\nNot of one thing.\n\nNot of anything."], "KyleClark": ["Oltmann, who calls for the executions of his political opponents, hinted at coming violence in November. “November is going to be the start of something very very very very very very kinetic. Now do I want that to happen? No. But I don’t want my children to be groomed either.”", "GOP State Rep Scott Bottoms, who said Jewish hostages held by Hamas needed to find Jesus, now says there's no such thing as the Palestinian people, they're all just terrorists.#coleg#copolitics", "COMMENTARY: Denver Mayor Mike Johnston's administration forcing vulnerable people out of long-term motels to make room for migrants is not compassionate and it's not competent.#copolitics", "COMMENTARY: 40 years after Neo-Nazis murdered legendary radio host Alan Berg, the hate they harbored persists", "Oltmann, who calls for the executions of his political opponents, hinted at coming violence in November. “November is going to be the start of something very very very very very very kinetic. Now do I want that to happen? No. But I don’t want my children to be groomed either.”", "GOP State Rep Scott Bottoms, who said Jewish hostages held byHamasneeded to find Jesus, now says there's no such thing as the Palestinian people, they're all just terrorists.#coleg#copolitics", "NEW: The Salvation Army is finally taking questions after seven deaths at its homeless hotel shelter near Quebec and I-70 in Denver. The Salvation Army says it didn't spend $800,000 tax dollars allocated for security because it was \"researching\" options.", "COMMENTARY: 40 years after Neo-Nazis murdered legendary radio host Alan Berg, the hate they harbored persists"], "BobMurphyEcon": ["I bet after today's ruling Obama is relieved that he won't do any time for blowing up a US citizen with a killer robot without a trial", "I am making a simple observation here. I'm not \"picking sides\" except for the side of \"Killing innocent people is always wrong.\"\n\nThe people responsible for the attack onIsrael*want* the response to be \"over the top.\" They want the propaganda to then turn public opinion and", "\"The part that is backed up by Israeli newspaper accounts is what Dave actually said, the other career-destroying smears I pulled out of my ass.\"\n--The impressive and much smarter than@ComicDaveSmithHarsanyi", "tfw when I say it's wrong to drop bombs on kids and a lady with \"ProLife\" in her bio literally lol's me and asks if it was wrong to firebomb dresden", "I bet after today's ruling Obama is relieved that he won't do any time for blowing up a US citizen with a killer robot without a trial", "I am making a simple observation here. I'm not \"picking sides\" except for the side of \"Killing innocent people is always wrong.\"\n\nThe people responsible for the attack on Israel *want* the response to be \"over the top.\" They want the propaganda to then turn public opinion and", "\"The part that is backed up by Israeli newspaper accounts is what Dave actually said, the other career-destroying smears I pulled out of my ass.\"\n--The impressive and much smarter than@ComicDaveSmithHarsanyi", "I get it; it's funny. But not only did God not kill kids Cain hid behind, and not only did God not even kill Cain, but He actually placed a mark on him so that nobody ELSE would kill him.\n\nI.e. God agreed to aceasefireafter this crime.", "Cain Calls For Ceasefire After Killing Abelhttps://buff.ly/3SH1nFN"], "ThomasEWoods": ["Good time to remind heterodox Christians that their views on almost everything related toIsraelwould have been unknown to St. Thomas, Luther, Calvin, Wesley, and everything Christendom thought for 1800+ years", "I realize it's anti-Semitic to refer toIsraelas a foreign country", "I wonder how many people in Israeli intelligence will be fired", "I'm sure the media will say: \"All the ridiculous, over-the-top and absurd hatred and Hitler comparisons and associated stupidity led to this act of violence\"", "I wonder how many people in Israeli intelligence will be fired", "We tell ourselves lots of fantasy stories about mass immigration. But if you don't understand that this kind of thing is done to a small town out of pure malevolence then no conversation is possible", "Charleroi, Pennsylvania is a town of just over 4,000 people.\n\n2,000 Haitian immigrants just arrived on their doorstep.\n\nLocal parents tell us their schools are overwhelmed. \"Kids can't advance because the teachers are having to compensate for the kids who can't speak English.\"", "Some excerpts from Javier Milei's speech at the World Economic Forum's Davos meeting.\n\n(Milei delivered his remarks in Spanish, of course, so an interpreter did simultaneous translation. That means the text I'm quoting from is choppy and imperfect, but it's good enough to give", "The \"40 beheaded babies\" story appears to have fallen apart. With plenty of atrocities to go around, there was never any need to invent such a story. But if you questioned it, you were an anti-Semite -- even though you've disbelieved propaganda stories in many other contexts"], "bshelburne": ["He went to prison for drug possession. Congratulations on being such an outstanding human.", "Packed courtroom trying to determine where Brandon Dotson's heart went after he died in prison and his body was returned to his family missing his heart. No one seems to know, not ADOC or ADFS that did the autopsy. Next step: judge will review autopsy report in private next week.", "There's now a second case of man dying in Alabama prison & body returned to family missing organs. Charles Singleton, 74, died in 2021. His family says his body after autopsy at UAB was missing organs, including brain. Reported by@cynthia3340.https://bit.ly/48wJX40", "Can someone tell Alabama's AG that weed is now legal in half the country? This horse has left the barn. Also, alcohol is more destructive. Why not stump about that?", "The cruelty of this cannot be overstated. This would have helped old people who've served decades in violent, overcrowded prisons, only opening a possibility for their LWOP sentence to be reconsidered by a judge and still more nays than yeas. We are so lost & broken.", "Alabama's Republican-led House just sank the second chance bill, meaning 150 senior citizens who never physically harmed anyone will die in prison. Thank you@RepEngland70for trying so hard to extend redemption to the most deserving. I wish everyone had your moral compass.", "I don’t think anyone including Jesus himself can appeal to higher angels in Alabama’s death cult. It’s a black hole. They are hellbent on killing and believe their violence is righteous when really it’s about political victory. Rotten to their cores.", "A Vatican-affiliated Catholic charity made an urgent appeal Tuesday to the U.S. state of Alabama to halt a planned execution this week using nitrogen gas, saying the method is “barbarous” and “uncivilized” and would bring “indelible shame” to the state.https://al.com/news/2024/01/vatican-affiliated-catholic-charity-makes-urgent-appeal-to-stop-barbarous-alabama-execution.html?utm_campaign=aldotcom_sf&utm_medium=social&utm_source=twitter…", "“I’m leaving with love, peace and light,” were his last words. And then Kenneth Smith writhed & thrashed as the state suffocated him. Shame on us.", "Instead of creating pathways out of prison,@GovernorKayIveyis quite literally intending to fund the school to prison pipeline. Alabama will go down in history as mass incarceration's ground zero. The worst of the worst.https://bit.ly/49CPA0w", "The most expensive prison ever built in the history of humankind, and taxpayers who foot the bill don't get to know all the reasons the cost has doubled?", "Original cost of Alabama's mega-prison? $623 million. Estimated cost now? $1.25 billion. They're blaming inflation, design changes from court orders and \"other factors affecting construction projects.\" And what factors are those? Does anyone really know?https://bit.ly/46NobJ4"], "PatrickSvitek": ["3rd Court of Appeals rejects Paxton’s latest attempt to shut down whistleblower lawsuit in Travis County#txlege", ".@DadePhelangoes direct-to-camera about@KenPaxtonTXin a new reelection campaign ad, running on TV and digital.  \n\n\"If Paxton will break an oath to his wife and God, why would he tell Trump — or you — the truth?\"#HD21#txlege", "Paxton whistleblower attorney Tom Nesbitt says lawsuit isn’t over:", "Just in: House approves Raney amendment stripping ESA provision out of#HB1. The vote was 84-63.#txlege", ".@TedCruzendorses four challengers for the Cypress-Fairbanks school board. Conservatives are trying to gain a majority there in the Nov. 7 election.", "Biden to campaign staff: \"I’m hoping you’ll give every bit of your heart and soul that you gave to me to Kamala\"", "Biden calls into campaign staff meeting that Harris is attending in Wilmington \n\n“I’m so proud of what you’ve all done.”\n“I’m not going anywhere.”\n“Embrace [Harris]. She’s the best.”", "Pool: \"We will never give up on Texas,\"@SecondGentlemansaid at Houston fundraiser with@VPthis evening", "Trump campaign chief Chris LaCivita suggests Nebraska could still change to winner-take-all before November:\n\n\"Watch what's going on in Omaha,\" he says at CNN-Politico Grill at RNC. \"That ain't over yet.\"\n\nHe notes state lawmakers have a special session coming up", "Vance to Megyn Kelly on \"childless cat ladies\": \"Obviously it was a sarcastic comment. I’ve got nothing against cats. ... People are focusing so much on the sarcasm and not on the substance … and the substance of what I said, Megyn — I’m sorry, it is true.\"", "Nebraska’s GOP governor says he’s a “strong supporter” of a proposal to return the state to a winner-take-all system for electoral votes. The state’s legislative session ends April 18.", "Statement today on LB 764 -- Winner-Take-All", "Dan Crenshaw, asked at Tribfest about Cheneys backing Harris, says it's \"very personal\" for politicians like Liz Cheney and Adam Kinzinger given how much Trump has personally attacked them. \"They're putting those feelings above, I think, basic conservative policy.\""], "evanasmith": ["every year at this time i’m like, yeah we actually did that#txlege", "I was rattled this week when I read the local news crisis is accelerating. How much worse can it get? Well, by next year — a year earlier than predicted — we'll hit a gruesome benchmark: 1/3 of U.S. newspapers shut down since 2005https://axios.com/2023/11/16/newspapers-decline-hedge-funds-research…#txlege", "NEW from@eklib@TexasTribune: Two women have filed federal complaints against Texas hospitals they say refused to treat their ectopic pregnancies, leading both to lose their fallopian tubes and endanger their future fertilityhttps://texastribune.org/2024/08/12/texas-abortion-law-ectopic-pregnancies/?utm_campaign=trib-social&utm_content=1723475693&utm_medium=social&utm_source=facebook,twitter…#txlege", "This is why we need a robust independent press that holds power to account. Big thanks to ⁦@TexasTribune⁩ ⁦@propublica⁩ and all the other news orgs who wouldn’t give up#txlege", "I was rattled this week when I read the local news crisis is accelerating. How much worse can it get? Well, by next year — a year earlier than predicted — we'll hit a gruesome benchmark: 1/3 of U.S. newspapers shut down since 2005https://axios.com/2023/11/16/newspapers-decline-hedge-funds-research…#txlege", "every year at this time i’m like, yeah we actually did that#txlege", "This is why we need a robust independent press that holds power to account. Big thanks to ⁦@TexasTribune⁩ ⁦@propublica⁩ and all the other news orgs who wouldn’t give up#txlege", "NEW from@eklib@TexasTribune: Two women have filed federal complaints against Texas hospitals they say refused to treat their ectopic pregnancies, leading both to lose their fallopian tubes and endanger their future fertilityhttps://texastribune.org/2024/08/12/texas-abortion-law-ectopic-pregnancies/?utm_campaign=trib-social&utm_content=1723475693&utm_medium=social&utm_source=facebook,twitter…#txlege"], "MsLaToshaBrown": ["Red, Black & GreenWe ‘bout it!#blackliberation#machetesinparis#joyAngelaLaTosha", "Great news! This is why we must always fight back.", "BREAKING: A state court in Pennsylvania ruled that excluding mail ballots from eligible voters based on a missing or incorrect handwritten date on the return envelope violates the state constitution. Thousands of voters were excluded in prior elections on the basis of this", "Supreme Court’s Blow to Right to Protest Is Another Attack on Black Political Power", "People have allowed politics to supersede and erode their own sense of decency and connection to humanity. \n\nUnfortunately, it happens across all parties and makes me sad. \n\nOur politics should always be in service to the love for all humanity. Even when we don’t LIKE each other.", "Join us! I’m joining in my personal capacity. Register here:", "That was fun. \n\nLet me now get back to my serious work. It’s really sad that we are in this position.", "Rep. Sheila Jackson Lee Remembered: Opposed Iraq War, Advocated for Juneteenth, Reparations & Morehttps://democracynow.org/2024/7/22/latosha_brown_sheila_jackson_lee…via@democracynow", "This war is criminal. We are watching intentionalgenocide. This total disregard for innocent victims is inhumane and barbaric. ANYONE who kills innocent children and victims of war is wrong!!!", "CNN's Wolf Blitzer: You knew that there were innocent civilians in that refugee camp, right?\n\nIDF spox: This is the tragedy of war. We told them to move south. \n\nBlitzer: So you decided to drop the bomb anyway.\n\nIDF spox: We’re doing everything we can to minimize civilian deaths."], "TomFitton": ["Black for Palestine: Meet Rashida Tlaib's favoriteIsrael-hating group with terror tieshttps://washingtonexaminer.com/news/house/palestine-rashida-tlaib-israel-terror-ties-hamas…", "\"On Tuesday night, protesters vandalized the homes of Brooklyn Museum Jewish board members and the co-op building of museum director Anne Pasternak. The vandals marked the doors of their homes with upside down red triangles, a symbol used by the al-Qassam brigades, the military", "\"Hamas started the war with a massacre, took these hostages and hid them in a crowded civilian area. Then, whenIsraelcame to free them, Hamas responded with heavy fire, including RPGs—yet people are condemningIsrael. It makes us wonder if theWesthas lost the moral", "UPDATE: Death Toll from Hamas Terrorist Attack Rises to Over 700 – At Least 260 Young People Were Slaughtered at Dance Party in Deserthttps://thegatewaypundit.com/2023/10/update-death-toll-hamas-terrorist-attack-rises-700/…#gatewaypunditvia@gatewaypundit", "Less than a month after Biden admin trades with terrorists for American hostages in Iran by releasing billions, Iran front-groupHamaslaunches terrorist war on Israel.", "Terrorists Separate Mother from Daughter in Hostage Release; Emily Hand, 9, is Freehttps://breitbart.com/middle-east/2023/11/25/hamas-separates-mother-from-daughter-in-hostage-release-emily-hand-9-is-free/…via@BreitbartNews", "UPDATE: Death Toll fromHamasTerrorist Attack Rises to Over 700 – At Least 260 Young People Were Slaughtered at Dance Party in Deserthttps://thegatewaypundit.com/2023/10/update-death-toll-hamas-terrorist-attack-rises-700/…#gatewaypunditvia@gatewaypundit", "\"Hamasstarted the war with amassacre, took these hostages and hid them in a crowded civilian area. Then, when Israel came to free them,Hamasresponded with heavy fire, including RPGs—yet people are condemning Israel. It makes us wonder if the West has lost the moral"], "BarbMcQuade": ["Wishing peace to all of our Jewish friends and neighbors. Chag sameach.#Passover2024", "Great day for a Peacenic!  Food, music, games, face-painting, petting zoo, and prizes until 7 pm today at Heilmann Community Center and Park. Thank you, ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩, ⁦@FBIDetroit⁩, ⁦@USCG⁩, ⁦⁦@HSIDetroit⁩", "So sorry to see the senseless loss of life inIsrael. My heart goes out to all who have lost loved ones.", "Had a great time at ⁦@TheCityClub⁩ in Cleveland today to commemorate Law Day. Its motto is the Citadel of Free Speech. Meetings start and end with the clanging of the gong. I was relieved that I did not hear it mid-speech! Great group of engaged and informed citizens!", "Thanks to all the service members who serve our country. Let’s honor those who have died for democracy by working in unity to sustain it.#MemorialDay", "My keyboard needs a gaslighting emoji for the next couple of months. I would use it here because Mar-a-Lago hosting a gala to recognize the not the defenders but the PERPETRATORS of the Jan 6 attack is the ultimate gaslighting move. There is nothing worthy of celebrating about", "Wishing peace to all of our Jewish friends and neighbors. Chag sameach.#Passover2024", "My heart goes out to Mohamed Said and his family. Said was a 23-year-old Melvindale, Mich. police officer who was killed in the line of duty. I appreciate his service and the risk all officers undertake to protect the rest of us.https://freep.com/story/news/local/michigan/wayne/2024/07/25/melvindale-residents-grieve-slain-police-officer-mohammed-said/74524880007/…via@freep"], "JohnArchibald": ["I wish I knew which you you are, Katie Britt.", "Some things to think about, as my state spends billions of dollars to lock people up.", "Alabama is well on its way to being a full-blown theocracy. The \"frozen embryos are children\" ruling is just another step on the path.", "This is an amazing honor and I'm still pinching myself. Looking so forward to being a part of this board.", ".@JohnArchibaldof@aldotcom,@GinaSKChuaof@semaforand@NTretheweyof@NorthwesternUhave been elected to the#PulitzerPrize Board! Click below to read more.https://pulitzer.org/news/archibald-chua-trethewey-join-pulitzer-board…", "I wish I knew which you you are, Katie Britt.", "Some things to think about, as my state spends billions of dollars to lock people up.", "Alabama is well on its way to being a full-blown theocracy. The \"frozen embryos are children\" ruling is just another step on the path.", "This is an amazing honor and I'm still pinching myself. Looking so forward to being a part of this board.", ".@JohnArchibaldof@aldotcom,@GinaSKChuaof@semaforand@NTretheweyof@NorthwesternUhave been elected to the#PulitzerPrize Board! Click below to read more.https://pulitzer.org/news/archibald-chua-trethewey-join-pulitzer-board…"], "brad_polumbo": ["“You’re not the next MLK Jr. or Rosa Parks. You’re an unemployed they/them who didn’t know the difference betweenGazaand theWestBankuntil a few months ago.”\n\nMy message to the lunatics on#freepalestineTikTok who keep blocking traffic.", "Anti-Semites are so strange.\n\nLike, the Jews aren't the reason this wasn't you.\n\nYou are the reason this wasn't you.", "51% of 18 to 24-year-olds say Hamas's slaughter of Israeli citizens was justified. \n\nYet 62% also say it was a genocide.\n\nSo, a sizeable number of young Americans think genocide against Israelis is justified.\n\nWhat the actual fuck?", "I find the pro-Hamas protests happening in US cities unimaginably vile. \n\nBut to those calling on them to be shut down… nope. That’s not how free speech works.", "“You’re not the next MLK Jr. or Rosa Parks. You’re an unemployed they/them who didn’t know the difference between Gaza and the West Bank until a few months ago.”\n\nMy message to the lunatics on#freepalestineTikTok who keep blocking traffic.", "51% of 18 to 24-year-olds sayHamas's slaughter of Israeli citizens was justified. \n\nYet 62% also say it was agenocide.\n\nSo, a sizeable number of young Americans thinkgenocideagainst Israelis is justified.\n\nWhat the actual fuck?", "You're literally more pressed about language than the dead American woman.", "I find the pro-Hamasprotests happening in US cities unimaginably vile. \n\nBut to those calling on them to be shut down… nope. That’s not how free speech works."], "natsechobbyist": ["No matter how much you hate us, you will never take our joy. You won’t change our happiness. You cannot extinguish our resolve to fight for what is right.", "I completely agree. The only thing worse is CNN’s version.", "Everything is a business transaction with this guy which is amazing considering he would have been homeless on the street many times if his KKK member father hadn’t bailed him out several times. What a loser. A weird loser.", "So when are they going to release the details of the prisoner swap with Russia? How many people do we get versus them? Are we also paying them cash? Are they giving us cash (Please withdraw that question, because I’m sure the answer is NO)? Are we releasing murderers, killers, or", "Okay, I am in the minority here! Thank you all for sharing your thoughts & perspectives. I thought we already knew how evil the Alitos are but I can see how further proof is good to have. Most importantly, I hope this will push us to demand Dems pursue accountability from SCOTUS.", "Y’all are going to be very upset when this secret recording nonsense happens to our side…and it will.", "SHUT UP. Read the fucking room. No one needs or wants your bullshit takes. These are not ordinary times. Do better or quit.", "I have lived the fear of political violence. I know it. Trump caused it and although I don’t wish him ill he needs to understand that before he can have normal, he must acknowledge HE IS THE PROBLEM.", "I always think they aren’t so stupid they don’t understand what will happen to them but then they say things like this…", "Because he’s either lying—again—or he’s not. I agree that he survived an assassination attempt and he could focus on that but he always has to lie and, well, that’s kind of the point, isn’t it?", "@TheRyanHamiltonwas so brave to share this story even as he & his wife are still grieving & processing the trauma they had to endure at the hands of Texas' repressive & dangerous laws. He has endured hate on this site & been called a liar over & over. Share their story.", "Must be nice to know you won’t pay a price for taking a stand because you’re too much of a coward to use your voice to speak out.https://x.com/zachlanebryan//zachlanebryan/status/1806627478963634380…", "Maybe enforce the gag order with some real consequences.", "I didn’t let myself accept this for a long time but it’s indisputable now and absolutely terrifying that he was once our president and could be again.", "People literally die from this every day.", "Maybe, but who cares? It was understandably a difficult and emotional decision. He will speak at the convention.", "Maybe the most banal explanation for tweeting a departure from the presidential race without a swift public-facing follow-up is that Biden is too pissed at everyone to be normal. \"Fine, I'll endorse her, but only via tweet. You want a noble Oval Office address, Jack? Bleep off.\"", "You well know the polling and focus groups show otherwise. This is the worst bluff ever.", "Journalists and paid commentators on your network are shilling this narrative.", "Is he a toddler or a teenager? Because they’re the only people who say things like this.", "No. Changed the channel and didn’t turn it back on. This man is truly evil  and no one wants to see him.", "Same, Katie, and we endured literally years of heartbreak. When I hear these attacks, women like us are who I think of immediately. My heart goes out to them. We see you"], "jimmy_dore": ["Of COURSE! They hypocrisy of the Pro Ukraine Nazi's and the ProIsraelcrowd is astounding.", "One of the most popular pro-Ukraine accounts with  800k followers", "This is called Propaganda. \n\nIts is pushed by corporate tools through Billionaire owned media to manufacture consent for war & the diversion of public funds from serving the public good to enriching the Military Industrial Complex & Big Oil companies.\n\nThe Russiagate conspiracy", "Vladimir Putin, who caused Navalny's death, helped Donald Trump become president\n\nTrump is trying to help\nPutin conquer Ukraine, over the opposition of the free world\n\nHe has enlisted leading Republicans in his effort\n\nAmerican voters will decide in November which side they're on x.com/yarotrof/statu…", "Why stop protesting a war ? That’s the opposite of what he should be saying. \n\nbesides, it’s not a war, one side has state of the art missiles, Apache, helicopters,  F-16s, 2000lb bombs, and unlimited military might supplied by the worlds largest military. \n\nThe other side has", "Of course they were aware there was a threat , EVERYBODY was aware of the guy on the roof , regular citizens were screaming to the cops & secret service that there was a guy with a rifle and yet they did NOTHING! \n\n3 Snipers inside the building the shooter used admit they saw the", "JUST IN: Secret Service was aware of the potential threat 10 minutes before Donald Trump took the stage in Pennsylvania but let him go out anyway.\n\nThe revelation was made during a Senate briefing today.\n\nSen. Marsha Blackburn says she was \"appalled to learn the Secret Service", "What would be weird is if  you weren’t being paid to supportgenocide& slaughter of your enemies children. You doing that for free are you? Bravo.", "Is Hamas paying you now?", "The fact that you think investigating & exposing the biggest crime against humanity in history is a “kick” reveals a deeply unserious nature & willful ignorance so strong it’s hard to comprehend.", "The people in this thread are  filled with propaganda & irrational hate and are the exact thing they claim to hate - ignorant, subservient  to authority & hate filled. Yeeesh.", "I’m sorry this idea of working together with people to end a war, even if you disagree with them on other issues, is too hard of a concept for you to grasp. \n\n“I’ll work with anyone to do good and nobody to do bad”- Frederick Douglass", "This is how Pro-War propaganda works: Both of these are meant to scare you & keep you supporting more war.\n\nDoesn’t matter if Russia is winning or losing the war, stay afraid & keep funneling money to the international war machine.#WarIsBusiness#WarIsProfitable", "Life comes at you fast", "I’m covering an election where the leader of one of our two major parties is funding agenocideof Palestinians while at the same time using the justice system to imprison his biggest opponent in the upcoming election just like a dictator in a 3rd world Banana Republic.", "we're covering an election in which the leader of one of our two major parties is a deranged criminal acting like a mob boss to muscle his way out of deep legal jeopardy x.com/atrupar/status…"], "RonFilipkowski": ["The Republican Party wants to give Benjamin Netanyahu a blank check to do whatever he wants inGazawith no oversight or questions asked. The fact that most Democrats disagree with that does not make them anti-Semitic. A large percentage of Jewish Democrats disagree with that.", "On US peace negotiations betweenIsraelandGaza: “The reporting is that former President Trump is on the phone with the PM ofIsraelurging him not to cut a deal right now because it’s believed that would help the Harris campaign.”", "InIsraelwith a bipartisan delegation of US Senators, Lindsey Graham goes off on a Newsmax reporter asking him to condemn Rashida Tlaib: “You’re not going to screw this up! Get this guy out of here!”", "How odd for Trump to Blame America First for an act of terrorism inIsrael, without a word of accountability instead for his good friend Benjamin Netanyahu, who actually runs that country.", "How odd for Trump to Blame America First for an act of terrorism in Israel, without a word of accountability instead for his good friend BenjaminNetanyahu, who actually runs that country.", "Trump, 4 days after theHamasattack on Israel, decided to ripNetanyahuover the Soleimani strike: “I’ll never forget that BibiNetanyahulet us down. That was a very terrible thing .. We were disappointed by that - very disappointed. Then Bibi tried to take credit for it.”", "On US peace negotiations between Israel and Gaza: “The reporting is that former President Trump is on the phone with the PM of Israel urging him not to cut a deal right now because it’s believed that would help the Harris campaign.”", "Trump toNetanyahutoday: “No president has done what I’ve done for Israel.”"], "davidhogg111": ["Gov./CSM (Ret.) Walz is stating facts. If you take issue with this then maybe you should ask yourself why a fmr President who did nothing for 4 hours while the Capitol building was under siege by his own supporters should be reelected?", "Go tohttp://theshotline.orgto call your representative using a voice of a victim of gun violence to demand action on gun violence. All you need to do is put in your zip code and hit call. Already today over 5,000 calls have been made.", "Introducing The Shotline— where@ChangeTheRef&@marchforourlivesbrought back voices of victims killed by guns using AI to call reps and demand change. Now, these voices can call reps repeatedly to demand change in our gun laws.http://theshotline.org", "One thing people don’t talk about much when it comes to gun violence is how many shootings there are every day that happen but don’t make the news because no one is hit. There was a drive by shooting 200 ft from my place in DC last night but it won’t make the news because no one", "Gov./CSM (Ret.) Walz is stating facts. If you take issue with this then maybe you should ask yourself why a fmr President who did nothing for 4 hours while the Capitol building was under siege by his own supporters should be reelected?", "The media would never say this about a shooter who wasn’t a white man. This was a fucking murder and wanna be assassin. Please don’t attempt to humanize him.", "20-year-old who almost killed Trump was a bright student, had a job and belonged to a gun clubhttps://latimes.com/world-nation/story/2024-07-14/thomas-matthew-crooks-trump-assassination-attempt…", "If you keep talking about the assassination attempt don’t you dare tell the kids who survive school shootings and their families to “just get over it”\n\nWhat happened today is unacceptable and what happens every day to kids who aren’t the president and don’t survive isn’t either.", "Today, as I reflect on the horrific attack on Pearl Harbor, I find myself reflecting on the sacrifices made by millions of Americans, including my grandfather, in the fight against authoritarianism. Although he was fortunate enough to survive the war, he endured significant"], "anthonyzenkus": ["Israelhas resumed its genocidal attacks on the people ofGaza. Children are suffering the most asIsrael's forces bomb close to the largest functioning hospital left standing inGaza. Biden is complicit. It is time to#StopArmingIsrael. \n\n(report from UN - UNICEF spokesperson)", "\"Our focus is on damage, not on precision\" -IDFSpokesperson\n\n\"We will eliminate everything. They will regret it\". - Israeli Defense Minister Toav Gallant\n\n\"We are now rolling out theGazaNakba\". - Israeli Minister of Agriculture\n\nCollectjve punishment is a war crime.", "LatestGazaCasualty Numbers\nTotal dead: 24,285\nTotal wounded: Over 60 000\nTotal killed, injured or missing: 1/20 PalestiniansGazagenocide: brought to you byIsrael, sponsored by Joe Biden and the US War machine", "Are u fucking kidding me?? At least 400 Palestinians killed byIsraelin a targeted attack on a refugee camp. Every US official supporting this has blood on their hands, but it starts at the top. Biden must resign. Blinken must resign. Not one penny more forIsrael.#CeasefireNOW", "Israel is increasing its attacks in the West Bank, an area not run byHamas. The West Bank has no army and their citizens are defenseless. People are being forcibly removed from their homes, terrorized, arrested and shot. Bombs and bullets supplied by Kamala Harris and Joe Biden.", "\"I wish I could wake up without hearing the sound of ambulances, or bombs.\"\n\nThe children of Palestine are the most traumatized children in the world.\n\nThis is why we protest. Permanentceasefirenow. Permanent withdrawal now. Arms embargo now.", "“I'm scared my hair won't grow back, how can i go back to school like this?”\n\nEight-year-old Sama Tbail has lost her hair due to the psychological shock endured by Israel's war.\n\nPoor girl", "The cars were clearly labeled on their roofs and the aid workers shared their coordinates with Israel ahead of time to ensure their own safety. Israel knew exactly who and where they were. They targeted and murdered them. It was amassacre. Oh, and one was an American citizen.", "Innocent civilians have been targeted and killed by Israel. This has come out in Israeli press. We supplied the bombs despite this. Boden and US gov are culpable.", "1.Publicly call for Israel to leave the hospital alone. \n\n2. Publicly call for an immediate and permanentceasefireand withdrawal of Israeli troops from Gaza. \n\n3. Publicly call for immediate opening of all aid routes to allow unfettered medical and food supplies in", "Israel started this latest conflict by attacking the Iranian consulate in Syria, recognized as a violation of international law. They've continued to escalate ever since. If you have children, I trust you'll be encouraging them to sign up to fight Israel's war for them."], "benshapiro": ["This has been true since Hamas took over. In 2014 there were widespread reports of reporters being threatened or expelled for reporting that al-Shifa hospital was in fact a Hamas base. Reporters then hid their own reports to retain residency inGaza.", "Incredible that the Left's response to Americans cheering to free American hostages held by the terrorist group Hamas (which denies a ceasefire), is that a Palestinian must speak in order to rip into the American allyIsraelfighting to free those American hostages", "Was supremely moved by this speech, which was searing and compassionate. Also seems essential to include a Palestinian speaker to the convention.https://vanityfair.com/news/story/dnc-2024-palestine-israel…", "These pro-Hamas protests are being fostered by the faculty and patted on the head by the administration. That's because these colleges have been completely eaten by the evil intersectional ideology that crosses streams withJew-hatred.", "We ought to have sympathy for both. And we ought to recognize that both are dead because of Hamas.", "If you feel no sympathy for innocent Israelis murdered or kidnapped by Hamas terrorists last weekend, you have no humanity. \nIf you feel no sympathy for innocent Palestinians killed in Israel's revenge attacks on Gaza, you have no humanity. \nBe human.", "The predictable results of Biden's disgusting weapons cut-off threat:\n1. Hamas refuses any deal. The hostages, including Americans, remain. Hamas knows they've got Biden on their side.\n2.IsraelMUST go into Rafah because of (1). \n3. Biden is cutting off targeted munitions, which", "And I'm not judging Emhoff's family. I'm judging HIM for claiming to speak as aJewafter banging his nanny, going to church for Easter, and siring a person who funds the Hamas front group that is the UNRWA.", "The Unicorn State of Palestine has no government and no borders. Furthermore, none of these countries will stop calling Palestinian cities \"refugee camps\" or deny the absurd Palestinian claim of a \"right to return\" to the state ofIsrael. It's allIsrael-hating posturing.", "This has been true sinceHamastook over. In 2014 there were widespread reports of reporters being threatened or expelled for reporting that al-Shifa hospital was in fact aHamasbase. Reporters then hid their own reports to retain residency in Gaza.", "The Houthi slogan: \"Allahu Akbar, Death to America, Death to Israel, A Curse Upon the Jews, Victory to Islam.\"\n\nBiden cut off arms sales for Saudi against them and removed the Houthis' terrorist designation in 2021, then started negotiating with Iran.\n\nAll that worked out great.", "The Biden administration is now effectively preparing to make aid to Israel contingent on...unspecified changes to Israeli policy. Which means that Israel can do little or nothing to appease the White House.Hamasis now in control of the Biden administration.", "Why are the US State Department, the UN, the EU and NATO issuing condolences for the death of the Butcher of Tehran, Ebrahim Raisi? Because the West has a deep and abiding sickness: a perverse belief that all humans are good and therefore evil can be appeased and massaged.", "Blinken: We're close to a deal!Hamas: Nope.\nBlinken: The deal isn't dead!Hamas: ::sends suicide bomber to Tel Aviv::\nBlinken: We can still make a deal!\n\nThe WH is trying to delay action beyond the DNC. In doing so, it's telegraphing weakness to Iran, Hezbollah, andHamas.", "We ought to have sympathy for both. And we ought to recognize that both are dead because ofHamas.", "If you feel no sympathy for innocent Israelis murdered or kidnapped by Hamas terrorists last weekend, you have no humanity. \nIf you feel no sympathy for innocent Palestinians killed in Israel's revenge attacks on Gaza, you have no humanity. \nBe human.", "By \"never stop working to bring your loved ones home,\" he means \"we will blame Israel for any attempt to bring your loved ones home, and keep doingHamas' PR\"", "President Biden says he was devastated to learn that American-Israeli citizen Itay Chen was killed by Hamas.\n\n“I reaffirm my pledge to all the families of those still held hostage: we are with you. We will never stop working to bring your loved ones home...Today, as we join"], "IngrahamAngle": ["Anti-Israelprotesters descend upon Met Gala", "Adam Guillette: Anti-Israelmobs on campuses are 'Ivy league radicals and fools'", "Sen. Hawley mobbed by anti-Israelagitators in Senate hallway.", "Israelis willing to do what we would do: John Ratcliffe", "Hamas attack survivor: I feel more protected inIsraelthan I feel here.", "Netanyahu foreign policy adviser: Hamas will be dismantled.", "Israel is willing to do what we would do: John Ratcliffe", "Mike Pompeo:Hamaswill be the recipient of this aid", "Netanyahuforeign policy adviser:Hamaswill be dismantled.", "Hamasattack survivor: I feel more protected in Israel than I feel here."]}