{"benshapiro": ["This creates a catch-22. IfIsraeldoes not defend itself,Israelis destroyed. IfIsraeldoes defend itself while Hamas hides behind civilians, the media blast out these images. So what, precisely, isIsraelsupposed to do? World opinion will not govern Jewish survival.", "People need to understand how the Arab and Muslim world is digesting these images.\n\nYou might say, “they’ve always been against Israel; I don’t care,” but that’s foolish.\n\nSupport can shift from being non-existent to very aggressive opposition on a broad scale in a short time.", "If the Israeli security cabinet approves a temporary pause in order to return some of the hostages, the world will undoubtedly take this as the first step toward cessation of hostilities. Nope.Israel's mission will not and should not change: the utter destruction of Hamas.", "The word \"evil\" is not descriptive enough for Hamas. They murdered in cold blood six people they had taken hostage almost a year ago, including an American, just days ago -- all in an attempt to sow seeds of political chaos. A few points:\n\n1. Hamas must be extirpated. It is the", "Israelwill use care to avoid civilian casualties. Hamas will maximize those casualties.Israelmust achieve its aim of deposing Hamas. Every ounce of blood spilled is on Hamas' hands.", "Israel: We'd like our hostages back.\nHamas: Our counteroffer is that you get back their corpses and permanently end your war against us.\nNYT: Small changes to the deal proposed", "If you have \"community tension\" as a result of people posting photos of kidnapped children, might I suggest that the problem is with your community", "As every single person knows, this ends when Hamas surrenders. But Hamas won't surrender. Because they're counting on useful idiots to preserve their power. Hamas seeks Palestinian suffering.", "It's the most targeted anti-terror strike in human history. But sure, go on with your pro-Hezbollah propaganda efforts. After all, some of your friends had a rough day.", "Israel’s pager attack in Lebanon detonated thousands of handheld devices across of a slew of public spaces, seriously injuring and killing innocent civilians.\n\nThis attack clearly and unequivocally violates international humanitarian law and undermines US efforts to prevent a", "So in their expert opinion,Israelshould hand over territory to the Palestinians, who will then hold elections to determine who will govern them.\n\nOH WAITISRAELDID THAT INGAZAIN 2005, AND THEY ELECTED HAMAS, AND THEN THERE WAS OCTOBER 7.\n\nF***ing morons.", "Westplaining", "The worst slaughter of Jews and the greatest spike in global anti-Semitism in 80 years, and the White House is rushing to talk about Islamophobia.", "Taking on hate is a national priority.\n\nToday,@POTUSand I are announcing the country's first National Strategy to Counter Islamophobia.\n\nThis action is the latest step forward in our work to combat a surge of hate in America.", "Hamas murders Jewish babies in their beds.\nMedia: \"It must be the occupation.\"\nHamas digs up water pipes and uses them for rockets.\nMedia: \"Water shortages areIsrael's fault.\"\nHamas stations civilians in direct line of fire.\nMedia: \"Why won'tIsraelprotect civilians?\"", "My old shul. Used to walk here with the kids. \n\nBTW, if people protested Hamas by going to a random mosque and shouting at the constituents, it would be national news and Joe Biden would make a statement about the evils of Islamophobia.", "HAPPENING NOWOutside the school at Shaarey Zedek Congregation in Valley Village\n\nProtestors yelling in loudspeaker at Jewish school: “FREE FREE PALESTINE!”\nParent: “You’re coming to our school?!”\nProtestors: “Go across the street if you’re going to be an agitator!”", "Once again, the images from Gaza are awful and heartbreaking and entirely the fault ofHamas. The minuteHamasgives up the hostages and surrenders, this is all over. Everyone knows it. And everyone calling for aceasefireis doingHamas' dirty work.", "Netanyahu's democratically-elected unity government includes his chief center-left political rival, Benny Gantz. Nearly 250 IDF soldiers have been killed going door-to-door to protect civilians. Dictator Assad used chemical weapons on civilians. This comparison is asinine.", "Israel under Netanyahu is not really different than Syria under Assad -- a brutal government trying to protect an endangered Middle Eastern religious minority group by convincing everyone that it's too savage and ruthless to mess with.https://nbcnews.com/news/world/israel-hamas-war-aid-convoy-gaza-city-dead-idf-opened-fire-rcna141195…", "Now that he's the political leader ofHamas, that means when his obituary is written, we'll learn he was actually a moderate voice in favor of aceasefireaccording to WaPo and NYT", "NEW \n\nHxmas has just announced that Yahya Sinwar, the terror group's leader in Gaza, was selected as the head of its political bureau, succeeding the assassinated leader Ismail Haniyeh.", "The word \"evil\" is not descriptive enough forHamas. They murdered in cold blood six people they had taken hostage almost a year ago, including an American, just days ago -- all in an attempt to sow seeds of political chaos. A few points:\n\n1.Hamasmust be extirpated. It is the"], "IngrahamAngle": ["Netanyahu foreign policy adviser: Hamas will be dismantled.", "Adam Guillette: Anti-Israelmobs on campuses are 'Ivy league radicals and fools'", "Anti-Israelprotesters descend upon Met Gala", "Israelis willing to do what we would do: John Ratcliffe", "Netanyahuforeign policy adviser:Hamaswill be dismantled.", "Israel is willing to do what we would do: John Ratcliffe", "Mike Pompeo:Hamaswill be the recipient of this aid", "Hamasattack survivor: I feel more protected in Israel than I feel here."], "RealSpikeCohen": ["\"Hamas, to my great regret, isIsrael’s creation.\"\n\nThese are the words of Avner Cohen, a former Israeli religious affairs official who worked inGazafor decades.\n\nAs you watch the death and destruction that is currently unfolding inIsraeland Palestine, it's important for you", "Jewish organizations such as If Not Now and Jewish Voices for Peace have been organizing rallies across the US calling for a ceasefire inGaza.\n\nThe head of the ADL has called these Jewish groups \"hate groups\" and accused them of \"antisemitism\".\n\nThe ADL is defaming Jews.\n\nEven", "As recently as 2020, the Israeli government was begging Arab governments to continue funding Hamas.\n\nAsk yourself why they'd do that.\n\nAsk yourself why the most secure border on earth fell to people on paragliders.\n\nConsider who this war benefits:\n\n- Netanyahu, whose corruption", "Οι βοσκοί ήταν στα χωράφια κοντά στη Βηθλεέμ.  Έπαιρναν εναλλάξ παρακολουθώντας το κοπάδι τους κατά τη διάρκεια της νύχτας.  Τους εμφανίστηκε ξαφνικά ένας άγγελος από τον Κύριο.  Η δόξα του Κυρίου γέμισε την περιοχή με φως και τρομοκρατήθηκαν.  Ο άγγελος τους είπε: «Μη φοβάστε!", "Jewish organizations such as If Not Now and Jewish Voices for Peace have been organizing rallies across the US calling for aceasefirein Gaza.\n\nThe head of the ADL has called these Jewish groups \"hate groups\" and accused them of \"antisemitism\".\n\nThe ADL is defaming Jews.\n\nEven", "As recently as 2020, the Israeli government was begging Arab governments to continue fundingHamas.\n\nAsk yourself why they'd do that.\n\nAsk yourself why the most secure border on earth fell to people on paragliders.\n\nConsider who this war benefits:\n\n-Netanyahu, whose corruption", "For the people who read this, and somehow think I'm defendingHamas, or defending the killing of innocent Israelis, or claiming the killing didn't happen, or some other nonsense that I never said or implied:", "\"Hamas, to my great regret, is Israel’s creation.\"\n\nThese are the words of Avner Cohen, a former Israeli religious affairs official who worked in Gaza for decades.\n\nAs you watch the death and destruction that is currently unfolding in Israel and Palestine, it's important for you"], "briebriejoy": ["VIDEO PREMIERE:https://youtube.com/watch?v=_biSwyKSNOQ…\"When [Israel] did this whole 'hunt for Hamas' thing, while they were attacking hospitals, it was like: well, they're just attacking the hospital because they said they were going to do that. They called them the day before....Sort of", "\"What Hamas did was horrific, and they should answer for that. Now, at the same time, targeting innocent Palestinian citizens for something Hamas did is wrong. It is wrong. Turning off their electricity, taking away their water. 50% of people who live inGazaare 15 years and", "VIDEO PREMIERE NOW: \"The moral thing would be to open theGazaStrip & allow people to go to their homes & villages & the towns from where they were thrown out. ButIsraeldoesn't want to do that...So you have millions of people sitting in a prison, so they decided to kill them", "Axis of Resistance (w/ Rami Khouri)\"These are not just bands of wild men with long hair & knives & their teeth who came out of the caves and suddenly took over the government. These are people who emerged organically, from within the the the innards of the society. They", "TheCeasefireShell Game (w/@samhusseini)Independent journalist Sam Husseini completely dismantles the state department narrative around theceasefirenegotiations, who’s at fault, & what the new UN report tells us about Israel’s use of rape, torture, & the Hannibal", "VIDEO PREMIERE:https://youtube.com/watch?v=_biSwyKSNOQ…\"When [Israel] did this whole 'hunt forHamas' thing, while they were attacking hospitals, it was like: well, they're just attacking the hospital because they said they were going to do that. They called them the day before....Sort of", "\"WhatHamasdid was horrific, and they should answer for that. Now, at the same time, targeting innocent Palestinian citizens for somethingHamasdid is wrong. It is wrong. Turning off their electricity, taking away their water. 50% of people who live in Gaza are 15 years and", "\"The claim was that 0.002% of UNWRA had been involved in [October 7th]. So they defunded it. Now, more than 0.02% of the IDF has been committing war crimes way more than that. So, of course, if there were any consistency, they'd do something to the IDF. They'd defund the IDF."], "ComicDaveSmith": ["As the Israeli assault onGazabecomes even more transparently indefensible, I’d like to take on the three main “justifications” that I get the most.\n\n1) They have to finish the job! Hamas must be defeated!\n\nThe obvious moral hypocrisy of believing that you are justified in", "It’s pretty amazing. I’ve spent the last week talking about the conditions that led to the Hamas terrorist attack, mainlyIsrael’s occupation andIsrael’s support of Hamas. I’ve been speaking out against the current war, where over a million children’s lives hang in the balance.", "The Hamas attack onIsraelwas horrific, criminal and so stupid. It guarantees further suffering for their own people.\n\nThe problem in America is that most people have a simplistic view of the situation that is completely removed from reality. They assume normal relations and", "I see a lot of critics ofIsrael, who I respect very much, celebrating the ICJ ruling. It seems to me that they totally bitched out. They could have ordered an immediate ceasefire and instead they toldIsraelto make sure they don’t do anymore genocide and that they have a", "I see a lot of critics of Israel, who I respect very much, celebrating the ICJ ruling. It seems to me that they totally bitched out. They could have ordered an immediateceasefireand instead they told Israel to make sure they don’t do anymoregenocideand that they have a", "TheHamasattack on Israel was horrific, criminal and so stupid. It guarantees further suffering for their own people.\n\nThe problem in America is that most people have a simplistic view of the situation that is completely removed from reality. They assume normal relations and", "As the Israeli assault on Gaza becomes even more transparently indefensible, I’d like to take on the three main “justifications” that I get the most.\n\n1) They have to finish the job!Hamasmust be defeated!\n\nThe obvious moral hypocrisy of believing that you are justified in", "It’s pretty amazing. I’ve spent the last week talking about the conditions that led to theHamasterrorist attack, mainly Israel’s occupation and Israel’s support ofHamas. I’ve been speaking out against the current war, where over a million children’s lives hang in the balance."], "TheRickWilson": ["If you think it's bad thing that the leaders of Hamas and Hezbollah got whacked yesterday, just unfollow.", "Israel, Ukraine, and the Need for American Leadership", "I mean, I say this with some hindsight perspective...but De-Ba'athification ended up helping Iran, mostly.", "JD Vance: “We need a De-Ba’athification program in the U.S....We should seize the administrative state for our own purposes. We should fire all of the people...every single middle-level bureaucrat, every civil servant in the administrative state. Replace them with our people.”", "They put \"Israeli\" in quotes for a little more license to attack and dehumanize them.https://x.com/chaim89/status/chaim89/status/1719174781889663013…", "If you think it's bad thing that the leaders ofHamasand Hezbollah got whacked yesterday, just unfollow.", "Does the Islamic State understand the fury they've unleashed? The dread they should feel? \n\nTayqaeda is unleashed. Nothing will stop them.", "BREAKING:\n\nIslamist terror attack likely targeting Taylor Swift concert in Austria foiled.\n\nThe authorities revealed that the IS supporting terrorists where planning to detonate, most likely at one of the three Taylor Swift concerts taking place in Vienna this weekend.\n\n2 men", "No, he doesn't. \n\nThis is a war of aggression andgenocidetargeting civilians brought about by Vladimir Putin and his corrupt regime, and he's clearly fine with it.", "You’re upset because he wants to stop a war…\n\nYikes.", "As always on this grim anniversary, I ask you keep Terry Hatton, Mychal Judge OFM, Barbara Olson, and the thousands lost on that terrible morning in your hearts today."], "FreemansMind96": ["Everybody can see that you went to Time Square and the skate rink looking for Muslims to harass and provoke so you could stoke hate against antiwar protesters, Muslims, Arabs, and Palestinians. All while the foreign apartheid state you’re acting on behalf of commits this genocide", "I guess they’re angry with the Israeli apartheid spokeswoman because they’re also upset about the genocide taking place in PalestineGet a life, amirite?", "In a society with even a moderate level of self-respect, Graham would be behind bars", "It is blood libel and BS to say Israel is using starvation as a tool of war.", "I'm gonna go out on a limb and suggest the LP bump the other candidates and nominate@ComicDaveSmithfor this task, even if he's not running. \n\nDave Smith, Kennedy, and Trump is the debate we deserve.", "If this happens and the LP gets a candidate up there, it would really be something x.com/RobertKennedyJ…", "I guess they’re angry with the Israeli apartheid spokeswoman because they’re also upset about thegenocidetaking place in PalestineGet a life, amirite?", "Everybody can see that you went to Time Square and the skate rink looking for Muslims to harass and provoke so you could stoke hate against antiwar protesters, Muslims, Arabs, and Palestinians. All while the foreign apartheid state you’re acting on behalf of commits thisgenocide", "In a society with even a moderate level of self-respect, Graham would be behind bars", "It is blood libel and BS to say Israel is using starvation as a tool of war.", "I'm gonna go out on a limb and suggest the LP bump the other candidates and nominate@ComicDaveSmithfor this task, even if he's not running. \n\nDave Smith, Kennedy, and Trump is the debate we deserve.", "If this happens and the LP gets a candidate up there, it would really be something x.com/RobertKennedyJ…"], "HannahDCox": ["His insistence on raising his fist in this moment (watch the video) is phenomenal.\n\nThere has never been a more brilliant media mind in office.", "I’m genuinely confused as to how they thought this speech would help him. \n\nIt’s honestly radicalizing me against him. He must be stopped.", "I'm about as pro-immigration and pro-refugee as it gets.\n\nBut even I acknowledge it would be hard to vet refugees coming from Palestine. How would you determine who is Hamas-affiliated and who isn't?\n\nAnd why are none of theMuslimcountries in the region accepting them?", "I don’t know which side bombed the hospital.\n\nI do know that in war, you should question everything you’re being told at all times and wait for as much information as possible.\n\nPropaganda is the gasoline in the tank of the war machine.", "His insistence on raising his fist in this moment (watch the video) is phenomenal.\n\nThere has never been a more brilliant media mind in office.", "Just in the NICK OF TIME\n\nSCOTUS takes down the Chevron DoctrineIf you don’t already believe in limiting the power of the government and especially the executive, after last night there’s no excuse.\n\nCongress will now have to actually do their job and legislate", "I’m genuinely confused as to how they thought this speech would help him. \n\nIt’s honestly radicalizing me against him. He must be stopped.", "I'm about as pro-immigration and pro-refugee as it gets.\n\nBut even I acknowledge it would be hard to vet refugees coming from Palestine. How would you determine who isHamas-affiliated and who isn't?\n\nAnd why are none of the Muslim countries in the region accepting them?"], "KyleKulinski": ["As soon asIsraelannounced a total siege ofGazashutting off power, food, fuel & water to 2.3m people they obviously gave up any pretense of caring about civilian casualties. But Biden still pretends they’re being super careful & moral. Pathetic lie", "Israelis not eradicating Hamas. They’re not bombing in some legal, humanitarian way. Every single idiot not supporting a ceasefire is by default saying I support more of this, because this is whatIsraelis actually doing in reality. Never ever let them forget that.", "Israelbombed THIRTY ONE hospitals with our money and weapons you disgusting pathetic fraud", "Russia’s missile strikes that today killed dozens of Ukrainian civilians and caused damage and casualties at Kyiv’s largest children’s hospital are a horrific reminder of Russia's brutality. It is critical that the world continues to stand with Ukraine at this important moment", "I'M PRO-ISRAELNO I'M PRO-ISRAELI WANT TO FUND THEM\nNO I WANT TO FUND THEM MORE\nI WILL BLOW BIBI NETANYAHU\nI'LL BLOW HIM RIGHT NOW#GOPDebate", "As soon as Israel announced a total siege of Gaza shutting off power, food, fuel & water to 2.3m people they obviously gave up any pretense of caring about civilian casualties. But Biden still pretends they’re being super careful & moral. Pathetic lie", "Israel is not eradicatingHamas. They’re not bombing in some legal, humanitarian way. Every single idiot not supporting aceasefireis by default saying I support more of this, because this is what Israel is actually doing in reality. Never ever let them forget that.", "Israel bombed THIRTY ONE hospitals with our money and weapons you disgusting pathetic fraud", "Russia’s missile strikes that today killed dozens of Ukrainian civilians and caused damage and casualties at Kyiv’s largest children’s hospital are a horrific reminder of Russia's brutality. It is critical that the world continues to stand with Ukraine at this important moment", "Every single congressperson cheeringNetanyahuis morally depraved. They're overlooking or outright supporting one of the great atrocities of our time. The history books will judge all of these cretins as akin to nazis. The Lancet has the Palestinian death rate at 186,000 so the"], "seanhannity": ["Hamas Official Ghazi Hamad: We Will Repeat the October 7 Attack Time and Again UntilIsraelIs Annihilated", "Israelforensic team says victims were abused, tortured, burned alive", "Israeli officials: Hamas reported cease-fire deal is a ‘deception’", "'WE'RE NOT GONNA TAKE IT!': Pro-IsraelProtesters Gather Outside Columbia, Push Back Against Antisemitism [WATCH]", "Fox News:HamasPlanned for the Aftermath of Israel’s Invasion of Gaza as They Planned for the October 7th Terror Attacks", "HamasOfficial Ghazi Hamad: We Will Repeat the October 7 Attack Time and Again Until Israel Is Annihilated", "HamasLeader IsmailHaniyehKilled After Residence Hit in Tehran", "Israeli officials:Hamasreported cease-fire deal is a ‘deception’"], "funder": ["Jan 6 was a violent armed terrorist attack. Anyone saying anything else is lying.https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…#TrumpAttackedDemocracy", "Don’t let anyone lie about January 6th. It was an armed terrorist attack. Pipe bombs, guns, Molotov cocktails, stun guns, machetes, a crossbow, hockey sticks, baseball bats, flagpoles, pepper spray, bear spray, brass knuckles, scissors, needles, screwdrivers, and an axe. Over", "Jan 6 was an armed terrorist attack.\n\nHere’s proof (not that we needed more):https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…", "Would be a shame if this trended.#JDScaredToDebate", "“When 26 billionaires have as much wealth as half of humanity, that’s a crisis…It’s time, and it’s up to organized labor to lead that movement.”\n\nUAW President Shawn Fain is a hero.#SolidaritySeason", "Don’t let anyone lie about January 6th. It was an armed terrorist attack. Pipe bombs, guns, Molotov cocktails, stun guns, machetes, a crossbow, hockey sticks, baseball bats, flagpoles, pepper spray, bear spray, brass knuckles, scissors, needles, screwdrivers, and an axe. Over", "Jan 6 was a violent armed terrorist attack. Anyone saying anything else is lying.https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…#TrumpAttackedDemocracy", "Jan 6 was an armed terrorist attack.\n\nHere’s proof (not that we needed more):https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…"], "fred_guttenberg": ["(1,3) To those who take the time to send me emails like this, there was a ceasefire until October 7th, when a terror group who also happened to be the governing entity ofGazabrutally attackedIsraelkilling over 1400, raping women, burning babies and wearing go pros to extend", "For those not understanding the true size ofIsrael, a country surrounded by terrorists on borders who want to wipe out its existence, here it is.  It is the area in blue.   WhenIsraelnow responds in a fight for its survival, direct your anger at the terrorists who chose this.", "Please be vigilant.  Hamas is a terrorist group targeting all Jewish people.Israelwill finish them andIsraelneeds our support, but today is a day of caution for all Jewish people in the United States.", "Reporting is thatIsraelagreed to a truce last night but just wants a list of living hostages.. which Hamas won't provide to go to Cairo to ink the deal.  Based on this reporting, Hamas is blocking ceasefire & truce, notIsrael.", "(1,3) To those who take the time to send me emails like this, there was aceasefireuntil October 7th, when a terror group who also happened to be the governing entity of Gaza brutally attacked Israel killing over 1400, raping women, burning babies and wearing go pros to extend", "Please be vigilant.Hamasis a terrorist group targeting all Jewish people.  Israel will finish them and Israel needs our support, but today is a day of caution for all Jewish people in the United States.", "As a reminder,HAMASIS A TERRORIST GROUP.   They could release hostages and this would end.  That has always been the case.https://timesofisrael.com/hamas-rejects-israels-offer-for-two-month-pause-for-release-of-hostages/amp/…", "Reporting is that Israel agreed to a truce last night but just wants a list of living hostages.. whichHamaswon't provide to go to Cairo to ink the deal.  Based on this reporting,Hamasis blockingceasefire& truce, not Israel."], "LeeCamp": ["The debate over what is happening inGazaright now is not a real debate.Israelhas ADMITTED to a long list of atrocities & crimes. Here are some of them:", "BREAKING — Today saw protests in Washington DC, NYC, Tokyo, Rochester, Pittsburgh, Havana, Cuba & many other cities around the world demanding an end toIsrael's war / conflict / genocide / ethnic cleansing — Whatever you want to call it.", "BREAKING: The number of murdered & missing people inGazanow tops 37,000.\n70% are women & children.\nYetIsraelcontinues it's genocidal attack.", "BREAKING: TheIDFopened fire on innocent people in line for humanitarian aid trucks inGazaCity. They killed at least 100 in just the latest massacre.", "The debate over what is happening in Gaza right now is not a real debate. Israel has ADMITTED to a long list of atrocities & crimes. Here are some of them:", "The number of children murdered by Israel over 5 months is MORE than the number of children killed in all conflicts around the globe for the past 4 YEARS.#CeasefireNow#ProsecuteWarCriminals", "Wow. An Israeli official accidentally ADMITTED on live television that their goal is to severely punish all 2.2 million Gazans, including children. Collective punishment of innocent people is illegal under the Geneva Conventions & international law.", "Secretary of State Antony Blinken's propaganda is not hard to break down but many Americans don't notice it. To begin with,Hamas's attack on Oct 7th is called a \"slaughter\" but nothing Israel ever does is called a \"slaughter\", even though Israel has killed many thousands"], "JordanChariton": ["My take on corporate media's \"anti-semitic\" propaganda on Columbia'sGazastudent protests: I've covered protests across America: BLM, anti-pipeline, climate, healthcare, etc. ALL had elements of individuals out of synch w/ the overall message & sentiment of the protest...", "UNREAL: Head of the Democratic Majority forIsraelSuper PAC—who spent millions to bring down Bernie Sanders, Nina Turner, etc—says young voters are fleeing Biden and protesting for Palestine because they have an \"unfamiliarity with the Holocaust.\" \n\nIt's actually the opposite.", "As aJew, I believe “never again” means for all people and all of humanity. WhatIsraelis currently doing to the people ofGazais a war crime. Full stop.", "Truly gross that journalists report on Kamala Harris' increased \"empathy\" toward Palestinians while the doctors that were forbidden from the DNC stage reveal the deliberate crimes against childrenIsraelis perpetrating", "\"I have been to Gaza twice now....I saw horrifying injuries that indicated deliberate [Israeli] targeting of children. I saw a 19-month old girl who had been shot in the leg by a quadcopter while she was playing outside her family tent,\" -ER Dr. Tammy Abughnaim on Gaza horror", "Is because if the government and Wall Street get away with their crimes in Flint, THEY WILL USE THE SAME\nPLAYBOOK ELSEWHERE. Well, they are…in East Palestine and many other sacrifice zones that the media ignores as they cover Trump’s porn star payoffs 24/7 and the political…", "As a Jew, I believe “never again” means for all people and all of humanity. What Israel is currently doing to the people of Gaza is a war crime. Full stop.", "Contamination in East Palestine. “It pisses me off” -Jenna told me when I asked about EPA saying everything is fine here. “They’re lying.” For 8 years, I have repeatedly said that the reason I have continued covering the ONGOING#FlintWaterCrisis—which tomorrow marks 10 years…", "Within 2 minutes of walking into her grandparents East Palestine home, I felt delirious and as the interview progressed over an hour, my headache got worse. AND THEY ARE STUCK LIVING THERE while the EPA and its media accomplices continue claiming they have found no chemical…"], "mmpadellan": ["While Democrats push for ceasefire and humanitarian aid inGaza, Republicans like Rep. Tim Walberg call for the slaughters of Palestinian children, \"It should be like Nagasaki and Hiroshima.\"\n\nThis should be a much bigger story.", "Good morning and Happy Sunday to everyone who would like to see this deal finalized to release dozens of women and children hostages from captivity inGaza, and increase humanitarian aid.\n\nI'd rather see every last one of the hostages freed but it's an important first step.", "Israelhas a right to exist.\nPalestine has a right to exist.\nA two-state solution is the ONLY way forward.\nBOTH need to be free of terrorist violence, retaliatory violence, settler violence, and occupier violence.\nFree of violence, PERIOD.\n\nBoth sides have suffered tremendous", "LATE NITE WITH BDD:Israel-Hamas Conflict intensifies, Rep. George Santos indicted AGAIN, Tommy Tuberville and Rand Paul BLOCKING State and Military, Elon Musk to remove likes, reposts, and replies. Identifying misinformation onIsrael-Hamas.Live on my YouTube at 10:30PM ET", "While Democrats push forceasefireand humanitarian aid in Gaza, Republicans like Rep. Tim Walberg call for the slaughters of Palestinian children, \"It should be like Nagasaki and Hiroshima.\"\n\nThis should be a much bigger story.", "WOW.\n\nSenator Chuck Schumer called BenjaminNetanyahu\"an obstacle to peace,\" and \"too willing to tolerate the civilian toll in Gaza,\" and called for Israel to hold new elections to replace him.\n\nSenator Schumer is 100% right.", "Israel has a right to exist.\nPalestine has a right to exist.\nA two-state solution is the ONLY way forward.\nBOTH need to be free of terrorist violence, retaliatory violence, settler violence, and occupier violence.\nFree of violence, PERIOD.\n\nBoth sides have suffered tremendous", "LATE NITE WITH BDD: Israel-HamasConflict intensifies, Rep. George Santos indicted AGAIN, Tommy Tuberville and Rand Paul BLOCKING State and Military, Elon Musk to remove likes, reposts, and replies. Identifying misinformation on Israel-Hamas.Live on my YouTube at 10:30PM ET"], "charliekirk11": ["BREAKING: Lebanon’s state-run National News Agency claims an Israeli drone strike in Southern Lebanon has killed top Hamas official, Saleh Arouri.\n\nEven before Oct 7, Netanyahu had threatened to kill Arouri who was one of the founders of Hamas’ military wing and led the group’s", "Six days after Oct. 7th, I went on the PBD Podcast and asked a series of questions about what Israeli intelligence failures happened that allowed Hamas to massacre 1,200 civilians. The clip went viral and I was attacked as an antisemite and called worse than a \"Holocaust denier.\"", "BREAKING: According to AP, Hamas has told Qatar and Egyptian mediators that it will accept terms of a ceasefire and prisoner swap withIsrael. This comes asIsraelwas preparing a ground siege on Rafah, the last Hamas stronghold inGaza.", "70 percent of Gazans say that peaceful coexistence withIsraelis unacceptable; only genocide and destruction ofIsrael, “from the river to the sea,” is enough.\n\nThis, more than anything else, is why the war inGazahappened.", "Son ofHamasleader, Mosab Hassan Yousef, denouncedHamasand converted to Christianity after witnessing their savagery: \n\n\"They don't care for the Palestinian people. They don't regard human life. I saw their brutality firsthand....If they succeed in destroying Israel and", "YayhaSinwar, the head ofHamasin Gaza, took time out of an interview to pander to the left over “the racist murder of George Floyd.”\n\nA week ago I was ridiculed for linking the poisonous ideologies ofHamasand BLM. But at heart they are the same hateful ideologies. Both rely", "Six days after Oct. 7th, I went on the PBD Podcast and asked a series of questions about what Israeli intelligence failures happened that allowedHamastomassacre1,200 civilians. The clip went viral and I was attacked as an antisemite and called worse than a \"Holocaust denier.\"", "BREAKING: According to AP,Hamashas told Qatar and Egyptian mediators that it will accept terms of aceasefireand prisoner swap with Israel. This comes as Israel was preparing a ground siege on Rafah, the lastHamasstronghold in Gaza."], "davidsirota": ["The antisemitism and Islamophobic bloodlust on this website is positively nauseating, and it’s coming from all sides, including those wrapping themselves in the banner of social justice.\n\nYou can piously try to deny it. But your bullshit is bullshit. It’s fucking grotesque.", "- Hamas terrorism is not justifiable/defensible.\n\n-Israel's violent response is not justifiable/defensible.\n\nMost people in the real world I've talked to acknowledge both truths.\n\nMany on this website will not acknowledge both truths for fear that it may prevent a Twitter dunk.", "I'm making an effort to stay off this website for a bit & am rethinking my work in media. \n\nI'm pro-ceasefire, anti-occupation & anti-Netanyahu. \n\nBut the intense level of antisemitism piously wrapped in the banner of social justice has made me deeply depressed & demoralized.", "In conversations I've had, it's clear many Jews who are morally opposed toIsrael's war are also disgusted with those who are obviously using the war to promote antisemitism under the banner of social justice.\n\nYou can oppose the war without being an antisemite. Please try that.", "Harris needs to break from Biden’s policy of unwavering, unconditional support ofNetanyahu’s government. A clear break needs to happen as soon as possible.", "-Hamasterrorism is not justifiable/defensible.\n\n- Israel's violent response is not justifiable/defensible.\n\nMost people in the real world I've talked to acknowledge both truths.\n\nMany on this website will not acknowledge both truths for fear that it may prevent a Twitter dunk.", "In conversations I've had, it's clear many Jews who are morally opposed to Israel's war are also disgusted with those who are obviously using the war to promote antisemitism under the banner of social justice.\n\nYou can oppose the war without being an antisemite. Please try that.", "I'm making an effort to stay off this website for a bit & am rethinking my work in media. \n\nI'm pro-ceasefire, anti-occupation & anti-Netanyahu. \n\nBut the intense level of antisemitism piously wrapped in the banner of social justice has made me deeply depressed & demoralized."], "kylegriffin1": ["Breaking:Israel's government has approved the outline of a deal to secure the release of some hostages held by Hamas.", "President Biden saysIsrael's conduct inGazahas been \"over the top.\"", "Sen. Raphael Warnock is now calling for a ceasefire inGaza.", "CAIRO (AP) — Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal.", "BREAKING. Vice President Harris on Israel-Gaza:\n\n\"Israel has a right to defend itself, and how it does so matters.\"\n\n\"The images of dead children and desperate, hungry people fleeing for safety, sometimes displaced for the second, third or fourth time — we cannot look away in the", "Breaking: Israel's government has approved the outline of a deal to secure the release of some hostages held byHamas.", "Sen. Raphael Warnock is now calling for aceasefirein Gaza.", "According to the White House, President Biden spoke by phone with the family of the two Americans released today after being taken hostage byHamas."], "TuckerCarlson": ["Ep. 69  War with Iran? Yes. We’re already in it. Joe Kent did 11 combat tours in the U.S. Army. His wife Shannon was killed serving in Syria. Here’s his informed view of what that war will mean.", "Rep. Thomas Massie doesn’t care what you think of him, which is pretty great.\n\n(3:19) Where Does US Debt End?\n(10:32) Why Massie Voted 15 Times Against FundingIsrael(14:53) AIPAC\n(34:04) Mitch McConnell\n(42:25) Area 51\n(50:32) Massie's Relationship with Trump\n(57:09) Kill", "Eithan Haim is one of the rare American physicians who's refused to accept the sexual mutilation of children in his hospital. Doctors, he says, believe “they can create a new type of human.”", "Ep. 74  The Ukrainian government canceled elections and killed an American journalist. Congress is about send them another $60 billion. J.D. Vance is trying to stop it.", "Rep. Thomas Massie doesn’t care what you think of him, which is pretty great.\n\n(3:19) Where Does US Debt End?\n(10:32) Why Massie Voted 15 Times Against Funding Israel\n(14:53) AIPAC\n(34:04) Mitch McConnell\n(42:25) Area 51\n(50:32) Massie's Relationship with Trump\n(57:09) Kill", "Eithan Haim is one of the rare American physicians who's refused to accept the sexual mutilation of children in his hospital. Doctors, he says, believe “they can create a new type of human.”", "Ep. 69  War with Iran? Yes. We’re already in it. Joe Kent did 11 combat tours in the U.S. Army. His wife Shannon was killed serving in Syria. Here’s his informed view of what that war will mean.", "Ep. 37 The two defining tragedies of our time — the war in Ukraine and the presidency of Joe Biden — are both finally coming to an end.\n\nTIMESTAMPS:\n(00:17) Glenn Greenwald joins\n(05:41) Will the Ukraine War Hawks ever apologize?\n(07:25) Using foreign wars to punish Americans"], "elonmusk": ["Khamenei’s official position is clear that the eradication ofIsraelis the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violence and vengeance.\n\nStoking the fires of hatred isn’t", "Starlink is now active in aGazahospital with the support of@UAEmediaofficeand@Israel", "If you teach that “weak makes right”, then the perceived stronger party – in this case,Israel– is wrong.\n\nMorals should be taught in the absolute, meaning that it is possible for either the strong or weak to be morally good, depending on their actions.", "Yes, “decolonization” necessarily implies a Jewish genocide, thus it is unacceptable to any reasonable person", "Starlink is now active in a Gaza hospital with the support of@UAEmediaofficeand@Israel", "Khamenei’s official position is clear that the eradication of Israel is the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violence and vengeance.\n\nStoking the fires of hatred isn’t", "Yes, “decolonization” necessarily implies a Jewishgenocide, thus it is unacceptable to any reasonable person", "This was a tough call. \n\nWhile many government leaders, including in the USA, do call for killing people, we have a “UN exemption rule”; if a government is recognized by the UN, we will not suspend their accounts.Hamasis not recognized as a government by the UN, so was"], "itsJeffTiedrich": ["I wrote a thing: \"oh look, the antisemites are now pretending to give a shit about antisemitism.\" thanks for reading, and please sign onto my FREE mailing list to make sure you never miss a post —https://bit.ly/3TluWgk", "seems like a good day to repost this thing I wrote back in December — 'oh look, the “Jews will not replace us” crowd is now pretending to give a shit about antisemitism'https://bit.ly/3TluWgk", "hey, remember when you phoned up your despot bestie Netanyahu and told him not to accept a cease fire deal? ace job, homeslice. good thing your meddling caused no serious consequences, am I right", "I wrote a thing: \"The New York Times hits a new low in false equivalencies\" — there’s nothing the Grey Lady can’t both-sides.\nthanks for reading, and please sign up for my daily newsletter to keep getting the good stuff —https://bit.ly/3XxHbs9", "hey, remember when you phoned up your despot bestieNetanyahuand told him not to accept a cease fire deal? ace job, homeslice. good thing your meddling caused no serious consequences, am I right", "I wrote a thing: \"no, you fucking ghouls, school shootings don’t have to be a ’fact of life’\" — every other country in the world thinks we’re nuts.\nthanks for reading, and please sign up for my daily newsletter to keep getting the good stuff —", "seems like a good day to repost this thing I wrote back in December — 'oh look, the “Jews will not replace us” crowd is now pretending to give a shit about antisemitism'https://bit.ly/3TluWgk", "I wrote a thing: \"BEST OF 2023: the right-wing hate machine created a monster and handed him a weapon of mass death\" — thanks for reading, and please sign up for my daily newsletter so that you never miss a post —https://bit.ly/48pE7km"], "bluestein": ["A large crowd gathered at Georgia Tech today to rally for Jewish students who feel threatened by recent campus demonstrations. Similar rallies are being held all over Georgia campuses now.", "Biden’s speech ends after he speaks of theIsrael-Hamas war in broad terms, saying the conflict is “heartbreaking” and that he’s working to bring it to an end. His address is well received by students, alumni and their families — who cheer as he’s given an honorary degree.", "The VP briefly addressed the growing conflict in theMiddleEastafterIsraelretaliated for rocket attacks by targeting a Hezbollah commander.", "Democratic@SenOssoff, the first Jewish US senator in Georgia history, condemns the “indiscriminate and murderous assault on ourIsraelallies.”#gapol#gasen", "Biden’s speech ends after he speaks of the Israel-Hamaswar in broad terms, saying the conflict is “heartbreaking” and that he’s working to bring it to an end. His address is well received by students, alumni and their families — who cheer as he’s given an honorary degree.", "The VP briefly addressed the growing conflict in the Middle East after Israel retaliated for rocket attacks by targeting a Hezbollah commander.", "Georgia, you can breathe a sigh of relief. It’s SINE DIE. \n\nPhew.", "“Shawn,” the president said, “I wish I didn’t have to make this call … I know there’s nothing anybody can say or do to ease the pain. I’ve been there.”"], "krystalball": ["“With God's help, children inGazawill die thanks to us.”\n\nRight wing activists inIsraelare getting inside info from the military and organizing on WhatsApp to block and torch aid trucks and assault truck drivers. Police stand by and watch making no arrests.", "The targeting of Al Shifa hospital, is also likely to make it even more difficult (impossible?) to track Palestinian deaths and injuries as the office of the person who tracks and reports this data is located at the hospital.https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033…", "274 Palestinians killed in a bloody massacre to rescue 4 Israelis (and possibly kill others) and this is being celebrated by US politicians as a win. Depraved.", "The only time the word \"Israel\" is even mentioned is in a statement from theIDFdenying that they target civilians. Guess thatIDFcensor CNN chooses to operate under is doing their job.", "“With God's help, children in Gaza will die thanks to us.”\n\nRight wing activists in Israel are getting inside info from the military and organizing on WhatsApp to block and torch aid trucks and assault truck drivers. Police stand by and watch making no arrests.", "The targeting of Al Shifa hospital, is also likely to make it even more difficult (impossible?) to track Palestinian deaths and injuries as the office of the person who tracks and reports this data is located at the hospital.https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033…", "The only time the word \"Israel\" is even mentioned is in a statement from the IDF denying that they target civilians. Guess that IDF censor CNN chooses to operate under is doing their job.", "274 Palestinians killed in a bloodymassacreto rescue 4 Israelis (and possibly kill others) and this is being celebrated by US politicians as a win. Depraved."], "SarcasmStardust": ["It shouldn’t escape anyone that on Holocaust Remembrance Day Zionists are bombing the fuck out of hundreds of thousands of completely defenseless civilians living in tents in a refugee camp. They’re likely hoping you won’t call them out, out of respect. Zionists deserve ZERO", "Israelwasn’t attacked.Israelisn’t real. The occupiers of Palestine were attacked.", "Israelhas targeted and murdered over 130 journalists in the past 9 months. \n\nFuckIsrael.", "Guess what, I am supposed to report on the killing of my colleague and friend now", "Zionism isn’t Judaism. Judaism isn’t Zionism. Being anti-Zionist doesn’t mean you hate Jews. It just means you hate genocidal psychopaths. \n\nHope that helps.", "It shouldn’t escape anyone that on Holocaust Remembrance Day Zionists are bombing the fuck out of hundreds of thousands of completely defenseless civilians living in tents in a refugee camp. They’re likely hoping you won’t call them out, out of respect. Zionists deserve ZERO", "People trying to makegenocideabout any other issue except thegenocideneed to shut the fuck up. It’s not about gay rights. Or trans rights. Or covid. Or women’s rights. Or anything other than Israel is slaughtering innocent civilians en masse for the purpose of eliminating the", "“But more people will die”\n\nPalestinians BEEN dying. And that’s not going to stop. The fact that there are people who think they should just sit around and continue to take it blows my mind. There’s only one aggressor and occupier here. And it ain’t Palestine.", "You don’t endHamasby slaughtering a bunch of innocent people. That’s how you recruit forHamas."], "AnnCoulter": ["I don't like Ramaswamy's conspiracy theories, but none of them hold a candle to Nikki Haley's claim that Hamas attackedIsraelon Oct 7 because it's Putin's birthday.#WarmongerMadness", "Well, I know how to recognize a future Palestinian state. It'll be the one lobbing rockets across the border at Israeli civilians.", "Nikki Haley explains the Hamas attack onIsrael: \n\n“I told you about that brutality on Oct. 7 inIsrael. Right? Oct. 7 is Putin’s birthday.”\n\nThis is the nitwit the donors are trying to foist on us.", "Today’s Pro Hamas protestors in DC could use make-overs and Ozempic.", "I don't like Ramaswamy's conspiracy theories, but none of them hold a candle to Nikki Haley's claim thatHamasattacked Israel on Oct 7 because it's Putin's birthday.#WarmongerMadness", "NEW COLUMN!  The Fall of Rome, Updated\n\nAmericans killed by Islamic terrorists in Islamic lands so far this year: 3.\n\nAmericans killed by third-worlders who entered our country illegally so far this year: 150.", "Well, I know how to recognize a future Palestinian state. It'll be the one lobbing rockets across the border at Israeli civilians.", "Interesting article by David Cole.\n\n<<And before you give me that claptrap about “Well, the people of Gaza are traumatized! What do you expect?” remember that the polls I cited of Muslims and their love of civilian-killing come from Muslims living safely in their own nations and"], "SteveSchmidtSES": ["More than 100 people participated in a flash hora in Toronto to celebrate Jewish culture in the midst of a significant rise in antisemitism in both Canada and worldwide. What a great show of solidarity.#stopantisemitism#neveragain", "\"Israelwill defend itself and America will stand firm by her side because the lessons of history are clear. Never again wasn't a slogan. It was the most essential moral lesson in human history.\"\n\nMore of my thoughts on what the American response should be to Hamas' attack:", "\"IfIsraeldoesn't win this war and doesn't do what is necessary to defend civilization, then we will have another ISIS and they will come for us.\"\n\nMore on why we must stand shoulder to shoulder withIsraelto defeat the evil of Hamas:https://youtu.be/UTRHWAeRx9Q", "\"The corruption of one man inIsraelhas brought the whole world to the brink of war because his corruption and weakness stirred evil, and when evil sees weakness, it strikes.\"\n\nMore on how corrupt politicians like Netanyahu and Trump threaten the world:https://youtu.be/r4gBjhnOy_k", "\"Israel will defend itself and America will stand firm by her side because the lessons of history are clear. Never again wasn't a slogan. It was the most essential moral lesson in human history.\"\n\nMore of my thoughts on what the American response should be toHamas' attack:", "\"How could it conceivably be denied and forgotten within a single human lifetime when there are still nearly a quarter million survivors of the Nazi extermination camps?\"\n\nToday marks International Holocaust Remembrance Day and it's never been more important to remember:", "\"If Israel doesn't win this war and doesn't do what is necessary to defend civilization, then we will have another ISIS and they will come for us.\"\n\nMore on why we must stand shoulder to shoulder with Israel to defeat the evil ofHamas:https://youtu.be/UTRHWAeRx9Q", "\"Today is International Holocaust Remembrance Day. The greatest crime in human history, industrializedgenocideis remembered on the day the Russian army discovered what the Nazis created in Poland.\"\n\nNever forget. Never again.https://bit.ly/4bb2XXo"], "SocialistMMA": ["Israelcommits crime of the century as they slaughter Palestinians in Rafah\n\nZionism is currently the most barbaric ideology in the world", "Israeli settlers are attacking and lynching Palestinians in theWestBankEvery single adult Israeli is a willing agent and tool of colonialism", "Violent Israeli settlers were committing so many terrorist acts on Palestinians in thewestbankthat the United States is revoking their visas \n\nEverything Zionists accuse Palestinians of is pure projection. Israeli settlers are terrorists", "Israelannounces war crimes and atrocities are planned forGazaCritical support for the Palestinians#FreePalestine", "Israel commits crime of the century as they slaughter Palestinians in Rafah\n\nZionism is currently the most barbaric ideology in the world", "Weird how the media pretendedHamastargeted civilians on Oct 7th, but now it comes out all their victims where military personnel while the IDF killed Israeli civilians", "What the corporate media and their shills will never tell youHamasis NOT the terrorist group in this conflict\n\nIsrael is the party that has been out of compliance under International Law for YEARS\n\nThey are only protected by the United States veto power. \n\nPalestinians", "“The United States is controlling the war in Gaza, and it is the United States that must pay the price for the crimes perpetrated by the Israelis in Gaza and by the Americans in Iraq and elsewhere.”\n\nAddress by Hezbollah Chief Nasrallah that was viewed by millions around the"], "gtconway3d": [".@DouglasKMurrayto@piersmorgan:\n\n“The thing that struck me, Piers, about seeing the 7th of October footage, was that even the Nazis were actually ashamed of what they did.  SS battalions who spent their days shooting Jews in the back of the head and pushing them into trenches,", "“‘If Hamas remains on the scene, Iran, the state of the ayatollahs, will be poised on Egypt’s borders, threatening security in Sinai and the entire Egyptian republic,” writes Algerian journalist and author Hamid Zinar.\n\n“‘This threat will intensify when Hamas declares that it is", "“Hamas weaved its vast tunnel networks into the society on the surface. Destroying the tunnels is virtually impossible without adversely impacting the population living inGaza.”", "\"Before the Israel-Hamas war...The Israel Defense Forces (IDF) and scholars estimated...that there were three hundred miles of tunnels ranging from fifteen feet to over two hundred feet below the surface. The estimates were wrong.\"@WarInstitutehttps://mwi.westpoint.edu/gazas-underground-hamass-entire-politico-military-strategy-rests-on-its-tunnels/…", "Bibi:  the shekel stops anywhere but here", "STUNNING:  Netanyahu believes that the security establishment let the atrocities of Oct 7 happen in order to bring him down. \n\nThis, per@DaphnaLiel, one of Israel's most mild-mannered and no-nonsense political reporter@N12News.x.com/brown_johnbrow…", ".@DouglasKMurrayto@piersmorgan:\n\n“The thing that struck me, Piers, about seeing the 7th of October footage, was that even the Nazis were actually ashamed of what they did.  SS battalions who spent their days shooting Jews in the back of the head and pushing them into trenches,", "“‘IfHamasremains on the scene, Iran, the state of the ayatollahs, will be poised on Egypt’s borders, threatening security in Sinai and the entire Egyptian republic,” writes Algerian journalist and author Hamid Zinar.\n\n“‘This threat will intensify whenHamasdeclares that it is", "“Hamasweaved its vast tunnel networks into the society on the surface. Destroying the tunnels is virtually impossible without adversely impacting the population living in Gaza.”", "\"Before the Israel-Hamas war...The Israel Defense Forces (IDF) and scholars estimated...that there were three hundred miles of tunnels ranging from fifteen feet to over two hundred feet below the surface. The estimates were wrong.\"@WarInstitutehttps://mwi.westpoint.edu/gazas-underground-hamass-entire-politico-military-strategy-rests-on-its-tunnels/…", "ObviouslyHamaswas attempting to hit the IDF base under the hosp— … oh, wait", "Hamas rockets have hit Israel's Barzilai Hospital in Ashkelon for the second time in a month. \n\nHas it made the news where you live?"], "ProudSocialist": ["I’m so sick of this attack line that “Jill Stein only shows up at election time” when the truth is Jill has been showing up & fighting for the people since Occupy Wall Street. Democrats have no room to talk here when the only thing they ever show up for is their corporate donors.", "A vote for Trump or Harris is a vote to preserve the duopoly, fund the endless war machine, and protect the profits of big corporations at all costs.\n\nA vote for Jill Stein is a vote to put the people, the planet, and peace over the profits of big corporations.\n\nVote accordingly.", "The only appropriate response to a president who tells you the “economy is booming” as the poverty rate doubles & the masses struggle to afford basic needs like healthcare, housing & food.", "There is no “lesser evil.” The Democrats serve the same corrupt capitalist and imperialist system that Republicans do.\n\nDemocrats just do it with a smile and sedate you with platitudes as they are selling you out to their corporate donors and the war machine.\n\nReject the duopoly.", "The only appropriate response to a president who tells you the “economy is booming” as the poverty rate doubles & the masses struggle to afford basic needs like healthcare, housing & food.", "Kamala Harris being endorsed by 200 Bush/Cheney Republicans and calling for the U.S. to have the most “lethal fighting force in the world” shows she would be a president—not for the people—but for the military industrial complex, Wall Street, and the donor class.#VoteThirdParty", "The DNC is paying tribute to Prince tonight, which is ironic because he is one of the few artists who actually spoke out against the duopoly & recognized that supporting the blue corporate party is just “a veiled form of fascism where nothing really changes.”", "You cannot occupy, colonize, and steal people’s land and then expect peace.\n\nYou kill peace the moment you subjugate an entire group of people.\n\nConversely, you create peace when all people are liberated and free.#Israel#FreePalestine#EndApartheid"], "checkmatestate": ["Underrated meme.\n\nNuclear power is the solution to so many problems.", "Republicans: “Gun-free zones are stupid because murderers don’t follow laws.”\n\nAlso Republicans: “Gun control laws for illegals are smart because illegal immigrants will follow the law.”", "I see libertarians saying Trump’s conviction makes them more excited to vote for him.\n\nWhy?\n\nThis was clearly a politically motivated prosecution and a perversion of justice.\n\nSo what? Did it make Trump less authoritarian somehow?\n\nExplain yourselves.", "Underrated meme.\n\nNuclear power is the solution to so many problems.", "Republicans: “Gun-free zones are stupid because murderers don’t follow laws.”\n\nAlso Republicans: “Gun control laws for illegals are smart because illegal immigrants will follow the law.”"], "Josh_Moon": ["What kills me about the people who piled on the Smiths Station mayor is that they've almost all sat by quietly as pastor after pastor got busted for various sex crimes, theft and crimes against children. But let a pastor dress up as a woman and they're \"outraged\"", "This message would work in Alabama. I'm begging Democrats to use it. The abortion law we live under here is NOT popular with the majority of voters. Stop being scared of this issue.", "This is an ad Democrat Andy Beshear ran during his campaign in Kentucky. Tonight he is re-elected. This is a reminder even in a state like Kentucky you can stand for what is right and prevail and continue to help endless Americans.", "But back when we were looking for ways to lock up women for seeking abortions I was told that we can't pick and choose which laws to enforce. It sure gets confusing when we rule based on which religion is most popular. We should do something about that.", "Nothing to see here. Just the AG of Alabama offering condolences to a white guy because the state had the gall to lock him up after a jury found him guilty of killing a Black man. \n\nWhat an absolutely disgusting disregard of Black life by the state of Alabama.", "Yes, how dare@GavinNewsommake an ad using... true stuff our AG said.", "New GOP message: we'd win more if we stopped the voting on stuff", "this Newsmax copium is actually hitting pretty good", "But back when we were looking for ways to lock up women for seeking abortions I was told that we can't pick and choose which laws to enforce. It sure gets confusing when we rule based on which religion is most popular. We should do something about that.", "Nothing to see here. Just the AG of Alabama offering condolences to a white guy because the state had the gall to lock him up after a jury found him guilty of killing a Black man. \n\nWhat an absolutely disgusting disregard of Black life by the state of Alabama."], "EricTrump": ["Less than three weeks ago, President Biden delivered $6 billion in funds to Iran. This is the result.https://x.com/MarioNawfal/status/1711138433005969789/video/1…", "What a video! Minnesota citizens absolutely DESTR0Y Tim Walz", "No honest Judge would allow this sham to continue - this case should be dismissed.", "Rose’ 5K run/walk at@TrumpWinerybenefiting@StJudethis Saturday, April 27th! Sign up online!#Charlottesville#Virginia", "It is hard to believe this is being allowed in the United States… she has been waiting for this moment her entire life.", "Less than three weeks ago, President Biden delivered $6 billion in funds to Iran. This is the result.https://x.com/MarioNawfal/status/1711138433005969789/video/1…", "What a video! Minnesota citizens absolutely DESTR0Y Tim Walz", "No honest Judge would allow this sham to continue - this case should be dismissed."], "LaraLeaTrump": ["All you need to know about Project 2025 - SHARE & SPREAD THE WORD!!!", "Doing some world-class bowling, 3 years ago today, at the Camp David bowling alley.", "WATCH:@ErinElmore&@AnnabellaRockw1join me to discuss the rise in antisemitism, the migrant crisis impacting New York City, Joe Biden's internet takeover, Fake News CNN, AND MUCH MORE!#TheRightView", "This is the day the Lord has made; let us rejoice and be glad in it.", "I don’t know who needs to hear this, but", "All you need to know about Project 2025 - SHARE & SPREAD THE WORD!!!", "WATCH:@LibbyEmmons&@BriannaLyman2join me to discuss Israel, BLM supportingHamas, Biden family corruption, AND MUCH MORE!#TheRightView", "HAPPY THANKSGIVING EVERYONE! HE WILL BE BACK SOON!"], "WarOnDumb": ["Tommy Tuberville’s anti-immigrant rhetoric has been inching toward hate speech for a while. Now he says they know nothing of God.", "Marshall’s office has ignored requests for comment. As has, Wahl. (13/15)", "I got copies of these letters through public information requests, but names have been redacted. It’s impossible (for now) for me to ask these folks if they ever heard anything back. (11/15)", "When Sen. Katie Britt and Sen. Ted Cruz say IVF is safe and Dems are fear-mongering, she’s lying, and today the SBC told on her.", "If everyone started calling him “coach” right now, it would drive Tommy Tuberville insane.", "Tim Walz first year as a high school football coach and geography teacher", "You can always count on Alabama politicians to side with corruption. But good for the two who didn’t.", "Would you have voted to expel New York Republican George Santos from Congress? He was expelled on a 311-114 vote today. \n\nHere's more:https://al.com/news/2023/12/house-votes-to-expel-george-santos-6th-member-in-congressional-history-to-be-ousted.html?utm_campaign=aldotcom_sf&utm_medium=social&utm_source=twitter…", "Should we be concerned a US Senator is worried about the Labor Secretary succeeding the president?", "Acting Secretary of Labor Su repeatedly wouldn’t answer a simple ‘yes’ or ‘no’ question on whether she believes she is legitimately in the presidential line of succession.\n\nAny answer other than an unequivocal ‘no’ is antithetical to our system of governance and the bedrock", "I know it doesn’t fit conventional wisdom, but a Doug Jones/JD Vance debate is something I’d pay money to watch.", "Democratic Party Deep Cut but with attributes that would make him a super interesting veep nom, just saying. x.com/DougJones/stat…", "Britt’s bill would have defunded Medicaid in states that ban IVF. Medicaid pays for more than half of births in Alabama, which once effectively banned IVF.", "Katie Britt blasts Democrats for blocking her IVF bill then holding ‘show vote’ on their own legislation -http://al.comhttps://al.com/politics/2024/09/katie-britt-blasts-democrats-for-blocking-her-ivf-bill-then-holding-show-vote-on-their-own-legislation.html…"], "robreiner": ["Faith leaders tell us that Christian Nationalism is not only a threat to Democracy, but to Christianity itself. God and Country opens nationally in theaters today. If you’re in LA, join director Dan Partland at the Landmark theatre for a screening and Q&A.", "The danger of the hypocrisy of Christian Nationalism on display. A threat to Democracy and Christianity itself. Check out God & Country.https://godandcountrythemovie.com/watch/", "Once again the Convicted Felon breaks the law. He illegally goes to Arlington Cemetery to take a campaign photo op over the grave of a fallen soldier whose death he was responsible for. Just another day at the office for the most disgusting human being to ever seek the presidency", "250 years of Self Rule is at stake. If the Convicted Felon becomes President, the implementation of his Project 2025 will make this the last election you will be able to vote in. Choose wisely. Choose Harris/Walz,", "Once again the Convicted Felon breaks the law. He illegally goes to Arlington Cemetery to take a campaign photo op over the grave of a fallen soldier whose death he was responsible for. Just another day at the office for the most disgusting human being to ever seek the presidency", "Voters in Penn., Michigan, Wisconsin, Arizona, Nevada, Georgia, N. Carolina and every other state must be clear eyed when casting your vote. If the Convicted Felon wins, it will be the last vote you cast that will count. Kamala Harris will save our Democracy. Vote wisely.", "250 years of Self Rule is at stake. If the Convicted Felon becomes President, the implementation of his Project 2025 will make this the last election you will be able to vote in. Choose wisely. Choose Harris/Walz,", "For the past 8 yrs. we’ve been forced to having to think about the horror of a Pathologically Lying Malignant Narcissistic Misogynistic Racist Rapist Criminal running our country. The only way that National Nightmare ends is with a vote for Kamala Harris. LET’S END THIS TORTURE!"], "marceelias": ["Today was another day that proves that if you aren't paying attention to the courts, you aren't paying attention to democracy.   \n\nSign-up now to stay informed.http://democracydocket.com/me-newsletters/", "My team and I beat them more than 60 times in court in 2020. I promise the GOP that we are even more prepared in 2024.\n\nGOP lawsuits set the stage for state challenges if Trump loses the election", "Where are the so-called \"moderate\" Republicans denouncing this?  Where is the GOP legal establishment that is supposedly committed to the rule of law?\n\nThe truth--they don't exist. It's just proud MAGA and scared MAGA.", "Today was another day that proves that if you aren't paying attention to the courts, you aren't paying attention to democracy.   \n\nSign-up now to stay informed.http://democracydocket.com/me-newsletters/", "Where are the so-called \"moderate\" Republicans denouncing this?  Where is the GOP legal establishment that is supposedly committed to the rule of law?\n\nThe truth--they don't exist. It's just proud MAGA and scared MAGA."], "toddcstacy": ["Prattville vs Enterprise in the first round of the playoffs.#alpolitics", "Prattville vs Enterprise in the first round of the playoffs.#alpolitics"]}