{"ThomasEWoods": ["Randy, Florida doesn't care about your stupid ethnic hatreds. Try to remember you're representing a state in the United States, not a foreign government, OK?", "In Florida, if you support Muslim terror, you will be treated like a Muslim terrorist.  Next session, I will introduce legislation that adds any country that recognizes \"Palestine\" to Florida's list of scrutized countries, with severe limitations on entities from those countries", "If only we could be fed a diet of perfectly sane and accurate news and analysis from the American establishment, which has never wanted to deceive anyone", "The far right is spreading because people’s information diet is now jam-packed full of far-right garbage, much of it presented as authoritative, or funny, or savvy. That’s it. It’s not lived experiences or economic conditions or whatever other thing you think it is.", "This is a mental sickness that the rest of the world does not suffer from", "Irish Prime Minister Leo Varadkar says the government is \"very white\" and that it \"very much needs to change\" to be more \"diverse.\" Ireland is 94.1% white.", "You represent a FOREIGN COUNTRY. Normal people would have enough shame and decorum not to go around acting as if they're entitled to billions of dollars from us, and then denouncing the occasional dissident.", "Charges of dual loyalty are antisemitic and insult millions of patriotic Americans who stand by Israel. The U.S. is stronger when Israel is secure.\n\nNo misrepresentation, your vote says it all:\n\nNO to standing with Israel\nNO to condemning Hamas\nNO to helping Israel win this war x.com/RepThomasMassi…", "Their society is completely breaking down, and all the conservatives (or whatever we would call these people) at CPAC can talk about is China. This is not normal behavior.", "Tremendously courageous of Megyn Kelly to denounce Osama bin Laden. Raise your children to have that kind of courage!\n\nShe's upset that the young'uns don't appreciate \"America's role in the world.\" I think instead a lot of people hear that dumb phrase and think: STFU already", "To the parents of all of these losers suddenly persuaded by the deranged musings of the man who murdered 3k American innocents: you failed. You were likely boozing, marching for some L-wing cause and/or simply ignoring your kids. You failed to teach wrong from right, a proper", "This is a mental sickness that the rest of the world does not suffer from", "Irish Prime Minister Leo Varadkar says the government is \"very white\" and that it \"very much needs to change\" to be more \"diverse.\" Ireland is 94.1% white.", "I listened to the@jordanbpetersoninterview with \"Destiny,\" and a truly striking part of it is that the latter had not even been aware of the recent problem of excess deaths in countries around the world. He had never even heard of it.", "There isn't a foreign-policy fiasco that Boot didn't support. In supporting the Iraq war he cited the gruesome deaths of 200,000 Filipino civilians during the guerrilla war against the occupying US there as evidence that eventually Americans prevail against guerrillas(3/4)", "(2) Contrary to the modern Western view of the state that it must be considered one and indivisible, the colonists believed that a smaller unit may withdraw from a larger one. Today we are supposed to consider this unthinkable.(3/9)", "If this is your analysis, you are not entitled to an opinion on anything", "They were fakes all along.\n\n\"Oh, but our cause is just so that makes it okay\"\n\nThat's what they all say", "Congratulations to the GOP for sponsoring and passing the first censure resolution in the history of the House of Representatives to punish “hate speech”", "Well, I can teach the whole thing to you, from the ancient Near East through the present, and here are two advantages I have: (1) I'm not boring, and (2) I don't hate Western civilization (or you). My fancy degrees are a distant third.(6/8)", "I guarantee@RealCandaceOnever said JFK was assassinated by AIPAC; can you try to be a normal person for five second pls thx", "I pointed out the Jew hatred of@RealCandaceOmonths ago in articles and in person; and she just keeps demonstrating it more and more... now claiming that the US is held hostage by Israel and that JFK was assasinated by AIPAC?!?https://unitedwithisrael.org/candace-owens-says-us-is-being-held-hostage-by-israel/…", "Some critics of@ComicDaveSmithhave been claiming lately that he reached his current levels of exposure and accomplishment because he's Jewish, and that he (and we) are being delusional if we think he got to this point on merit.\n\nI've got a little something to say about this."], "RealSpikeCohen": ["UPDATE: the judge has dismissed@GADFCS's case against Casey and Bailey, and baby Ridge has been returned to them.\n\nRidge has been diagnosed with Dysfibrogenemia, a condition that explains the symptoms that DFCS insisted were caused by \"abuse\".\n\nAfter spending over $100k to", "Meet Casey and Bailey Collins, with their newborn son Ridge.\n\nThe Georgia state government is trying to steal Ridge from Casey and Bailey, because he was born with a health condition and@GADFCSrefuses to acknowledge it. They'd rather steal him and get federal money for it.\n\nAt", "Good, now my people can finally begin to heal from the modern-day holocaust that was KanyeWestexpressing his opinion.", "The man was walking down the street, neither harming nor threatening anyone.\n\nRename yourselves @KARENS_org and then delete your account.", "You're right.\n\nI guess we'll never know why 94% of mass shooters pick \"no gun\" zones as their targets.\n\nMust be a coincidence that they avoid shooting ranges. Which is weird, because guns make us all less safe, so you'd think they'd pick those places.\n\nOh well.", "Your source doesn't back up your claim. Your source only says that 9 out of 10 shootings happen at gun free zones, but not why the shooter chooses them. So again, please provide a source for your claim shooters choose gun-free zones just to be the only ones with guns.", "Here’s the link, but before you contact them, I know that you're probably as angry as I am about this. But you also know how government officials are. They'd love to play the victim here. “Why am I getting all these angry emails? I’m just doing my job. Why is everyone being so", "Another day, another innocent family being torn apart by government.@BrianKempGA@GovKemp, it is long past time to meet with us and these families.", "Damani and Shelby Whiting-Clarke live in Camden County, Georgia, and are parents to Anariah, a beautiful one-year-old girl.  \n\nDuring the 1st trimester of pregnancy, Shelby struggled with nausea and migraines and was prescribed medication and took OTC pain relievers as needed.", "The Chinese government murdered tens of millions of innocent Chinese people in the \"Great Leap Forward\".", "I would argue that the Chinese govt does indeed fight crime…as any good govt does…\n\nChinese insurance boss sentenced to life in jail for corruptionhttps://cnn.com/2023/09/13/business/china-life-wang-bin-sentence-intl-hnk/index.html…", "For those wondering, her murderer was found dead this morning.", "Since that tweet, millions of lives have been saved from violent crime thanks to defensive gun use.\n\nIf our refusal to disarm for the convenience of criminals and oppressive government officials is upsetting to the gun-grabbers, that is a tradeoff we are willing to live with.", "Since this tweet, over 260,000 lives have been lost to gun violence. If the \"spineless cowards\" won't do anything, we must bring back our collective outrage.  \nIt's an election year.  Now's the time to show candidates that gun violence is still a key issue for American voters.", "\"Oh huh huh I guess that means Israel too!\"\n\nYes. That means Israel too.\n\nYou must be new here. Welcome.", "The US government, who robs us to fund the Israeli military andHamas.", "Yes. \nWe should say no. \n\nWe should not send our loved ones and neighbors, who swear an oath to protect and defend the Constitution, to risk their lives in unconstitutional wars.\n\nIf you want to go over there, you're more than welcome to do so.https://x.com/ThatMattOBrien/ThatMattOBrien/status/1752116184684560621…"], "ComicDaveSmith": ["Obviously the story of the day is Biden’s monumentally disastrous performance, and it should be, but can we take a moment to appreciate how unbelievably awful and cowardly Trump’s take onIsraelwas?\n\nSeriously? Joe Biden, the life long Zionist who is currently funding the", "I have admired many aspects of RFK’s campaign. His opposition to Covid tyranny, vax mandates, the Ukraine war and the deep state have been nothing short of heroic. \n\nHowever, his support for the war inGazais disqualifying. We are THE antiwar, non-interventionist party and", "RFK Jr. on CNN: My campaign is “looking at” seeking the Libertarian Party nomination to get ballot access in all 50 states\n\n“We have a really good relationship with the Libertarian Party. I’m going to be speaking at the California LP Convention… and we’re talking about me", "Is there a dumber or more pathetically dishonest argument than@Rabbi_Barclay‘s here?\n\nWhat the hell does “self hating” even mean? I don’t hate myself. I’m awesome.\n\nJews are a people.Israelis a government. I can believe that whatIsraelis doing, and has done, to the", "If anyone spoke this way about Israeli children as they were being slaughtered what would your reaction be?", "This is appalling. Where are all of those anti woke free speech warrior Zionists now? They are probably all thrilled about this because they never really believed in free speech.@YouTubeshould correct this immediately. Silencing speech that you disagree with is despicable and", "There will be no show today, or at all this week. That’s because@YouTubehas issued me a strike and a one week suspension for my sit down with Kanye. They also removed the interview as “hate speech”, as it was mass reported by Zionists. \nTheir tactics never change.", "One of the quickest IQ tests on Twitter is when you make a logical analogy and someone responds with “those two situations aren’t exactly the same!”\n\nAlso, this guy just comparedHamasto the Nazis. See “DIFFERENT” is ok when you’re justifying the mass slaughter of babies.", "Police actions and war are DIFFERENT Dave. Can you come up with an analogy that’s actually conparable? x.com/ComicDaveSmith…", "Oh my god! Right after rigging the 2016 election, installing Trump, creating the Hunter Biden lap top, and blowing up the Nord stream pipeline, Putin orderedHamasto invade Israel. It all makes perfect sense!", "Consider the possibility that Putin conspired with Hamas to create the distraction.", "Seriously? No, not at all. Sabotaging the peace process and then propping up a terrorist organization so that you never have to resume that process is not “funding to become independent” it’s the opposite. And no, they do not share any similarities.", "What's the difference between a \"poison pill\" as described here and giving Gaza funding to become independent while expecting they will fail? Don't they look and sound the same?", "Correction: Smotrich said it to Knesset TV not Haaretz. I remember that wrong. Sorry.", "I don’t think there’s anything secret about it. Anyone can read “A clean break’ A major contributing factor to the neocons desire to remove Saddam was Israeli interests. And they were openly supportive of the war. Of course, that doesn’t absolve anyone.\n\nMy point is more that", "I cannot recommend this series strongly enough! I try to encourage people to listen to it every chance I get. If you want to understand the history of Zionism and the conflict between Palestine and Israel, this phenomenal podcast is THE place to go!", "Fear & Loathing in the New Jerusalem, the critically-acclaimed, 6-episode, 26-hour deep dive into the early history of Zionism and the Israeli-Palestinian conflict. Think you know the story? You might be surprised.https://martyrmade.com/featured-podcasts/fear-loathing-in-the-new-jerusalem…", "If anyone spoke this way about Israeli children as they were being slaughtered what would your reaction be?"], "FreemansMind96": ["IsraelFirst, America Last. That’s the campaign pledge. That’s what we’re getting.", "Big threats on my life by Iran. The entire U.S. Military is watching and waiting. Moves were already made by Iran that didn’t work out, but they will try again. Not a good situation for anyone. I am surrounded by more men, guns, and weapons than I have ever seen before. Thank you", "In a society with even a moderate level of self-respect, Graham would be behind bars", "It is blood libel and BS to say Israel is using starvation as a tool of war.", "I guess they’re angry with the Israeli apartheid spokeswoman because they’re also upset about the genocide taking place in PalestineGet a life, amirite?", "Everybody can see that you went to Time Square and the skate rink looking for Muslims to harass and provoke so you could stoke hate against antiwar protesters, Muslims, Arabs, and Palestinians. All while the foreign apartheid state you’re acting on behalf of commits this genocide", "I'm gonna go out on a limb and suggest the LP bump the other candidates and nominate@ComicDaveSmithfor this task, even if he's not running. \n\nDave Smith, Kennedy, and Trump is the debate we deserve.", "If this happens and the LP gets a candidate up there, it would really be something x.com/RobertKennedyJ…", "In a society with even a moderate level of self-respect, Graham would be behind bars", "It is blood libel and BS to say Israel is using starvation as a tool of war.", "Everybody can see that you went to Time Square and the skate rink looking for Muslims to harass and provoke so you could stoke hate against antiwar protesters, Muslims, Arabs, and Palestinians. All while the foreign apartheid state you’re acting on behalf of commits thisgenocide", "I guess they’re angry with the Israeli apartheid spokeswoman because they’re also upset about thegenocidetaking place in PalestineGet a life, amirite?", "I'm gonna go out on a limb and suggest the LP bump the other candidates and nominate@ComicDaveSmithfor this task, even if he's not running. \n\nDave Smith, Kennedy, and Trump is the debate we deserve.", "If this happens and the LP gets a candidate up there, it would really be something x.com/RobertKennedyJ…", "Israel First, America Last. That’s the campaign pledge. That’s what we’re getting.", "Big threats on my life by Iran. The entire U.S. Military is watching and waiting. Moves were already made by Iran that didn’t work out, but they will try again. Not a good situation for anyone. I am surrounded by more men, guns, and weapons than I have ever seen before. Thank you"], "HannahDCox": ["A lot of people are criticizing this for being controlling and paternalistic. It is.\n\nBut more importantly, it’s anti-capitalist and corrupt.\n\nIs he doing this to virtue signal to a base that hates all things left-wing coded (veganism being one of them)? Of course.\n\nBut he’s", "BREAKING: Governor Ron DeSantis signs legislation to ban lab-grown meat in Florida.", "Kyle deserved to be supported because he was innocent of the crimes he was charged with and acted in self-defense.\n\nNot because he held certain political beliefs. What an asshat.", "BYE foreverI can stomach a lot of things - but backstabbing millions who supported you at your lowest point. Then turning on Trump right after he got shot. Can't stomach it - won't put up with it - forgotten forever.", "Houses bigger than the average city apartment, with amenities that provide a higher quality of life than most kings enjoyed, all for only $1000/mo\n\n=\n\nlate capitalism hellhole \n\n(These are not serious people and their ideas will never help the poor)", "San Antonio would rather its residents live in this dystopian nightmare for $1000/month than build up.", "Not a SINGLE immigrant who has walked across our border has ever committed a SINGLE act of terrorism.\n\nThe vast majority of fentanyl is brought by US citizens.\n\nHow do these utter hacks have platforms?", "Tucker: \"I'm an American. Our country is being invaded right now. Over 100,000 Americans die every year of fentanyl. Those are real tragedies. I've never seen anything like the emotion from any commentator around those tragedies as I'm watching about a foreign tragedy.\"", "There hasn’t been an election since 2006 and half the population is under 19.\n\nBut never trust a neocon to come with facts.", "Anyone who claims to support the people of Gaza but not Hamas should remember that Gazans elected Hamas.", "Chevron Doctrine goes down and the Constitution is back! \n\nThis Supreme Court is honestly kind of iconic.", "It’s almost like we have a better understanding of what’s really going on than everyone else does…", "This is incredible.\n\nFrom her completely unprofessional meltdown, to her frantically trying to insert her own narrative instead of actually conduct an interview, to her desperate clutching at decades old singular events to try to prove her worldview is accurate in the face of", "Vivek handles Regime Media like a boss.\n\nNBC News reporter Dasha Burns has a meltdown as Vivek shreds her scripted reality.", "His insistence on raising his fist in this moment (watch the video) is phenomenal.\n\nThere has never been a more brilliant media mind in office.", "I’ll never understand how AOC became so prominent on the left, she’s not particularly smart - even for a congresswoman.\n\nAceasefire, and a peace deal, and an end to the open air prison conditions in Gaza are all great in theory - most people want that. The reality is none of", "Wow. \n\nReally excellent job by@abbydphillipputting AOC on the spot to ezplain her nonsensical and poorly thought out calls for a ceasefire.", "All the bleeding hearts ever accomplish is bloodshed.", "Seattle introduced a mandatory $5 fee on delivery apps to cover their driver’s living wage and sales were almost cut in half. Now the drivers can’t make rent."], "checkmatestate": ["Underrated meme.\n\nNuclear power is the solution to so many problems.", "Republicans: “Gun-free zones are stupid because murderers don’t follow laws.”\n\nAlso Republicans: “Gun control laws for illegals are smart because illegal immigrants will follow the law.”", "I see libertarians saying Trump’s conviction makes them more excited to vote for him.\n\nWhy?\n\nThis was clearly a politically motivated prosecution and a perversion of justice.\n\nSo what? Did it make Trump less authoritarian somehow?\n\nExplain yourselves.", "Republicans: “Gun-free zones are stupid because murderers don’t follow laws.”\n\nAlso Republicans: “Gun control laws for illegals are smart because illegal immigrants will follow the law.”"], "SabbySabs2": [], "MsLaToshaBrown": ["Thank you@POTUS. I’ll never forget your words & support when my son died. You will go down in history as one of the most effective Presidents in modern history. While I disagree with yourGazapolicy I can say you are one of the most empathetic and impactful leaders in the U.S.", "Great news! This is why we must always fight back.", "BREAKING: A state court in Pennsylvania ruled that excluding mail ballots from eligible voters based on a missing or incorrect handwritten date on the return envelope violates the state constitution. Thousands of voters were excluded in prior elections on the basis of this", "Harris-Walz campaign targets Georgia as election board is taken over by election deniers", "Supreme Court’s Blow to Right to Protest Is Another Attack on Black Political Power", "Kudos to Fani Willis! Her transparency and her posture was appropriate. She sent a message that she is NOT on trial ! While some sometimes criticize her “attitude” I think it was smart to delegitimize this attack. She gave some “Trump energy” back to them.", "Thank you@POTUS. I’ll never forget your words & support when my son died. You will go down in history as one of the most effective Presidents in modern history. While I disagree with your Gaza policy I can say you are one of the most empathetic and impactful leaders in the U.S.", "Rep. Sheila Jackson Lee Remembered: Opposed Iraq War, Advocated for Juneteenth, Reparations & Morehttps://democracynow.org/2024/7/22/latosha_brown_sheila_jackson_lee…via@democracynow", "That was fun. \n\nLet me now get back to my serious work. It’s really sad that we are in this position."], "RonFilipkowski": ["On US peace negotiations betweenIsraelandGaza: “The reporting is that former President Trump is on the phone with the PM ofIsraelurging him not to cut a deal right now because it’s believed that would help the Harris campaign.”", "InIsraelwith a bipartisan delegation of US Senators, Lindsey Graham goes off on a Newsmax reporter asking him to condemn Rashida Tlaib: “You’re not going to screw this up! Get this guy out of here!”", "The Republican Party wants to give Benjamin Netanyahu a blank check to do whatever he wants inGazawith no oversight or questions asked. The fact that most Democrats disagree with that does not make them anti-Semitic. A large percentage of Jewish Democrats disagree with that.", "Javanka on scene to negotiate an end to the conflict inIsrael.", "Kushner Kleanup Time: Please ignore my previous comments that waterfront property in Gaza “could be very valuable.” I’m all about the welfare of the Palestinian people. Thank you. End of statement.", "In a few more hours, MAGA can come out of their bunkers, take off the camo, put their AR-15s, flamethrowers and grenades up, because the global day of jihad will be over.", "This is a very thoughtful, measured and perfect statement to make. Delivering it in Israel makes it even more powerful. It is inconceivable that Trump could ever make such a statement.", "Biden: I caution this while you feel that rage, don't be consumed by it. After 9/11, we were enraged in the US. While we sought justice and got justice, we also made mistakes… The vast majority of Palestinians are not Hamas. Hamas does not represent the Palestinian people.", "The pro-Hamasaccount ‘Iran Observer’ is promoting Trump’s speech last night where he called Hezbollah “a very smart organization.” Story …", "MAGA, Trump & Vance have been telling us that the U.S. shouldn’t police the world and solve issues happening in other countries. But I guess this attack inside Israel is now America’s fault, and not BenjaminNetanyahu’s. I’m struggling to understand this ‘America First’ thing.", "With Israel hurting and reeling after a massive terrorist attack, Trump continues to trashNetanyahu, the Israeli government, and intelligence services today, doubling-down on his comments from last night.", "MAGA ‘Prophet’ Julie Green is holding a prayer session on her podcast where she says God will then stop theHamasrockets or cause them to misfire.", "Rudy says we should have sent Navy SEALs and Army Rangers into Gaza to rescue the hostages.", "This guy can barely talk today. Slurring his words again. He starved Hezbollah of their hummus now. This guy is rapidly deteriorating.", "George Santos went on Bannon’s show to vent about the incident yesterday: “This man tells me … what about the babies in Palestine? Are you kidding me! I don’t care!”"], "KyleKulinski": ["As soon asIsraelannounced a total siege ofGazashutting off power, food, fuel & water to 2.3m people they obviously gave up any pretense of caring about civilian casualties. But Biden still pretends they’re being super careful & moral. Pathetic lie", "Israelis not eradicating Hamas. They’re not bombing in some legal, humanitarian way. Every single idiot not supporting a ceasefire is by default saying I support more of this, because this is whatIsraelis actually doing in reality. Never ever let them forget that.", "Every single congressperson cheering Netanyahu is morally depraved. They're overlooking or outright supporting one of the great atrocities of our time. The history books will judge all of these cretins as akin to nazis. The Lancet has the Palestinian death rate at 186,000 so the", "Israelbombed THIRTY ONE hospitals with our money and weapons you disgusting pathetic fraud", "Russia’s missile strikes that today killed dozens of Ukrainian civilians and caused damage and casualties at Kyiv’s largest children’s hospital are a horrific reminder of Russia's brutality. It is critical that the world continues to stand with Ukraine at this important moment", "As soon as Israel announced a total siege of Gaza shutting off power, food, fuel & water to 2.3m people they obviously gave up any pretense of caring about civilian casualties. But Biden still pretends they’re being super careful & moral. Pathetic lie", "Haha wow epic burn of the pro-Palestine protesters@KamalaHarris! Anyway here’s a video of the IDF r*ping prisoners at a concentration camp", "Israel is not eradicatingHamas. They’re not bombing in some legal, humanitarian way. Every single idiot not supporting aceasefireis by default saying I support more of this, because this is what Israel is actually doing in reality. Never ever let them forget that.", "Every single congressperson cheeringNetanyahuis morally depraved. They're overlooking or outright supporting one of the great atrocities of our time. The history books will judge all of these cretins as akin to nazis. The Lancet has the Palestinian death rate at 186,000 so the"], "funder": ["Screaming \"fight! fight! fight\" like a bunch of rabid cult members is not toning rhetoric down. Just FYI.", "Jan 6 was an armed terrorist attack. Pipe bombs-guns-knives-Molotov cocktails-stun guns-machete-crossbow-hockey sticks-bats-flagpoles-pepper & bear spray-brass knuckles-scissors-screwdrivers-an axe. 117 arrested w/weapons or for assaulting police.\n\nProof:https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…", "Would be a shame if this trended.#JDScaredToDebate", "MAGA Violent Rhetoric Must End Right Now. Immediately. Agreed?\n\nRead this:", "“When 26 billionaires have as much wealth as half of humanity, that’s a crisis…It’s time, and it’s up to organized labor to lead that movement.”\n\nUAW President Shawn Fain is a hero.#SolidaritySeason", "Thank you@CNNfor updating the headline here so quickly. Moving on.", "Jan 6 was an armed terrorist attack. Pipe bombs-guns-knives-Molotov cocktails-stun guns-machete-crossbow-hockey sticks-bats-flagpoles-pepper & bear spray-brass knuckles-scissors-screwdrivers-an axe. 117 arrested w/weapons or for assaulting police.\n\nProof:https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…", "Jan 6 was a violent armed terrorist attack. Anyone saying anything else is lying.https://dworkinsubstack.com/p/jan-6-was-an-armed-terrorist-attack…#TrumpAttackedDemocracy"], "mmpadellan": ["While Democrats push for ceasefire and humanitarian aid inGaza, Republicans like Rep. Tim Walberg call for the slaughters of Palestinian children, \"It should be like Nagasaki and Hiroshima.\"\n\nThis should be a much bigger story.", "CEASEFIRE INGAZARIGHT FUCKING NOW, \nAND NETANYAHU RESIGN.\n\nEveryone should be calling for this.", "Good morning and Happy Sunday to everyone who would like to see this deal finalized to release dozens of women and children hostages from captivity inGaza, and increase humanitarian aid.\n\nI'd rather see every last one of the hostages freed but it's an important first step.", "Israelhas a right to exist.\nPalestine has a right to exist.\nA two-state solution is the ONLY way forward.\nBOTH need to be free of terrorist violence, retaliatory violence, settler violence, and occupier violence.\nFree of violence, PERIOD.\n\nBoth sides have suffered tremendous", "WOW.\n\nSenator Chuck Schumer called BenjaminNetanyahu\"an obstacle to peace,\" and \"too willing to tolerate the civilian toll in Gaza,\" and called for Israel to hold new elections to replace him.\n\nSenator Schumer is 100% right.", "While Democrats push forceasefireand humanitarian aid in Gaza, Republicans like Rep. Tim Walberg call for the slaughters of Palestinian children, \"It should be like Nagasaki and Hiroshima.\"\n\nThis should be a much bigger story.", "Israel has a right to exist.\nPalestine has a right to exist.\nA two-state solution is the ONLY way forward.\nBOTH need to be free of terrorist violence, retaliatory violence, settler violence, and occupier violence.\nFree of violence, PERIOD.\n\nBoth sides have suffered tremendous", "Let's talk about protest.\n\nThe very fabric of our nation's DNA is heavily steeped in the history of protest. I mean, the act of people crossing the Atlantic, leaving England, to form our own nation, was the BIGGEST protest of all.\n\nThe Boston Tea Party, throwing a bunch of boxes"], "krystalball": ["“With God's help, children inGazawill die thanks to us.”\n\nRight wing activists inIsraelare getting inside info from the military and organizing on WhatsApp to block and torch aid trucks and assault truck drivers. Police stand by and watch making no arrests.", "The targeting of Al Shifa hospital, is also likely to make it even more difficult (impossible?) to track Palestinian deaths and injuries as the office of the person who tracks and reports this data is located at the hospital.https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033…", "IDFSpokesman Daniel Hagari rebukes Netanyahu and admits defeating Hamas is impossible: \n\"Hamas is an idea, Hamas is a political party. It is rooted in the hearts of people – whoever thinks we can eliminate Hamas is mistaken.\"https://haaretz.com/israel-news/2024-06-19/ty-article-live/idf-ten-rockets-launched-from-lebanon-thousands-protest-govt-demand-gaza-deal/00000190-2e48-d39e-a999-7ece6e070000?liveBlogItemId=422718637&utm_source=site&utm_medium=button&utm_campaign=live_blog_item#422718637…", "The only time the word \"Israel\" is even mentioned is in a statement from theIDFdenying that they target civilians. Guess thatIDFcensor CNN chooses to operate under is doing their job.", "In this article about Israel's mass maiming of children in Gaza, CNN fails to mention a single time that Israel is responsible for the fact that 10 kids are losing limbs every day. Instead they talk about \"blast wounds\" with zero responsibility assigned.https://cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-01-07-24/h_f7780543e6318b588bbf03cad522cea0…", "“With God's help, children in Gaza will die thanks to us.”\n\nRight wing activists in Israel are getting inside info from the military and organizing on WhatsApp to block and torch aid trucks and assault truck drivers. Police stand by and watch making no arrests.", "The targeting of Al Shifa hospital, is also likely to make it even more difficult (impossible?) to track Palestinian deaths and injuries as the office of the person who tracks and reports this data is located at the hospital.https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033…", "IDF Spokesman Daniel Hagari rebukesNetanyahuand admits defeatingHamasis impossible: \n\"Hamasis an idea,Hamasis a political party. It is rooted in the hearts of people – whoever thinks we can eliminateHamasis mistaken.\"https://haaretz.com/israel-news/2024-06-19/ty-article-live/idf-ten-rockets-launched-from-lebanon-thousands-protest-govt-demand-gaza-deal/00000190-2e48-d39e-a999-7ece6e070000?liveBlogItemId=422718637&utm_source=site&utm_medium=button&utm_campaign=live_blog_item#422718637…"], "SteveSchmidtSES": ["More than 100 people participated in a flash hora in Toronto to celebrate Jewish culture in the midst of a significant rise in antisemitism in both Canada and worldwide. What a great show of solidarity.#stopantisemitism#neveragain", "\"Israelwill defend itself and America will stand firm by her side because the lessons of history are clear. Never again wasn't a slogan. It was the most essential moral lesson in human history.\"\n\nMore of my thoughts on what the American response should be to Hamas' attack:", "\"The corruption of one man inIsraelhas brought the whole world to the brink of war because his corruption and weakness stirred evil, and when evil sees weakness, it strikes.\"\n\nMore on how corrupt politicians like Netanyahu and Trump threaten the world:https://youtu.be/r4gBjhnOy_k", "\"IfIsraeldoesn't win this war and doesn't do what is necessary to defend civilization, then we will have another ISIS and they will come for us.\"\n\nMore on why we must stand shoulder to shoulder withIsraelto defeat the evil of Hamas:https://youtu.be/UTRHWAeRx9Q", "\"Israel will defend itself and America will stand firm by her side because the lessons of history are clear. Never again wasn't a slogan. It was the most essential moral lesson in human history.\"\n\nMore of my thoughts on what the American response should be toHamas' attack:", "\"If Israel doesn't win this war and doesn't do what is necessary to defend civilization, then we will have another ISIS and they will come for us.\"\n\nMore on why we must stand shoulder to shoulder with Israel to defeat the evil ofHamas:https://youtu.be/UTRHWAeRx9Q", "\"How could it conceivably be denied and forgotten within a single human lifetime when there are still nearly a quarter million survivors of the Nazi extermination camps?\"\n\nToday marks International Holocaust Remembrance Day and it's never been more important to remember:", "\"The antisemitism at hand is shocking, but not surprising. Like always, millions of Arabs and Palestinians are being stigmatized as terrorists because they simply live, breathe and suffer.\"\n\nThe chaos in the Middle East is terrifying, but we must be able to look past it and plan"], "robreiner": ["The danger of the hypocrisy of Christian Nationalism on display. A threat to Democracy and Christianity itself. Check out God & Country.https://godandcountrythemovie.com/watch/", "Faith leaders tell us that Christian Nationalism is not only a threat to Democracy, but to Christianity itself. God and Country opens nationally in theaters today. If you’re in LA, join director Dan Partland at the Landmark theatre for a screening and Q&A.", "It’s time to stop fucking around. If the Convicted Felon wins, we lose our Democracy. Joe Biden has effectively served US with honor, decency, and dignity. It’s time for Joe Biden to step down.", "Today marks the 60th anniversary of the horrific event that changed history. Soledad O’Brien and I host a 10 part podcast that takes a comprehensive look at what happened on that fateful day in Dallas. The third episode that details the forensics is available today.", "Today marks the 60th anniversary of the horrific event that changed history. Soledad O’Brien and I host a 10 part podcast that takes a comprehensive look at what happened on that fateful day in Dallas. The third episode that details the forensics is available today.", "It’s time to stop fucking around. If the Convicted Felon wins, we lose our Democracy. Joe Biden has effectively served US with honor, decency, and dignity. It’s time for Joe Biden to step down.", "Do we need any more evidence of Trump’s destruction of our Democracy than Supreme Court Justice Samuel Alito flying a Stop the Steal flag at his house. If we don’t destroy Trump this November, we will no longer be the Land of the Free.", "The United States Supreme Court has just let Trump get away with shooting someone on 5th Avenue."], "marceelias": [], "DavidAFrench": ["This, from@BenSasse, is powerful and true. If you're going to make an institutional statement, this is how it is done:", "All of this is unspeakably evil. There is no way to \"whatabout\" or justify this in any way. This is every bit as barbaric as Russian conduct in Ukraine.https://x.com/emilykschrader/emilykschrader/status/1710629885692014642…", "If you're not using the encrypted communication devices of a terrorist army, you're safe.", "What's going to explode next? The fridge? My phone? The scenes here in Lebanon are from a horror film - fleshless faces, eyes hanging out. With dozens dead and thousands hurt, none of us feel safe, writes HASSAN HARFOUSHhttps://trib.al/nN9Xg3T", "I’ve known Rich for a long time. There is no chance that this was anything but a tongue tied moment. That word is alien to his character. Rich is a good man.", "Having a hard time coming to any conclusion besides the obvious one about what Rich Lowry catches himself blurting out here", "This, from@BenSasse, is powerful and true. If you're going to make an institutional statement, this is how it is done:", "All of this is unspeakably evil. There is no way to \"whatabout\" or justify this in any way. This is every bit as barbaric as Russian conduct in Ukraine.https://x.com/emilykschrader/emilykschrader/status/1710629885692014642…", "TheHamasatrocities against civilians are pure evil. Israel should not permitHamasto exist in Gaza any longer. It is entirely justified in an overwhelming response. In fact, an overwhelming response is a moral and strategic necessity.", "This is incredible. A beautiful way to love your neighbor.", "A church in Tennessee recently paid off the medical debts of thousands of local people, adding up to $8 million.\n\nPartnering with@UndueMedDebt, The Altar Fellowship in Johnson City paid $50,000 to buy off debts owed by 3,921 households in 7 area counties.https://julieroys.com/tn-church-pays-off-medical-debt-for-thousands-to-bless-community/…"], "BillOReilly": ["Manhattan DA Alvin Bragg, aka Elliot Ness, has dropped almost all charges against the rioters at Columbia University. Surprised?  Best news analysis onhttp://BillOReilly.com.  Check us out!", "After all the blood and treasure the United States extended for Iraq, it is clear that the country is not our friend.", "After Walz dodges question about attacking Iran.  Vance does not point that out instead gives his resume.  Vance then pivots to praising Trump.  Finally, Vance says \"it's up toIsrael.\"#VPDebate#NoSpin", "Evil on display inGaza.  Please read the Message of the Day onhttp://BillOReilly.com.", "Kamala Harris \"remains committed\" to getting a deal done in Gaza.  Nice to know.", "Evil on display in Gaza.  Please read the Message of the Day onhttp://BillOReilly.com.", "After all the blood and treasure the United States extended for Iraq, it is clear that the country is not our friend.", "Politicians are now killing good people. Please read my brand new column onhttp://BillOReilly.com."], "jimmy_dore": ["This is AMAZING. Watch as Trumps says it is not the Palestinians blocking peace, but   Netanyahu that doesn't want to make a  deal  & is BLOCKING A PEACE DEAL. \n\nThis confirms everyone's suspicions that Netanyahu's plan all along was to wipe out the Palestinians, move those that", "The JIMMY DORE SHOW Is Live! NOW!Israel’s Brutal Response OnGaza!\nMORE Covid Censorship!\n\nFeaturing Dr. Peter McCullough@P_McCulloughMD,\nJackson Hinkle@jacksonhinklle, \nKurt Metzger@KurtMetzger& Stef Zamorano@MiserableLibEXCLUSIVELY ON RUMBLE!https://rumble.com/v3omif6-israels-brutal-response-on-gaza-more-covid-censorship-w-jackson-hinkle-and-.html…", "It’s been like this since 1948, but modern day Zionists are such depraved blood thirsty maniacs that even Americans are waking up:", "Here’s howIsraeldeals with Jews inIsraelprotesting against theIsraelgovernment.", "This is AMAZING. Watch as Trumps says it is not the Palestinians blocking peace, butNetanyahuthat doesn't want to make a  deal  & is BLOCKING A PEACE DEAL. \n\nThis confirms everyone's suspicions thatNetanyahu's plan all along was to wipe out the Palestinians, move those that", "The JIMMY DORE SHOW Is Live! NOW!HamasStages Brazen Attack Inside Israel!NetanyahuDeclares War on Gaza! \n\nFeaturing Norman Finkelstein@normfinkelstein,\nKurt Metzger@KurtMetzger& Mischa Paullin@mickmackpaullinNow streaming on Rumble, YouTube & Rokfin!", "The JIMMY DORE SHOW Is Live! NOW!\n\nIsrael’s Brutal Response On Gaza!\nMORE Covid Censorship!\n\nFeaturing Dr. Peter McCullough@P_McCulloughMD,\nJackson Hinkle@jacksonhinklle, \nKurt Metzger@KurtMetzger& Stef Zamorano@MiserableLibEXCLUSIVELY ON RUMBLE!https://rumble.com/v3omif6-israels-brutal-response-on-gaza-more-covid-censorship-w-jackson-hinkle-and-.html…", "It’s been like this since 1948, but modern day Zionists are such depraved blood thirsty maniacs that even Americans are waking up:"], "TheRickWilson": ["As always on this grim anniversary, I ask you keep Terry Hatton, Mychal Judge OFM, Barbara Olson, and the thousands lost on that terrible morning in your hearts today.", "If you think it's bad thing that the leaders of Hamas and Hezbollah got whacked yesterday, just unfollow.", "Yesterday, Ken Burns reminded me of FDR's prayer delivered to the nation by radio on the night of June 6, 1944:\n\n\"My fellow Americans: Last night, when I spoke with you about the fall of Rome, I knew at that moment that troops of the United States and our allies were crossing the", "I mean, I say this with some hindsight perspective...but De-Ba'athification ended up helping Iran, mostly.", "JD Vance: “We need a De-Ba’athification program in the U.S....We should seize the administrative state for our own purposes. We should fire all of the people...every single middle-level bureaucrat, every civil servant in the administrative state. Replace them with our people.”", "If you think it's bad thing that the leaders ofHamasand Hezbollah got whacked yesterday, just unfollow.", "I mean, I didn't want Raisi to die in a chopper crash.\n\nI wanted him torn limb from limb and dragged in the streets by pissed-off Iranian women.", "Yesterday, Ken Burns reminded me of FDR's prayer delivered to the nation by radio on the night of June 6, 1944:\n\n\"My fellow Americans: Last night, when I spoke with you about the fall of Rome, I knew at that moment that troops of the United States and our allies were crossing the", "My most interesting takeaway from theHamashospital own goal story just how rapidly an American anti-Israel horseshoe of far-right and far-left voices merged to echoHamaspropaganda."], "davidsirota": ["here are examples of my \"deafening silence\" onIsrael-Palestine", "Sirota has been one of the great disappointments. His silence has been deafening. x.com/acabthearab/st…", "I am disgusted — but not surprised — that the Joe Biden who used his Democratic Party position to help lead America into the Iraq War is doing nothing to halt a potential genocide inGaza. \n\nThe White House’s refusal to do anything is totally unacceptable.", "After its derailment, Norfolk Southern spent FIVE TIMES more on lobbying than it pledged to spend to protect drinking water inEastPalestine.\n\nThe company's 30% increase in lobbying coincides with Congress blocking bipartisan rail safety legislation.", "- Hamas terrorism is not justifiable/defensible.\n\n-Israel's violent response is not justifiable/defensible.\n\nMost people in the real world I've talked to acknowledge both truths.\n\nMany on this website will not acknowledge both truths for fear that it may prevent a Twitter dunk.", "Harris needs to break from Biden’s policy of unwavering, unconditional support ofNetanyahu’s government. A clear break needs to happen as soon as possible.", "-Hamasterrorism is not justifiable/defensible.\n\n- Israel's violent response is not justifiable/defensible.\n\nMost people in the real world I've talked to acknowledge both truths.\n\nMany on this website will not acknowledge both truths for fear that it may prevent a Twitter dunk.", "I'm making an effort to stay off this website for a bit & am rethinking my work in media. \n\nI'm pro-ceasefire, anti-occupation & anti-Netanyahu. \n\nBut the intense level of antisemitism piously wrapped in the banner of social justice has made me deeply depressed & demoralized.", "here are examples of my \"deafening silence\" on Israel-Palestine", "Sirota has been one of the great disappointments. His silence has been deafening. x.com/acabthearab/st…"], "gtconway3d": [".@DouglasKMurrayto@piersmorgan:\n\n“The thing that struck me, Piers, about seeing the 7th of October footage, was that even the Nazis were actually ashamed of what they did.  SS battalions who spent their days shooting Jews in the back of the head and pushing them into trenches,", "“‘If Hamas remains on the scene, Iran, the state of the ayatollahs, will be poised on Egypt’s borders, threatening security in Sinai and the entire Egyptian republic,” writes Algerian journalist and author Hamid Zinar.\n\n“‘This threat will intensify when Hamas declares that it is", "“There is no moral equivalency here. Let's be clear: Hamas shares no values with any Western academic institution. Hamas is an organization that has repeatedly pledged to annihilateIsraeland its people.\n\n“Its ideology is antithetical to the values of human life and the liberal", "This powerful letter is in my view right. I am very disappointed in the response of most leading American universities, including Harvard, to the events of October 7th. Any university with an anti-bullying policy needs to consider what has gone on.\n\nThe Association of University", "okay I’m going to go way out on a limb and say I agree with Rep. Tlaib here and not Rep. Walberghttp://detroitnews.com/story/news/politics/2024/03/30/michigan-congressman-tim-walberg-suggests-nuking-gaza-ending-humanitarian-aid-nagasaki-hiroshima/73156051007/…http://freep.com/story/news/politics/2024/03/30/video-suggests-walberg-called-for-nuclear-bombs-to-be-dropped-on-gaza/73155099007/…", ".@DouglasKMurrayto@piersmorgan:\n\n“The thing that struck me, Piers, about seeing the 7th of October footage, was that even the Nazis were actually ashamed of what they did.  SS battalions who spent their days shooting Jews in the back of the head and pushing them into trenches,", "“‘IfHamasremains on the scene, Iran, the state of the ayatollahs, will be poised on Egypt’s borders, threatening security in Sinai and the entire Egyptian republic,” writes Algerian journalist and author Hamid Zinar.\n\n“‘This threat will intensify whenHamasdeclares that it is", "“There is no moral equivalency here. Let's be clear:Hamasshares no values with any Western academic institution.Hamasis an organization that has repeatedly pledged to annihilate Israel and its people.\n\n“Its ideology is antithetical to the values of human life and the liberal", "This powerful letter is in my view right. I am very disappointed in the response of most leading American universities, including Harvard, to the events of October 7th. Any university with an anti-bullying policy needs to consider what has gone on.\n\nThe Association of University", "okay I’m going to go way out on a limb and say I agree with Rep. Tlaib here and not Rep. Walberghttp://detroitnews.com/story/news/politics/2024/03/30/michigan-congressman-tim-walberg-suggests-nuking-gaza-ending-humanitarian-aid-nagasaki-hiroshima/73156051007/…http://freep.com/story/news/politics/2024/03/30/video-suggests-walberg-called-for-nuclear-bombs-to-be-dropped-on-gaza/73155099007/…"], "spann": ["Today’s flyover at Jordan-Hare Stadium… video from Jenn Whitman", "Before Wrigley, before Fenway, there was Rickwood…", "I-65 southbound at Exit 275 in Morris. Approx 7:45 this morning… video from Travis Johnston", "Spotted at Gulf Breeze this afternoon… Video from Nicole Smith", "Lone cumulonimbus tower offshore at Gulf Shores this evening… photo from Julie Butler", "I guess this works… photo from Allen Waldrop in Heflin", "The sky over Hutchison Beach Elementary School at Panama City Beach yesterday… Photo from Kristy Stanley", "ON THIS DATE IN 1925: The great \"Tri-State Tornado\" occurred, the deadliest tornado in U.S. history. The storm claimed 695 lives (including 234 at Murphysboro, IL, and 148 at West Frankfort, IL), and caused seventeen million dollars property damage.\n\nIt cut a swath of destruction", "FRIGID: Here are some temperatures across Alabama just before sunrise...\n\nHaleyville 2\nMuscle Shoals 4\nGadsden 6\nTuckers Chapel 6\nHeflin 8\nMorris 8\nBessemer 8\nHuntsville 9\nChelsea 9\nTrussville 9\nAshville 9\nLeeds 9\nHueytown 9\nBirmingham 11\nAnniston 11\nAuburn 11\nTuscaloosa 13", "I-65 southbound at Exit 275 in Morris. Approx 7:45 this morning… video from Travis Johnston", "Just east of downtown Huntsville… video from David Little"], "Jaybefaunt": ["Are you willing to condemnIsraelfor the deaths of over 7000 innocent people, including hundreds  of babies?", "His death certificate was issued before his birth. His name is Uday Abu Mohsen, he is only one day old.#Gaza", "Everyone is talking about a ceasefire which is a step in the right direction... But what we NEED to talk about is a cease-OCCUPATION. Also...Israelnow owes reparations to Palestinians for their crimes against them. Palestine has the right to defend itself and RESIST occupation!", "\"The governments may be withIsraelbut the streets are with Palestine\"-@tex", "Just a small sampling of ppl flooding Washington DC in largest#FreePalestinemarch in U.S. history", "Supporting genocide & illegal occupation is not progressive no matter how you spin it. Attempting to 'Both sides' an extermination shows how you're either\n1. Ignorant of the history & nuance of what's going on\nor\n2. Purposefully trying to ride the fence to avoid angering Zionists", "ATTENTION: The narrative that we have seen fromis that crimes were committed byand it all started on October 7th. Here's proof that it started LONG before that day, narrated by BenjaminNetanyahuand Michael Rapaport. Share this with everyone willing to listen to see the", "Aceasefireis not good enough. \nThey deserve the right to return and reclaim their land.", "It has officially been 76 years that this illegal occupation happened. Today is the anniversary of the \"Nakba\". We cannot allow thisgenocideto continue to year 77.", "It’s been 76 years.  \nIt started on May the 15, 1948. \n\nNOT October 7th.", "This should be abundantly clear:HAMASWOULDN'T EXIST IF IT WEREN'T FOR THE ILLEGAL OCCUPATION OF PALESTINE\n\nIf you want to get rid ofHamas, end the ILLEGAL occupation."], "ProudSocialist": ["There is no “lesser evil.” The Democrats serve the same corrupt capitalist and imperialist system that Republicans do.\n\nDemocrats just do it with a smile and sedate you with platitudes as they are selling you out to their corporate donors and the war machine.\n\nReject the duopoly.", "Imagine how beautiful America could be if instead of spending trillions of dollars on wars abroad our government spent that money on our cities and communities.", "I’m so sick of this attack line that “Jill Stein only shows up at election time” when the truth is Jill has been showing up & fighting for the people since Occupy Wall Street. Democrats have no room to talk here when the only thing they ever show up for is their corporate donors.", "This is what real democracy looks like: \n\nVoters having actual choices on election day outside of the two corporate parties who serve the same corporate donors.", "The only appropriate response to a president who tells you the “economy is booming” as the poverty rate doubles & the masses struggle to afford basic needs like healthcare, housing & food.", "Kamala Harris being endorsed by 200 Bush/Cheney Republicans and calling for the U.S. to have the most “lethal fighting force in the world” shows she would be a president—not for the people—but for the military industrial complex, Wall Street, and the donor class.#VoteThirdParty", "Kicking 3rd parties off the ballotRefusing to pass popular policies like Medicare for AllFunding endless warsTaking corporate money then deceiving the public by insisting only Republicans do it\n\nDemocrats cannot save democracy when their own party is antidemocratic.", "All Democrats did is replace their older corporate puppet with a younger corporate puppet yet folks are really out here acting like change is coming. Did y’all learn nothing from the Obama years? Democrats use identity politics to conceal their corporatist and imperialist agenda."], "BernardKerik": ["Homes and businesses in France being are marked for Jewish occupants.\n\nWe are witnessing a modern day holocaust, and unfortunately, the enemies ofIsraeland Jews around the world, have saturated western communities, while our FBI and DOJ were targeting PTAs and churches.", "Iran, and the Iraqi militia Al-Hashd al-Shabbi proclaims they are with the Hamas terrorists!\n\nOur CIA/DOJ/FBI better be working overtime here at home because the chameleon radical Muslims already in the United States, are planning their next moves.", "#Hamasis the new#ISISand should be treated as such.", "I love how state leaders in the Arab region are calling for restraint, and refuse to denounce the initial attacks onIsrael.\n\nHaving lived and worked in theMiddleEastfor more than 10 years, I can promise you, if the tables were reversed, and it was them, there would be hell to", "Iran, and the Iraqi militia Al-Hashd al-Shabbi proclaims they are with theHamasterrorists!\n\nOur CIA/DOJ/FBI better be working overtime here at home because the chameleon radical Muslims already in the United States, are planning their next moves.", "They’re all martyrs until it’s time to die. Then they become gutless cowards, like Osama bin Laden and Saddam Hussein.\n\nDOD Secretary Lloyd Austin has revoked plea deals that would have spared these animals the death penalty for killing thousands of innocent Americans on 9/11.", "Fmr ICE Director Homan: Every Republican Congressman Not Voting to Impeach Mayorkas 'Can Go to Hell'", "#Hamasis the new#ISISand should be treated as such."], "jeff_poor": ["Checking the Georgia elder abuse statute, just in case any laws are being broken...", "FNC's Hume: \"The moderators were obnoxious\"", "Who do y'all think David Muir is voting for?", "So, I guess the question is who is really running the country?", "Checking the Georgia elder abuse statute, just in case any laws are being broken...", "So, I guess the question is who is really running the country?", "Who do y'all think David Muir is voting for?", "FNC's Hume: \"The moderators were obnoxious\""], "TomFitton": ["'You Are Quite Openly Jewish. This is a Pro-Palestinian March.'", "Black for Palestine: Meet Rashida Tlaib's favoriteIsrael-hating group with terror tieshttps://washingtonexaminer.com/news/house/palestine-rashida-tlaib-israel-terror-ties-hamas…", "UPDATE: Death Toll from Hamas Terrorist Attack Rises to Over 700 – At Least 260 Young People Were Slaughtered at Dance Party in Deserthttps://thegatewaypundit.com/2023/10/update-death-toll-hamas-terrorist-attack-rises-700/…#gatewaypunditvia@gatewaypundit", "Hamas Terrorist Leaders: Our Goal Is Establishment Of Global Islamic Caliphate, Not Just Liberation Of Palestine#MEMRI", "Six murdered hostages were found inRafah, the Gaza city Biden and Harris worked so hard to prevent Israel from entering.https://wsj.com/opinion/hamas-executes-six-hostages-including-an-american-gaza-war-rafah-4907e7c6?st=d8uwfx5ni7jghi6…via@WSJopinion", "HamasTerrorist Leaders: Our Goal Is Establishment Of Global Islamic Caliphate, Not Just Liberation Of Palestine#MEMRI", "UPDATE: Death Toll fromHamasTerrorist Attack Rises to Over 700 – At Least 260 Young People Were Slaughtered at Dance Party in Deserthttps://thegatewaypundit.com/2023/10/update-death-toll-hamas-terrorist-attack-rises-700/…#gatewaypunditvia@gatewaypundit", "America’s Invisible Hostage Crisis\n\"On Oct. 7, 2023,Hamaskilled more than 30 American citizens and took as many as a dozen Americans hostage. Of those who were taken, at least two have been murdered. Five, we pray, are still alive. Do you know any of their names? Have you seen"], "brad_polumbo": ["“You’re not the next MLK Jr. or Rosa Parks. You’re an unemployed they/them who didn’t know the difference betweenGazaand theWestBankuntil a few months ago.”\n\nMy message to the lunatics on#freepalestineTikTok who keep blocking traffic.", "Anti-Semites are so strange.\n\nLike, the Jews aren't the reason this wasn't you.\n\nYou are the reason this wasn't you.", "51% of 18 to 24-year-olds say Hamas's slaughter of Israeli citizens was justified. \n\nYet 62% also say it was a genocide.\n\nSo, a sizeable number of young Americans think genocide against Israelis is justified.\n\nWhat the actual fuck?", "They are suggesting she is a Hezbollah supporter because of her point of view and advocacy on related issues. How is that racist?", "Shame on the@detroitnewsfor allowing this racist, xenophobic vile cartoon on their platform.\n\nPay attention to who condemns this. And then recognize the different standard Arab and Muslim politicians are held by.", "“You’re not the next MLK Jr. or Rosa Parks. You’re an unemployed they/them who didn’t know the difference between Gaza and the West Bank until a few months ago.”\n\nMy message to the lunatics on#freepalestineTikTok who keep blocking traffic.", "You're literally more pressed about language than the dead American woman.", "51% of 18 to 24-year-olds sayHamas's slaughter of Israeli citizens was justified. \n\nYet 62% also say it was agenocide.\n\nSo, a sizeable number of young Americans thinkgenocideagainst Israelis is justified.\n\nWhat the actual fuck?", "Holy shit this is INSANE. \n\n\"I'm not going to disrespect any of these people\" TALKING ABOUT A MURDERER!!", "BREAKING: Biden apologizes for calling Laken Riley's kiIIer an \"illegal\"\n\n\"I'm not gonna treat any of these people with disrespect. They built this country.\""], "IngrahamAngle": ["Adam Guillette: Anti-Israelmobs on campuses are 'Ivy league radicals and fools'", "Anti-Israelprotesters descend upon Met Gala", "Sen. Hawley mobbed by anti-Israelagitators in Senate hallway.", "Netanyahu foreign policy adviser: Hamas will be dismantled.", "Israel is willing to do what we would do: John Ratcliffe", "Mike Pompeo:Hamaswill be the recipient of this aid", "Hamasattack survivor: I feel more protected in Israel than I feel here.", "Netanyahuforeign policy adviser:Hamaswill be dismantled."], "seanhannity": ["Hamas Official Ghazi Hamad: We Will Repeat the October 7 Attack Time and Again UntilIsraelIs Annihilated", "'DECEPTION':IDFSays Ceasefire Deal Not Approved byIsrael, is Softened Deal; Report", "Israeli officials: Hamas reported cease-fire deal is a ‘deception’", "'We're not going to take it anymore': Pro-Israelprotesters gather outside Columbia", "HamasLeader IsmailHaniyehKilled After Residence Hit in Tehran", "HamasOfficial Ghazi Hamad: We Will Repeat the October 7 Attack Time and Again Until Israel Is Annihilated", "EVIL DEAD:HamasLeaderHaniyehAssassinated in Tehran, Iran Vows Revenge", "'DECEPTION': IDF SaysCeasefireDeal Not Approved by Israel, is Softened Deal; Report"], "charliekirk11": ["Hundreds of Israelis dead and injured. 50+ Israeli hostages. Hamas militias killing innocents in their homes, 2,200 missiles launched in an unprovoked, surprise attack...\n\nMSNBC: \"I couldn’t think of a better gift for Benjamin Netanyahu right now than this kind of incursion...\"", "BREAKING: Lebanon’s state-run National News Agency claims an Israeli drone strike in Southern Lebanon has killed top Hamas official, Saleh Arouri.\n\nEven before Oct 7, Netanyahu had threatened to kill Arouri who was one of the founders of Hamas’ military wing and led the group’s", "70 percent of Gazans say that peaceful coexistence withIsraelis unacceptable; only genocide and destruction ofIsrael, “from the river to the sea,” is enough.\n\nThis, more than anything else, is why the war inGazahappened.", "BREAKING: According to AP, Hamas has told Qatar and Egyptian mediators that it will accept terms of a ceasefire and prisoner swap withIsrael. This comes asIsraelwas preparing a ground siege on Rafah, the last Hamas stronghold inGaza.", "YayhaSinwar, the head ofHamasin Gaza, took time out of an interview to pander to the left over “the racist murder of George Floyd.”\n\nA week ago I was ridiculed for linking the poisonous ideologies ofHamasand BLM. But at heart they are the same hateful ideologies. Both rely", "Hundreds of Israelis dead and injured. 50+ Israeli hostages.Hamasmilitias killing innocents in their homes, 2,200 missiles launched in an unprovoked, surprise attack...\n\nMSNBC: \"I couldn’t think of a better gift for BenjaminNetanyahuright now than this kind of incursion...\"", "BREAKING: According to AP,Hamashas told Qatar and Egyptian mediators that it will accept terms of aceasefireand prisoner swap with Israel. This comes as Israel was preparing a ground siege onRafah, the lastHamasstronghold in Gaza.", "Son ofHamasleader, Mosab Hassan Yousef, denouncedHamasand converted to Christianity after witnessing their savagery: \n\n\"They don't care for the Palestinian people. They don't regard human life. I saw their brutality firsthand....If they succeed in destroying Israel and"], "TuckerCarlson": ["Ep. 74  The Ukrainian government canceled elections and killed an American journalist. Congress is about send them another $60 billion. J.D. Vance is trying to stop it.", "Ladies and gentlemen, Patrick Bet-David.\n\n(0:28) Who is Going to Win The Election and Why?\n(25:25) Reaction to the DOJ using “Deadly Force” Language in Mar-a-Lago Raid\n(30:28) Biden's State of the Union Speech\n(58:48) Analysis on our Media Landscape\n(1:08:25) Is Foreign Policy", "Matt Taibbi, one of the last working journalists in thewest.\n\n(03:22) The Rise and Fall of Journalism\n(14:12) Putin's Rise to Power\n(25:22) Western Media's Ties to Government\n(36:40) Post-9/11 America\n(51:04) The Twitter Files\n(1:02:06) Donald Trump and Russiagate\n(1:26:16)", "Ep. 91  How does the government ofIsraeltreat Christians? In theWest, Christian leaders don’t seem interested in knowing the answer. They should be. Here’s the view of a pastor from Bethlehem.", "Ep. 74  The Ukrainian government canceled elections and killed an American journalist. Congress is about send them another $60 billion. J.D. Vance is trying to stop it.", "Ladies and gentlemen, Patrick Bet-David.\n\n(0:28) Who is Going to Win The Election and Why?\n(25:25) Reaction to the DOJ using “Deadly Force” Language in Mar-a-Lago Raid\n(30:28) Biden's State of the Union Speech\n(58:48) Analysis on our Media Landscape\n(1:08:25) Is Foreign Policy", "Jeffrey Sachs with probably the smartest and most accurate assessment of the Ukraine war, and American foreign policy more broadly, ever caught on tape.\n\n(20:17) Why did America push for Ukraine to Join NATO?\n(58:34) What is a Neocon?\n(1:25:28) Regime Change Never Works\n(1:36:27)", "Ep. 69  War with Iran? Yes. We’re already in it. Joe Kent did 11 combat tours in the U.S. Army. His wife Shannon was killed serving in Syria. Here’s his informed view of what that war will mean."], "AnnCoulter": ["I don't like Ramaswamy's conspiracy theories, but none of them hold a candle to Nikki Haley's claim that Hamas attackedIsraelon Oct 7 because it's Putin's birthday.#WarmongerMadness", "More for the 'Diversity is our greatest strength!' file:\n\nBREAKING: 33-year-old Algerian arrested for arson attack on a synagogue in France.", "Nikki Haley explains the Hamas attack onIsrael: \n\n“I told you about that brutality on Oct. 7 inIsrael. Right? Oct. 7 is Putin’s birthday.”\n\nThis is the nitwit the donors are trying to foist on us.", "<<Contrast [Douglas] Murray’s (correct) claim that in all the footage of the Oct. 7 massacres, the one thing you don’t see is a single Pali saying, “Wait, hold up, we’re going too far; we’re soldiers, not rapists,” to Himmler bitching to his SS officers at Posen that average", "I don't like Ramaswamy's conspiracy theories, but none of them hold a candle to Nikki Haley's claim thatHamasattacked Israel on Oct 7 because it's Putin's birthday.#WarmongerMadness", "NEW COLUMN!  The Fall of Rome, Updated\n\nAmericans killed by Islamic terrorists in Islamic lands so far this year: 3.\n\nAmericans killed by third-worlders who entered our country illegally so far this year: 150.", "Well, I know how to recognize a future Palestinian state. It'll be the one lobbing rockets across the border at Israeli civilians.", "Nikki Haley explains theHamasattack on Israel: \n\n“I told you about that brutality on Oct. 7 in Israel. Right? Oct. 7 is Putin’s birthday.”\n\nThis is the nitwit the donors are trying to foist on us."], "EricTrump": ["What a video! Minnesota citizens absolutely DESTR0Y Tim Walz", "To help the victims of this horrible tragedy:", "No honest Judge would allow this sham to continue - this case should be dismissed.", "Rose’ 5K run/walk at@TrumpWinerybenefiting@StJudethis Saturday, April 27th! Sign up online!#Charlottesville#Virginia", "What a video! Minnesota citizens absolutely DESTR0Y Tim Walz", "To help the victims of this horrible tragedy:", "No honest Judge would allow this sham to continue - this case should be dismissed.", "It is hard to believe this is being allowed in the United States… she has been waiting for this moment her entire life."], "LaraLeaTrump": [".@DailyCaller's@MaryRooke_and the@FDRLST's@BriannaLyman2join me to discuss Joe and Kamala failing hostages inIsrael, Kamala ducking the media, and MUCH MORE#TheRightView", "Wow, they aren’t even trying to hide their blatant interference — appreciate you flagging,@ScottPresler—@goplegal is on it and formally requesting the “system maintenance” is moved to a different time.", "Heartbroken for my home state. Sending love, prayers and (soon) more supplies. Link in bio if you want to donate.", "We can never repay them for their bravery, selflessness and sacrifice, but we can continue to fight for the same thing the men on the beaches of Normandy did 80 years ago today: freedom. May we live our lives in a way that makes them proud. God bless them all and, thank you.", ".@DailyCaller's@MaryRooke_and the@FDRLST's@BriannaLyman2join me to discuss Joe and Kamala failing hostages in Israel, Kamala ducking the media, and MUCH MORE#TheRightView", "Just when you think tonight can’t get any cooler, you stumble across Emir.", "We are so lucky to have the absolute greatest dads/grandpas in the WORLD!!!!!", "Love finding these!! 5 years ago today with Ivanama"], "PatTheSocialist": ["Human Rights watch has determined thatIsraelis intentionally destroying the food supply ofGaza. Add it to the list of war crimes.\n\nThis is genocide.", "The US must immediately pull all funding ofIsraeland demand a ceasfire", "Read below the ICJ conclusions:", "The Israeli government, and anyone supporting or enabling them, are clearly the bad guys. War crime after war crime.", "Al-Rantisi children’s hospital, which is now on fire, is the 7th hospital bombed by the israelis in a night; the 8th in 3 days | via@gazanotice", "No point in engaging in discussion with pro-Israelaccounts.\n\n7 months in if they don't get it, they're racist trash, paid propaganda, or too far gone.\n\nThe world knows it's genocide.\n\nWe don't need to change public opinion.\n\nLet's spend our time fighting those with power.", "Human Rights watch has determined that Israel is intentionally destroying the food supply of Gaza. Add it to the list of war crimes.\n\nThis isgenocide.", "Over 30,000 people dead\n\nOver 12,000 children killed\n\n115 journalists murdered\n\nAlmost 2 million displaced\n\nOver 200 healthcare facilities destroyed\n\nThis isgenocideJoe Biden and the Democratic Party own this", "Kamala just said she'll keep supplying weapons to Israel, so maybe think more critically than trusting her call for a ceasfire. You know who else is calling for aceasefire? Biden.", "It's notgenocide, or ethnic cleansing, it's just \"thinning out\" Gazans.\n\nThis is what Biden supports", "Netanyahu is shopping around a proposal to US Congressional leaders to “thin out” Gaza’s population and expel the surviving residents into neighboring countries.https://bit.ly/3Neo0xP"], "TristanSnell": ["Donald Trump held a SUMMIT with Israeli Prime Minister Netanyahu.\n\nAs a private citizen. At Mar-a-Lago. \n\nThe Logan Act is a federal law forbidding private citizens from negotiating with foreign governments.\n\nTRUMP IS BREAKING THE LAW — YET AGAIN", "Uvalde: AR-15\nBuffalo: AR-15\nBoulder: AR-15\nOrlando: AR-15\nParkland: AR-15\nNashville: AR-15\nLas Vegas: AR-15\nSandy Hook: AR-15\nSan Bernardino: AR-15\nMidland/Odessa: AR-15\nColorado Springs: AR-15\nPoway Synagogue: AR-15\nTree of Life Synagogue: AR-15 \n\nLewiston: AR-15", "Why is there not a cease fire in theIsrael-Palestine war?\n\nThe #1 reason right now is because DONALD TRUMP has illegally lobbied Israeli prime minister Benjamin Netanyahu to refuse a cease fire because it would help Harris -- in blatant violation of the Logan Act.\n\nTHAT'S why.", "Donald Trump should be INDICTED — AGAIN.\n\nPBS now reports Trump told Israeli Prime Minster Netanyahu to NOT agree to a cease fire because it would help Kamala Harris.\n\nThis is a violation of the Logan Act and should be investigated and prosecuted to the fullest extent of the law.", "Uvalde: AR-15\nBuffalo: AR-15\nBoulder: AR-15\nOrlando: AR-15\nParkland: AR-15\nNashville: AR-15\nLas Vegas: AR-15\nSandy Hook: AR-15\nSan Bernardino: AR-15\nMidland/Odessa: AR-15\nColorado Springs: AR-15\nPoway Synagogue: AR-15\nTree of Life Synagogue: AR-15 \n\nLewiston: AR-15", "Donald Trump's crime spree continues:\n\n- Logan Act - pressuringNetanyahuto kill cease fire\n- RFK Jr. - promising job in exchange for endorsement\n- Logan Act - discussions with Putin on invading Ukraine\n- Holding campaign event at Arlington National Cemetery", "BREAKING -- Joe Biden announcesCEASEFIREframework, with release of hostages, and with both Israel andHamasin agreement.\n\nCulmination of months of work by Biden and the State Department.\n\nBut sure, go ahead and tell me how Biden has declined and should quit the race.", "BREAKING -- US and Israel will provide Patriot air defense systems to Ukraine, per a new deal that is near completion\n\nThis would TRIPLE the Ukrainian air defense and allow Ukraine to fully protect its major cities and strategic sites from Russian missiles\n\nMASSIVE loss for Putin"], "NancyAFrench": ["The Clarks posted a photo of@KanakukCEO Joe White with their daughter.  White is the main person at the helm as hundreds of children were assaulted at the camp. /9", "In the book, Gilpin mentions some of her friends died via suicide because of the abuse there.  Gilpin was at Carlbrook the same time as my neighbor’s son, Joe Benton Burns (who attended 2001-04 approximately). /3", "After a pastor posted a photo with the@KanakukCEO and a camp director, victims and their family members urged people to hold the camp accountable. \n\nRead some of their anguished posts below. /2", "Anyway, Clark Hunt has promoted  the camp – before and after it was revealed@Kanakuk's been a hotbed of rape. He spoke at a fundraiser breakfast in 2021 for an affiliated ministry after the articles showing Kanakuk leadership's complicity in the abuse that happened there.  /8", "The Clarks posted a photo of@KanakukCEO Joe White with their daughter.  White is the main person at the helm as hundreds of children were assaulted at the camp. /9", "Campers could not communicate with parents what was happening at the camp - except through hand-writtten letters.  Little did parents know Kanakuk the counselors were instructed to monitor to prevent criticism (even suicide threats) from reaching home. /6", "After a pastor posted a photo with the@KanakukCEO and a camp director, victims and their family members urged people to hold the camp accountable. \n\nRead some of their anguished posts below. /2", "Anyway, Clark Hunt has promoted  the camp – before and after it was revealed@Kanakuk's been a hotbed of rape. He spoke at a fundraiser breakfast in 2021 for an affiliated ministry after the articles showing Kanakuk leadership's complicity in the abuse that happened there.  /8"], "donwinslow": ["Imagine calling someone who spread this evil lie for YEARS a hero.\n\nThis is not a hero.\n\nNot of one thing.\n\nNot of anything.", "Facts matter. \n\nSo ask yourself why every news program is not correcting this gross lie.", "He HAS to respond to these vile attacks.\n\nHe HAS to respond and stop just looking down and writing.", "I'm retiring.\n\nI wrote the first words of this book 30 years ago.\n\nAnd now#CityInRuinsis on sale in 24 hours.\n\nI hope you will consider ordering my final novel.\n\nClick here to order:http://bit.ly/42T9MZ8", "This@NikkiHaley\"civil war\" interview is from 2010!\n\nAsk yourself why not one single journalist asked Nikki Haley about this in 2023.\n\nNot one.", "Listen to this and tell me how this horrific person is a hero. Just listen to her own words and try to defend this. I want to hear the same Democrats who called her a HERO defend this vile garbage.\n\nI'll wait.\n\nAnd don't give me this BS about well I agreed with her on 1 issue.", "Imagine calling someone who spread this evil lie for YEARS a hero.\n\nThis is not a hero.\n\nNot of one thing.\n\nNot of anything.", "You have the power to send a very powerful message and it will take you less than 3 minutes to do it.\n\nYou have the power to say what happened was wrong, was horribly misguided and was terrible for this country and represented a boost to Donald Trump's 2024 dictatorship plans."], "KyleClark": ["COMMENTARY: 40 years after Neo-Nazis murdered legendary radio host Alan Berg, the hate they harbored persists", "COMMENTARY: Denver Mayor Mike Johnston's administration forcing vulnerable people out of long-term motels to make room for migrants is not compassionate and it's not competent.#copolitics", "GOP State Rep Scott Bottoms, who said Jewish hostages held by Hamas needed to find Jesus, now says there's no such thing as the Palestinian people, they're all just terrorists.#coleg#copolitics", "Oltmann, who calls for the executions of his political opponents, hinted at coming violence in November. “November is going to be the start of something very very very very very very kinetic. Now do I want that to happen? No. But I don’t want my children to be groomed either.”", "COMMENTARY: 40 years after Neo-Nazis murdered legendary radio host Alan Berg, the hate they harbored persists", "NEW: The Salvation Army is finally taking questions after seven deaths at its homeless hotel shelter near Quebec and I-70 in Denver. The Salvation Army says it didn't spend $800,000 tax dollars allocated for security because it was \"researching\" options.", "COMMENTARY: The rhetoric stoking political violence reminds me of the 1950s roadside safety signs reading \"Drive Carefully. The Life You Save May Be Your Own.\" We're on this road together - where self-interest and care for others can be one and the same.", "GOP State Rep Scott Bottoms, who said Jewish hostages held byHamasneeded to find Jesus, now says there's no such thing as the Palestinian people, they're all just terrorists.#coleg#copolitics"], "BobMurphyEcon": ["It's exchanges like this (of which I've seen many) that make@ComicDaveSmithcall the pro-Israelconservatives the \"woke Right.\" People will object to the killing of civilians, and the pro-Israelpeople will say \"But terrorists are bad!\" It would be like opposing coercive", "I bet after today's ruling Obama is relieved that he won't do any time for blowing up a US citizen with a killer robot without a trial", "I am making a simple observation here. I'm not \"picking sides\" except for the side of \"Killing innocent people is always wrong.\"\n\nThe people responsible for the attack onIsrael*want* the response to be \"over the top.\" They want the propaganda to then turn public opinion and", "I get it; it's funny. But not only did God not kill kids Cain hid behind, and not only did God not even kill Cain, but He actually placed a mark on him so that nobody ELSE would kill him.\n\nI.e. God agreed to a ceasefire after this crime.", "Cain Calls For Ceasefire After Killing Abelhttps://buff.ly/3SH1nFN", "I bet after today's ruling Obama is relieved that he won't do any time for blowing up a US citizen with a killer robot without a trial", "I am making a simple observation here. I'm not \"picking sides\" except for the side of \"Killing innocent people is always wrong.\"\n\nThe people responsible for the attack on Israel *want* the response to be \"over the top.\" They want the propaganda to then turn public opinion and", "I get it; it's funny. But not only did God not kill kids Cain hid behind, and not only did God not even kill Cain, but He actually placed a mark on him so that nobody ELSE would kill him.\n\nI.e. God agreed to aceasefireafter this crime.", "Cain Calls For Ceasefire After Killing Abelhttps://buff.ly/3SH1nFN", "I'm not saying this to be a smarta$$, I'm pleading with people to remember their own value system right now in this awful moment.\n\nMany on this site are pro-life, even in cases of rape and incest. \"I know a crime has occurred, but I'm sorry you can't take it out on an unborn"], "bshelburne": ["Demonstrators in downtown Birmingham opposed to Alabama’s execution of#KennethSmithby nitrogen hypoxia.#deathpenalty", "Wanting people in prison to be seen as human and treated humanely is not woke. If you think that, read the Bible.", "There are political photo ops & then there’s this. Next level hypocrisy. Thankfully the comments on FB didn’t disappoint.", "The state paid this earwitness $5000 for her testimony, but didn't disclose the payment to Toforest or his lawyers for 17 years. The jury that convicted him was kept in the dark about the reward. So how is he still on death row? To learn more:http://toforestjohnson.com3/3", "We need something hopeful & here is Michael Schumacher, once condemned to life without parole in Alabama. He is now free and just became a grandfather. This is Mike with his grandson, Akari. Although in short supply, redemption, hope & love are alive. Thank you@Shoe142195x!  1/3", "Talked to a mom about her son's time in Alabama prisons. He went in at 18, was raped, beaten & extorted. He came out with severe PTSD, anxiety, nightmares. He died last year at 27. These prisons do nothing but traumatize & brutalize. Devil's islands. No accountability. 1/2", "I JUST FOUND OUT A GOT AN AMAZING REPORTING GRANT!!!!!", "Something amazing happened in Alabama. An 85 y/o man was released from prison thanks to a mighty fight led by Lauren Faraino @thewoodsfdn & Sue Bell Cobb@RedemptionEarn. Mr. Robert George will now spend his remaining time on earth with his family instead of dying in prison. 1/3"], "PatrickSvitek": ["3rd Court of Appeals rejects Paxton’s latest attempt to shut down whistleblower lawsuit in Travis County#txlege", "Paxton whistleblower attorney Tom Nesbitt says lawsuit isn’t over:", "Statement from another Paxton whistleblower attorney, TJ Turner:", ".@DadePhelangoes direct-to-camera about@KenPaxtonTXin a new reelection campaign ad, running on TV and digital.  \n\n\"If Paxton will break an oath to his wife and God, why would he tell Trump — or you — the truth?\"#HD21#txlege", "Paxton whistleblower attorney Tom Nesbitt says lawsuit isn’t over:", "Statement from another Paxton whistleblower attorney, TJ Turner:", "Phil Murphy on Menendez: “If he refuses to vacate his office, I call on the U.S. Senate to vote to expel him.”", "Retiring Republican state Sen.@DrewSpringer, who voted to acquit@KenPaxtonTXin impeachment trial, asks@DanPatrickand colleagues if there’s a way to “reopen” the proceedings after Paxton decided to not contest whistleblower lawsuit#txlege"], "evanasmith": ["every year at this time i’m like, yeah we actually did that#txlege", "I was rattled this week when I read the local news crisis is accelerating. How much worse can it get? Well, by next year — a year earlier than predicted — we'll hit a gruesome benchmark: 1/3 of U.S. newspapers shut down since 2005https://axios.com/2023/11/16/newspapers-decline-hedge-funds-research…#txlege", "Every year on this day — the anniversary of Charles Whitman’s\nshooting spree at the Unversity of Texas — I post a link to the best story I ever edited:@pamelacolloff’s “96 Minutes.” It’s still the best read, and Pam is still and always thehttps://texasmonthly.com/true-crime/96-minutes/…#txlege", "This is why we need a robust independent press that holds power to account. Big thanks to ⁦@TexasTribune⁩ ⁦@propublica⁩ and all the other news orgs who wouldn’t give up#txlege", "every year at this time i’m like, yeah we actually did that#txlege", "I was rattled this week when I read the local news crisis is accelerating. How much worse can it get? Well, by next year — a year earlier than predicted — we'll hit a gruesome benchmark: 1/3 of U.S. newspapers shut down since 2005https://axios.com/2023/11/16/newspapers-decline-hedge-funds-research…#txlege", "Every year on this day — the anniversary of Charles Whitman’s\nshooting spree at the Unversity of Texas — I post a link to the best story I ever edited:@pamelacolloff’s “96 Minutes.” It’s still the best read, and Pam is still and always thehttps://texasmonthly.com/true-crime/96-minutes/…#txlege", "INBOX:@GregAbbott_TX, who took $6m from a philadelphia school choice supporter in december — the largest single campaign donation in texas history, per@PatrickSvitek— rails against the influence of “BIG MONEY out-of-state donors”#txlege"], "BarbMcQuade": ["Happy new year to our Jewish friends and neighbors. Wishing for peace.", "Great day for a Peacenic!  Food, music, games, face-painting, petting zoo, and prizes until 7 pm today at Heilmann Community Center and Park. Thank you, ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩, ⁦@FBIDetroit⁩, ⁦@USCG⁩, ⁦⁦@HSIDetroit⁩", "Had a great time at ⁦@TheCityClub⁩ in Cleveland today to commemorate Law Day. Its motto is the Citadel of Free Speech. Meetings start and end with the clanging of the gong. I was relieved that I did not hear it mid-speech! Great group of engaged and informed citizens!", "Happy Hanukkah to all of our Jewish friends and neighbors. Wishing you hope and light.", "Thanks to all the service members who serve our country. Let’s honor those who have died for democracy by working in unity to sustain it.#MemorialDay", "Great day for a Peacenic!  Food, music, games, face-painting, petting zoo, and prizes until 7 pm today at Heilmann Community Center and Park. Thank you, ⁦@USAO_MIE⁩, ⁦@detroitpolice⁩, ⁦@CityofDetroit⁩, ⁦@FBIDetroit⁩, ⁦@USCG⁩, ⁦⁦@HSIDetroit⁩", "Happy Hanukkah to all of our Jewish friends and neighbors. Wishing you hope and light.", "Wishing peace to all of our Jewish friends and neighbors. Chag sameach.#Passover2024"], "JohnArchibald": ["Pretty amazing how little we care about life in this pro-life state. Part 1.", "I wish I knew which you you are, Katie Britt.", "Some things to think about, as my state spends billions of dollars to lock people up.", "Alabama is well on its way to being a full-blown theocracy. The \"frozen embryos are children\" ruling is just another step on the path.", "I wish I knew which you you are, Katie Britt.", "Some things to think about, as my state spends billions of dollars to lock people up.", "Alabama is well on its way to being a full-blown theocracy. The \"frozen embryos are children\" ruling is just another step on the path.", "This is an amazing honor and I'm still pinching myself. Looking so forward to being a part of this board.", ".@JohnArchibaldof@aldotcom,@GinaSKChuaof@semaforand@NTretheweyof@NorthwesternUhave been elected to the#PulitzerPrize Board! Click below to read more.https://pulitzer.org/news/archibald-chua-trethewey-join-pulitzer-board…"], "natsechobbyist": ["Has anyone reached out to Abdul to get his thoughts?", "The Israeli government put out this warning as did a friend of mine inIsraelwho is a mental health professional. This is very good advice.https://x.com/travisakers/st/travisakers/status/1711872861210632483…", "\"You see, when we say 'kill all Jews' it's aspirational. We don't actually mean it...unless it's possible and then, of course, we'd be all over it.\"   \n\nWords have meaning. This mealy-mouthed bullshit excuse is pathetic. You know exactly what you are doing.", "From the river to the sea is an aspirational call for freedom, human rights, and peaceful coexistence, not death, destruction, or hate. My work and advocacy is always centered in justice and dignity for all people no matter faith or ethnicity.", "It is, quite literally, a tactic employed by the Nazis.", "Important context from someone who KNOWS:", "Over the course of my grandfather's lifetime, he gifted and \"loaned\" Donald $413 million. And Donald still declared bankruptcy 6 times. He failed so badly that the banks needed to put him on a $425,000-a-month allowance.", "On behalf of humankind, I would like to thank the Hayes family for sparing us all. Also, this is a wonderful victory for them and I am delighted on their behalf.", "You know he’s triggered when he uses Hussein! Love this journey for this sorry racist ass.", "Trump: Did you see Barack Hussein Obama last night? He was taking shots at your president. And so is Michelle. They always say, please stick to policy, don't get personal. Yet they are getting personal all night long, these people. Do I still have to stick to policy?", "The Israeli government put out this warning as did a friend of mine in Israel who is a mental health professional. This is very good advice.https://x.com/travisakers/st/travisakers/status/1711872861210632483…"], "davidhogg111": ["Go tohttp://theshotline.orgto call your representative using a voice of a victim of gun violence to demand action on gun violence. All you need to do is put in your zip code and hit call. Already today over 5,000 calls have been made.", "Gov./CSM (Ret.) Walz is stating facts. If you take issue with this then maybe you should ask yourself why a fmr President who did nothing for 4 hours while the Capitol building was under siege by his own supporters should be reelected?", "Before door knocking this morning I stopped by the 16th st Baptist church in Birmingham today. This church was bombed by the KKK on September 15th 1963 killing Addie Mae Collins (14), Cynthia Wesley (14), Carole Robertson (14), and Carol Denise McNair (11)\n\nWhile much progress", "One thing people don’t talk about much when it comes to gun violence is how many shootings there are every day that happen but don’t make the news because no one is hit. There was a drive by shooting 200 ft from my place in DC last night but it won’t make the news because no one", "I’m in Blacksburg VA turning out young voters. But before I got to work this morning I visited the memorial for the 32 victims of the Virginia tech shooting. There were so many names it took nearly a full minute to walk past all of them. They include:\n•Ross A. Alameddine", "Gov./CSM (Ret.) Walz is stating facts. If you take issue with this then maybe you should ask yourself why a fmr President who did nothing for 4 hours while the Capitol building was under siege by his own supporters should be reelected?", "If you keep talking about the assassination attempt don’t you dare tell the kids who survive school shootings and their families to “just get over it”\n\nWhat happened today is unacceptable and what happens every day to kids who aren’t the president and don’t survive isn’t either.", "I can not overstate how fucking important this is", "If the VP is someone to the right of Vice President Harris we will lose all the momentum we have gained with the youth vote."], "anthonyzenkus": ["Israelhas resumed its genocidal attacks on the people ofGaza. Children are suffering the most asIsrael's forces bomb close to the largest functioning hospital left standing inGaza. Biden is complicit. It is time to#StopArmingIsrael. \n\n(report from UN - UNICEF spokesperson)", "Israelis increasing its attacks in theWestBank, an area not run by Hamas. TheWestBankhas no army and their citizens are defenseless. People are being forcibly removed from their homes, terrorized, arrested and shot. Bombs and bullets supplied by Kamala Harris and Joe Biden.", "After bombing the#JabaliaRefugee Camp yesterday killing hundreds,Israelbombed it again today as rescue workers tried to save those still alive buried in the rubble. The US is complicit in war crimes. It's time to force a#ceasefireNOW- Biden and Blinken must step down.", "LatestGazaCasualty Numbers\nTotal dead: 24,285\nTotal wounded: Over 60 000\nTotal killed, injured or missing: 1/20 PalestiniansGazagenocide: brought to you byIsrael, sponsored by Joe Biden and the US War machine", "UN expert: \"Gaza is complete and utter carnage\". He said it's the worst thing he's ever seen. Israel is perpetrating the worst humanitarian crisis in modern times, aided and abetted by Joe Biden and the US government. No, a \"pause\" is not enough. We need a full#CeasefireNOW.", "It's been 202 days since 6 year old Hind Rajab was murdered by Israeli forces firing 335 rounds into her family's car in Gaza City as she cowered on the phone with emergency services waiting for an ambulance that never came, surrounded by the bodies of her 6 dead relatives. \n\nHer", "Israel has resumed its genocidal attacks on the people of Gaza. Children are suffering the most as Israel's forces bomb close to the largest functioning hospital left standing in Gaza. Biden is complicit. It is time to#StopArmingIsrael. \n\n(report from UN - UNICEF spokesperson)", "\"Our focus is on damage, not on precision\" - IDF Spokesperson\n\n\"We will eliminate everything. They will regret it\". - Israeli Defense Minister ToavGallant\"We are now rolling out the Gaza Nakba\". - Israeli Minister of Agriculture\n\nCollectjve punishment is a war crime."], "benshapiro": ["No shit. That's what happens when Hamas rejects the ceasefire offer and asks Hezbollah to go hot.", "Politico : Senior US officials say the ceasefire deal is on the verge of collapse.", "Agreed. This is precisely why Palestinian civilians inGazashould listen toIsrael's warnings and leave target areas -- and it is also precisely why Hamas is telling them not to do so.", "protect civilians. \n\ndoesn’t matter who they are \nor where they are. \n\nwhen we fail them\nwe fail ourselves.", "Remember, the obstacle to peace in theMiddleEastis very simple: Palestinian rejection ofIsrael, and heartfelt support for murderous terrorism. The supposedly \"moderate\" Palestinian Authority has now formed a unity government with HAMAS.", "Well,Israeldid try simply handing over theGazaStrip to Palestinians in 2005, and Palestinians elected Hamas, who promptly turnedGazainto the largest terror base in the world. What are your alternatives, precisely?", "Benjamin Netanyahu, Israel’s right-wing prime minister, said yesterday that Israel would oversee Gaza’s security for “an indefinite period” after the war. Really? Should US funds support a long-term military occupation over an already battered & impoverished people? I think not.", "They said this BEFORE Israel tookRafah. They said this BEFORE Israel took the Philadelphia Corridor. They said this BEFORE Israel killedDeif,Haniyeh, and Shukr. So I'd take their military opinions with a Dead Sea-worth of salt.", "Hamasdoes not have the capacity anymore for serious offensive action. But they've roped Iran and Hezbollah into sympathy action that neither Iran nor Hezbollah can afford. Iran and Hezbollah are desperately attempting to get to aceasefireofframp so they can claim that they", "#BREAKINGHamas claims to have fired two rockets at Tel Aviv.  Residents report hearing explosions.", "Remember, the obstacle to peace in the Middle East is very simple: Palestinian rejection of Israel, and heartfelt support for murderous terrorism. The supposedly \"moderate\" Palestinian Authority has now formed a unity government withHAMAS.", "All who are now proclaiming that because Israel was able to obtain the release of 50 hostages at the cost of 150 terrorists, \"de-escalation\" is now possible -- you're out of your minds. Israel will not stop untilHamasis destroyed. That is Israel's political and moral duty."], "briebriejoy": ["This Week in Hasbara (w/@AbbyMartin)\"We can't forget that the Jerusalem Post run by@AviMayer, who's essentially a stenographer for theIDFhe's essentially a military propagandist running one of the biggest newspapers inIsrael. They had the audacity to try to discredit &", "VIDEO PREMIERE:https://youtube.com/watch?v=_biSwyKSNOQ…\"When [Israel] did this whole 'hunt for Hamas' thing, while they were attacking hospitals, it was like: well, they're just attacking the hospital because they said they were going to do that. They called them the day before....Sort of", "\"What Hamas did was horrific, and they should answer for that. Now, at the same time, targeting innocent Palestinian citizens for something Hamas did is wrong. It is wrong. Turning off their electricity, taking away their water. 50% of people who live inGazaare 15 years and", "Axis of Resistance (w/ Rami Khouri)\"These are not just bands of wild men with long hair & knives & their teeth who came out of the caves and suddenly took over the government. These are people who emerged organically, from within the the the innards of the society. They", "\"The claim was that 0.002% of UNWRA had been involved in [October 7th]. So they defunded it. Now, more than 0.02% of the IDF has been committing war crimes way more than that. So, of course, if there were any consistency, they'd do something to the IDF. They'd defund the IDF.", "\"The court said this must happen: 'You, Israel must stop your offensive inRafahperiod.' It has nothing to do withHamasis doing, it has nothing to do with anybody else is doing. It has nothing to do with what Israel says or doesn't say anything the court made an or the UN", "VIDEO PREMIERE:https://youtube.com/watch?v=_biSwyKSNOQ…\"When [Israel] did this whole 'hunt forHamas' thing, while they were attacking hospitals, it was like: well, they're just attacking the hospital because they said they were going to do that. They called them the day before....Sort of", "TheCeasefireShell Game (w/@samhusseini)Independent journalist Sam Husseini completely dismantles the state department narrative around theceasefirenegotiations, who’s at fault, & what the new UN report tells us about Israel’s use of rape, torture, & the Hannibal"], "fred_guttenberg": ["(1,3) To those who take the time to send me emails like this, there was a ceasefire until October 7th, when a terror group who also happened to be the governing entity ofGazabrutally attackedIsraelkilling over 1400, raping women, burning babies and wearing go pros to extend", "What happened to all of the discussion of the hospital thatIsraelentered this week?  Now that they found & presented all of the evidence that Hamas was using it for terror, is the conversation just going to stop?  Perhaps time to acknowledgeIsraelwas right.  Let's end terror.", "The Hamas terrorists chose to terrorize and kill.  They chose to useGaza.  They chose to hide out amongst the citizens and public places.Israelis doing everything that they can to avoid civilians, but they will be eliminating Hamas fromGaza.  Direct your anger now at Hamas.", "Reporting is thatIsraelagreed to a truce last night but just wants a list of living hostages.. which Hamas won't provide to go to Cairo to ink the deal.  Based on this reporting, Hamas is blocking ceasefire & truce, notIsrael.", "Please be vigilant.Hamasis a terrorist group targeting all Jewish people.  Israel will finish them and Israel needs our support, but today is a day of caution for all Jewish people in the United States.", "(1,3) To those who take the time to send me emails like this, there was aceasefireuntil October 7th, when a terror group who also happened to be the governing entity of Gaza brutally attacked Israel killing over 1400, raping women, burning babies and wearing go pros to extend", "TheHamasterrorists chose to terrorize and kill.  They chose to use Gaza.  They chose to hide out amongst the citizens and public places.  Israel is doing everything that they can to avoid civilians, but they will be eliminatingHamasfrom Gaza.  Direct your anger now atHamas.", "Reporting is that Israel agreed to a truce last night but just wants a list of living hostages.. whichHamaswon't provide to go to Cairo to ink the deal.  Based on this reporting,Hamasis blockingceasefire& truce, not Israel."], "LeeCamp": ["The debate over what is happening inGazaright now is not a real debate.Israelhas ADMITTED to a long list of atrocities & crimes. Here are some of them:", "BREAKING — Today saw protests in Washington DC, NYC, Tokyo, Rochester, Pittsburgh, Havana, Cuba & many other cities around the world demanding an end toIsrael's war / conflict / genocide / ethnic cleansing — Whatever you want to call it.", "BREAKING: The number of murdered & missing people inGazanow tops 37,000.\n70% are women & children.\nYetIsraelcontinues it's genocidal attack.", "BREAKING: TheIDFopened fire on innocent people in line for humanitarian aid trucks inGazaCity. They killed at least 100 in just the latest massacre.", "BREAKING: The number of murdered & missing people in Gaza now tops 37,000.\n70% are women & children.\nYet Israel continues it's genocidal attack.", "The debate over what is happening in Gaza right now is not a real debate. Israel has ADMITTED to a long list of atrocities & crimes. Here are some of them:", "BREAKING: The IDF opened fire on innocent people in line for humanitarian aid trucks in Gaza City. They killed at least 100 in just the latestmassacre.", "BREAKING: Officials say famine & dehydration could kill thousands in Gaza in the coming days. (Al Jazeera)\nThis is why Israel has done everything they can do destroy aid efforts."], "JordanChariton": ["UNREAL: Head of the Democratic Majority forIsraelSuper PAC—who spent millions to bring down Bernie Sanders, Nina Turner, etc—says young voters are fleeing Biden and protesting for Palestine because they have an \"unfamiliarity with the Holocaust.\" \n\nIt's actually the opposite.", "My take on corporate media's \"anti-semitic\" propaganda on Columbia'sGazastudent protests: I've covered protests across America: BLM, anti-pipeline, climate, healthcare, etc. ALL had elements of individuals out of synch w/ the overall message & sentiment of the protest...", "Contamination inEastPalestine. “It pisses me off” -Jenna told me when I asked about EPA saying everything is fine here. “They’re lying.” For 8 years, I have repeatedly said that the reason I have continued covering the ONGOING#FlintWaterCrisis—which tomorrow marks 10 years…", "Is because if the government and Wall Street get away with their crimes in Flint, THEY WILL USE THE SAME\nPLAYBOOK ELSEWHERE. Well, they are…inEastPalestine and many other sacrifice zones that the media ignores as they cover Trump’s porn star payoffs 24/7 and the political…", "I know there’s a lot going on, but I want to remind folks what the govt & media are covering up—the latest sacrifice zone. Jenna is an 18 year old East Palestine OH resident. Before Norfolk Southern unnecessarily detonated toxic cancerous chemicals over EP, she was healthy….", "The Yes Queen Dem sycophants will love this. But anyone who cares about an ongoinggenocideshould be disgusted by this.", "Pro-Palestine protesters just disrupted Kamala's speech in Michigan.\n\nHer response: \"If you want Donald Trump to win say that. Otherwise, I’m speaking.”", "Is because if the government and Wall Street get away with their crimes in Flint, THEY WILL USE THE SAME\nPLAYBOOK ELSEWHERE. Well, they are…in East Palestine and many other sacrifice zones that the media ignores as they cover Trump’s porn star payoffs 24/7 and the political…", "Contamination in East Palestine. “It pisses me off” -Jenna told me when I asked about EPA saying everything is fine here. “They’re lying.” For 8 years, I have repeatedly said that the reason I have continued covering the ONGOING#FlintWaterCrisis—which tomorrow marks 10 years…"], "kylegriffin1": ["The U.K. government has reversed its opposition to the International Criminal Court seeking an arrest warrant against Israeli PM Benjamin Netanyahu.", "Trump ranted last night about Gov. Josh Shapiro — calling him \"the highly overrated Jewish Governor\" and claiming he has done \"nothing forIsrael.\"\n\nIn response, White House spokesman Herbie Ziskend says: \"It is Antisemitic, dangerous, and hurtful to attack a fellow American by", "BREAKING. Vice President Harris onIsrael-Gaza:\n\n\"Israelhas a right to defend itself, and how it does so matters.\"\n\n\"The images of dead children and desperate, hungry people fleeing for safety, sometimes displaced for the second, third or fourth time — we cannot look away in the", "Breaking:\n\nWASHINGTON (AP) — Biden says 'I'm not supplying the weapons' ifIsraellaunches assault onGaza's Rafah, after US paused bomb shipment.", "Vice President Harris: \"President Biden and I are working to end this war such that Israel is secure, the hostages are released, the suffering in Gaza ends, and the Palestinian people can realize their right to dignity. Security. Freedom. And self-determination.\"", "TEL AVIV, Israel (AP) - Israel's military says Hezbollah leader Hassan Nasrallah was killed in Beirut strike.", "The United Center breaks out in chants of 'Bring Them Home' as the parents of Hersh Goldberg-Polin, an American hostage held byHamas, speak at the DNC.", "BREAKING. Vice President Harris on Israel-Gaza:\n\n\"Israel has a right to defend itself, and how it does so matters.\"\n\n\"The images of dead children and desperate, hungry people fleeing for safety, sometimes displaced for the second, third or fourth time — we cannot look away in the"], "elonmusk": ["Starlink will support connectivity to internationally recognized aid organizations inGaza. \n\n[ComStar]", "If you teach that “weak makes right”, then the perceived stronger party – in this case,Israel– is wrong.\n\nMorals should be taught in the absolute, meaning that it is possible for either the strong or weak to be morally good, depending on their actions.", "Starlink is now active in aGazahospital with the support of@UAEmediaofficeand@Israel", "Khamenei’s official position is clear that the eradication ofIsraelis the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violence and vengeance.\n\nStoking the fires of hatred isn’t", "Starlink will support connectivity to internationally recognized aid organizations in Gaza. \n\n[ComStar]", "Starlink is now active in a Gaza hospital with the support of@UAEmediaofficeand@Israel", "Ideally, no one is killed, but the level of misunderstanding about magnitude, due to relentless legacy media propaganda, is astounding!", "How bad is legacy media disinformation? \n\nIt’s so bad that a sizable chunk of liberals think the number of unarmed Black men killed by cops is in the thousands.\n\nThe true number? Closer to about ~11", "Khamenei’s official position is clear that the eradication of Israel is the actual goal, not just supporting Palestinians.\n\nThat will not happen. All that actually happens, decade after decade, is a never-ending cycle of violence and vengeance.\n\nStoking the fires of hatred isn’t"], "itsJeffTiedrich": ["I wrote a thing: \"The New York Times hits a new low in false equivalencies\" — there’s nothing the Grey Lady can’t both-sides.\nthanks for reading, and please sign up for my daily newsletter to keep getting the good stuff —https://bit.ly/3XxHbs9", "I wrote a thing: \"shove your thoughts and prayers\" — we've been thinking and praying since Columbine, and it hasn't done shit.\nthanks for reading, and please sign up for my daily newsletter so you never miss a post —https://bit.ly/3MznMk4", "Donald Trump could stand in themiddleof Fifth Avenue and shoot someone and The New York Times would explain that Trump didn't mean it", "I wrote a thing: \"Louisiana is the latest Ground Zero for christofacist fuckery\" — the zealots are just getting started.\nthanks for reading, and please sign up for my daily newsletter so you never miss a post —https://bit.ly/3xsXX1k", "I wrote a thing: \"no, you fucking ghouls, school shootings don’t have to be a ’fact of life’\" — every other country in the world thinks we’re nuts.\nthanks for reading, and please sign up for my daily newsletter to keep getting the good stuff —", "there's a reason they call Jack Smith the Man Who Convicts War Criminals in The Hague", "I wrote a thing: \"BEST OF 2023: the right-wing hate machine created a monster and handed him a weapon of mass death\" — thanks for reading, and please sign up for my daily newsletter so that you never miss a post —https://bit.ly/48pE7km", "I wrote a thing: \"four SCOTUS Justices are totally cool with mangled children in razor wire booby traps. what the fuck\" — thanks for reading, and please sign up for my daily newsletter to keep getting the good stuffhttps://bit.ly/3Of4FwO"], "bluestein": ["A large crowd gathered at Georgia Tech today to rally for Jewish students who feel threatened by recent campus demonstrations. Similar rallies are being held all over Georgia campuses now.", "Biden’s speech ends after he speaks of theIsrael-Hamas war in broad terms, saying the conflict is “heartbreaking” and that he’s working to bring it to an end. His address is well received by students, alumni and their families — who cheer as he’s given an honorary degree.", "Thousands are gathering right now in Sandy Springs, Ga. in support ofIsraelafter the Hamas terror attack over the weekend. I’ve seen more than a dozen lawmakers, city and state officials, and community leaders in the crowd. It’s one of the biggest pro-Israel rallies in the US.", "At@KLoeffler’s Greater Georgia gala,@GovKempsays he talked to the head of the public safety department last night about pro-Palestinian protesters in other cities who blocked roads and bridges. His message: If they do that here, “lock their ass up.”#gapol", "“Shawn,” the president said, “I wish I didn’t have to make this call … I know there’s nothing anybody can say or do to ease the pain. I’ve been there.”", "Biden’s speech ends after he speaks of the Israel-Hamaswar in broad terms, saying the conflict is “heartbreaking” and that he’s working to bring it to an end. His address is well received by students, alumni and their families — who cheer as he’s given an honorary degree.", "The VP briefly addressed the growing conflict in the Middle East after Israel retaliated for rocket attacks by targeting a Hezbollah commander.", "Thousands are gathering right now in Sandy Springs, Ga. in support of Israel after theHamasterror attack over the weekend. I’ve seen more than a dozen lawmakers, city and state officials, and community leaders in the crowd. It’s one of the biggest pro-Israel rallies in the US."], "SarcasmStardust": ["Let’s start a thread of all the times high level Israeli officials, affiliates, and proxies have openly called for genocide. Drop em here", "Israelwasn’t attacked.Israelisn’t real. The occupiers of Palestine were attacked.", "Israelbombed homes.Israelbombed schools.Israelbombed hospitals.Israelbombed churches.Israelbombed evacuees.Israelbombed journalists.Israelbombed UN workers.\n\nBut they want you to believeIsraelis “good” and Palestinians are “evil.”", "Israel bombed homes.\nIsrael bombed schools.\nIsrael bombed hospitals.\nIsrael bombed churches.\nIsrael bombed evacuees.\nIsrael bombed journalists.\nIsrael bombed UN workers.\n\nBut they want you to believe Israel is “good” and Palestinians are “evil.” x.com/Kahlissee/stat…", "“But more people will die”\n\nPalestinians BEEN dying. And that’s not going to stop. The fact that there are people who think they should just sit around and continue to take it blows my mind. There’s only one aggressor and occupier here. And it ain’t Palestine.", "Let’s start a thread of all the times high level Israeli officials, affiliates, and proxies have openly called forgenocide. Drop em here", "Israel has targeted and murdered over 130 journalists in the past 9 months. \n\nFuck Israel.https://x.com/Hind_Gaza/stat/Hind_Gaza/status/1818657215684735069…", "You don’t endHamasby slaughtering a bunch of innocent people. That’s how you recruit forHamas.", "“But more people will die”\n\nPalestinians BEEN dying. And that’s not going to stop. The fact that there are people who think they should just sit around and continue to take it blows my mind. There’s only one aggressor and occupier here. And it ain’t Palestine."], "SocialistMMA": ["Israelcommits crime of the century as they slaughter Palestinians in Rafah\n\nZionism is currently the most barbaric ideology in the world", "Israelannounces war crimes and atrocities are planned forGazaCritical support for the Palestinians#FreePalestine", "SHOCKING POLL: Majority of White Evangelical Christians and Jewish Americans support a ceasefireIsraelhas completely lost the propaganda war", "Violent Israeli settlers were committing so many terrorist acts on Palestinians in thewestbankthat the United States is revoking their visas \n\nEverything Zionists accuse Palestinians of is pure projection. Israeli settlers are terrorists", "Israel commits crime of the century as they slaughter Palestinians inRafahZionism is currently the most barbaric ideology in the world", "Bombshell UN report exposes how Israel uses sexual violence as a tool of war against Palestinian women and children \n\nEverything Israel accusesHamasof is pure projection. Israel are the terrorists, notHamas", "United States weapons were used during Israel’smassacreinRafahIt’s a crime against humanity that the ICC hasn’t issued an arrest warrant for Joe Biden and Antony Blinken", "Weird how the media pretendedHamastargeted civilians on Oct 7th, but now it comes out all their victims where military personnel while the IDF killed Israeli civilians"], "Josh_Moon": ["But back when we were looking for ways to lock up women for seeking abortions I was told that we can't pick and choose which laws to enforce. It sure gets confusing when we rule based on which religion is most popular. We should do something about that.", "Nothing to see here. Just the AG of Alabama offering condolences to a white guy because the state had the gall to lock him up after a jury found him guilty of killing a Black man. \n\nWhat an absolutely disgusting disregard of Black life by the state of Alabama.", "The first post was just above the second. I think I know whose judgement I trust more. What an absolute embarrassment Tuberville is - to the entire country.", "Y'all remember when people hated Michelle Obama because she wanted school lunches to be healthier? Just thought about that for no reason at all....", "....she said outside of that president's trial for paying a porn star to keep secret their 1-night stand that came weeks after the birth of his son. Thankfully this guardian of morals was there to save us from the 8 scandal-free years of a loving father/husband that was Obama", "Alina Habba, speaking on Fox News outside Trump's criminal hush money/election interference trial, claims America was on an \"upward trajectory of morals\" under President Trump. Even a Fox News host calls her out for the absurdity of this comment.", "Yes, how dare@GavinNewsommake an ad using... true stuff our AG said.", "Every single time I see Beth Holloway, I am legitimately in awe of her strength and perseverance. She chased this jackass for 18 years. Wouldn't let it die. Never stopped, even when people made fun of her. Even when she was taken advantage of. And she got him. Moms, man.", "But back when we were looking for ways to lock up women for seeking abortions I was told that we can't pick and choose which laws to enforce. It sure gets confusing when we rule based on which religion is most popular. We should do something about that."], "WarOnDumb": ["Tommy Tuberville’s anti-immigrant rhetoric has been inching toward hate speech for a while. Now he says they know nothing of God.", "Marshall’s office has ignored requests for comment. As has, Wahl. (13/15)", "I got copies of these letters through public information requests, but names have been redacted. It’s impossible (for now) for me to ask these folks if they ever heard anything back. (11/15)", "It's time to dispel any notion that Kay Ivey is a good person. Her stubbornness is suffocating rural hospitals and the communities they serve. She knows it. She doesn't care.", "Marshall’s office has ignored requests for comment. As has, Wahl. (13/15)", "Here is the answer I got from Britt’s spokesman Sean Ross. I don’t think it answers the question and, as you can see, I have asked for further clarification.", "I got copies of these letters through public information requests, but names have been redacted. It’s impossible (for now) for me to ask these folks if they ever heard anything back. (11/15)", "If ever you hear the words, “Alabama has done it and now so can you,” run.", "Steve Marshall on nitrogen gas execution: 'Alabama has done it and now so can you. And we stand ready to assist you in implementing this method in your states.'#alpoliticshttps://al.com/news/2024/01/ag-steve-marshall-expects-other-states-to-follow-alabamas-textbook-nitrogen-execution.html…", "An innocent man, Toforest Johnson, is on Alabama’s death row. Former GOP and Dem Alabama officials have called for him to be set free. Steve Marshall has fought in court to kill him anyway. Instead, he defends Trump.", "Britt won’t answer the same question from the NYTimes, either.", "Tommy Tuberville asked for this. Now he's getting it. Good for the Republican Senators joining with Democrats to finally give him what he's wanted. Make him eat it.", "By all accounts, Imane Khelif was born female and is not trans.", "Take a good look at this photo. Watch Angela Carini’s interviews.\n\nThis type of heartbreak for female athletes—this unfairness, this risk of injury—is exactly what the Biden-Harris attacks on Title IX would cause across American high schools, colleges, and universities. x.com/Riley_Gaines_/…"], "toddcstacy": ["Prattville vs Enterprise in the first round of the playoffs.#alpolitics", "Prattville vs Enterprise in the first round of the playoffs.#alpolitics"], "maryltrump": ["NEW: Donald reversed his stance on Qatar the SAME month they bought a $6.5 million apartment at Trump World Tower. \n\n2017: Qatar is a “funder of terrorism.”\n\n2018: Qatar is a partner in “stopping the funding of terrorism.”\n\nFor the rest of this story, link in bio.", "Bone-chilling! In this interview with historian Ruth Ben-Ghiat Ruth,  preeminent expert on fascism, she has a grave warning about new “Christo-fascist”Speaker Mike Johnson.\n\nDon’t miss it! Link for the entire video below!", "Tommy Tuberville is Hamas’ favorite Senator.", "This fucking maniac likely gave Putin (who gave Iran, who gave Hamas)Israel's national security secrets…\n\nPlus, he divulged highly classified information about our nuclear subs to an Australian cardboard guy. \n\nWhy is he still allowed to roam free?", "NEW: Donald reversed his stance on Qatar the SAME month they bought a $6.5 million apartment at Trump World Tower. \n\n2017: Qatar is a “funder of terrorism.”\n\n2018: Qatar is a partner in “stopping the funding of terrorism.”\n\nFor the rest of this story, link in bio.", "Bone-chilling! In this interview with historian Ruth Ben-Ghiat Ruth,  preeminent expert on fascism, she has a grave warning about new “Christo-fascist”Speaker Mike Johnson.\n\nDon’t miss it! Link for the entire video below!", "Tommy Tuberville isHamas’ favorite Senator.", "This fucking maniac likely gave Putin (who gave Iran, who gaveHamas) Israel's national security secrets…\n\nPlus, he divulged highly classified information about our nuclear subs to an Australian cardboard guy. \n\nWhy is he still allowed to roam free?"], "JoJoFromJerz": ["This week’s guest is@JoelMartinRubin(please follow him).\nHis insights on the horrific Hamas attack come not only from his professional background, but also from a deeply personal connection toIsraelas well.\nI am so grateful to him for this important conversation.", "Per CNN: “An initial group of 13 hostages have been released, the Israeli prime minister's office says, as a truce betweenIsraeland Hamas — the first in weeks of fighting — appears to be holding.”", "Hamas has committed atrocities inIsrael. The human cost of their barbarousness is catastrophic.\nWe should have solidarity in our unwavering support for the innocent victims of this violence. But what have Republicans done since day one instead?\nThey’ve used the acute suffering", "We aren’t going to forget in November who it is that ran on aMuslimban and who it is that is promising mass deportations and who it is that will handGazaand theWestBankto Netanyahu on a silver fucking platter.\nUnlike@RashidaTlaib, we Arabs aren’t going to forget, are we?", "How many so-called “reasonable” Republicans will stand up and denounce Donald Trump for blamingNetanyahufor the horrificHamasattack?", "This week’s guest is@JoelMartinRubin(please follow him).\nHis insights on the horrificHamasattack come not only from his professional background, but also from a deeply personal connection to Israel as well.\nI am so grateful to him for this important conversation.", "Breaking: the second group ofHamashostages has been released to the Red Cross.", "Per CNN: “An initial group of 13 hostages have been released, the Israeli prime minister's office says, as a truce between Israel andHamas— the first in weeks of fighting — appears to be holding.”"], "DineshDSouza": ["This attack onIsraelis brought to you by Iran, courtesy of its US enablers: Barack Obama, Joe Biden and Kamala Harris", "It may seem odd for me to say that some of the horrific images of civilian suffering inGazaare the product of local cosmetic art, not Israeli aggression. See for yourself!", "I make the case for the Jewish people possessing the land ofIsraelfrom their long and consistent presence in the region.", "While many secular Jews on the Left are now denouncing pro-Palestine protests around America, many of these same figures helped to further the cause by coopting radical “resistance” ideologies.", "This attack on Israel is brought to you by Iran, courtesy of its US enablers: Barack Obama, Joe Biden and Kamala Harris", "Here’s how the Biden Administration’s negligence helped to enable the attack on Israel.", "It may seem odd for me to say that some of the horrific images of civilian suffering in Gaza  are the product of local cosmetic art, not Israeli aggression. See for yourself!", "Human rights attorney@GoldsteinBrookediscusses the situation on the ground in Israel in light of the recent attacks."], "dbongino": [], "TheLeoTerrell": ["Biden Has Given These Terrorists the Green Light to Attack, Harm, and Denied Jewish Americans to Exist in This Country", "GO TO HELL!\nU.N. Court OrdersIsraelto Halt Some Military Operations in Rafah - The Wall Street Journal", "JUST IN:IsraelWarns UN to Evacuate the NorthernGazaStrip Within 24 Hourshttps://leoterrell.com/just-in-israel-warns-un-to-evacuate-the-northern-gaza-strip-within-24-hours/?utm_source=mux&utm_medium=social&utm_campaign=tw…", "The \"Squad\" is demanding a cease fire inGaza! My response: HELL NO! ELIMINATE HAMAS!", "HamasLeader IsmailHaniyehKilled After Residence Hit in Tehran", "GO TO HELL!\nU.N. Court Orders Israel to Halt Some Military Operations inRafah- The Wall Street Journal", "Why would anyone Trust#Hamas? Stupid! Harris Calls for Gaza Cease-Fire as She UrgesHamasto Accept Deal - The Wall Street Journal", "Israel Defense Forces hit over 320Hamasmilitary targets in air strikes, kills five key commanders"], "donaldjtrumpjr": ["FULL STORY: Walz administration awarded $2 million toMuslimgroup fundraising for al Qaeda-linked charity", "I think these people should go toIsraeland negotiate with Palestinian and Hamas leadership. I’m sure they’ll be taken seriously and not thrown off of the rooftops!", "This is from the US Embassy inIsraelurgingIsraelto not retaliate under unprecedented circumstances… a literal  attack on their very existence. It’s absolutely unbelievable. Like so many examples here in the United States. The left thinks you should be OK with your own demise", "While Donald Trump immediately stood with the patriots ofEastPalestine, Joe Biden was no where to be found when they needed him the most. He refused to step foot inEastPalestine for an entire year, but now since its election time, he's showing up for a photo op.\n\nPathetic!", "While Donald Trump immediately stood with the patriots of East Palestine, Joe Biden was no where to be found when they needed him the most. He refused to step foot in East Palestine for an entire year, but now since its election time, he's showing up for a photo op.\n\nPathetic!", "This is from the US Embassy in Israel urging Israel to not retaliate under unprecedented circumstances… a literal  attack on their very existence. It’s absolutely unbelievable. Like so many examples here in the United States. The left thinks you should be OK with your own demise", "Pretty amazing that the entire establishment media had people embedded withHamaswhile they did the terrorist attack on 10/7. Are we still pretending they’re not the enemy of the people? Truly sick people!", "Shocked that even MSDNC realized that it probably wasn’t a great idea to have ProHamaspropagandists on air for hours a week."], "diamondandsilk": ["OMG...  Mother of J6 Political Hostage, Daniel Ball who was beaten, 4 teeth  knocked out by guards and then threatened with rape by the guard that beat him and Wife of abused and threatened J6 Political Hostage Michael Perkins tells Silk their disturbing story.#DiamondandSilk", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "Mother of J6 Political Hostage, Daniel Ball who was beaten, 4  teeth  knocked out by guards and then threatened with rape by the guard that beat him and Wife of abused and threatened J6 Political Hostage  Michael Perkins tells Silk their disturbing story.#DiamondandSilk", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "Who Will Stand Against the Present Tyranny that Now Threatens All of the Lives of Those who Oppose the Corrupt Biden/Harris Weaponized Regime?#diamondandsilk#hurricanehelenevictims", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod", "All the forces of darkness cannot stop what God has ordained. (Isaiah 14:27) The devil meant it for evil but God turned it around for our good.#TrustGod"], "spiritofho": ["Zionists gathering on the National Mall chanted “no ceasefire” over Van Jones as he urged the crowd to “take a stand againstMuslim.”", "Israelis already sniping at civilians attempting to go home during the temporary ceasefire.\n\nThis terrorist regime has run out of masks to take off.", "Israelhas displaced over a MILLION Palestinians from their homes as they bomb everything that moves.\n\nThe second Nakba isn’t coming. It’s happening NOW.", "This is Jabalia refugee camp afterIsraelbombed it for two consecutive days. \n\nMore than 50 were killed, hundreds injured.\n\nThere is no time to mince words. This is a holocaust and a genocide.Israelmust be punished accordingly.", "This is what Israel's \"war\" is doing inRafah.\n\nThis is not \"victory.\" It's a project of genocidal desperation aided and abetted by the U.S. and its European vassals.", "Israelhas killed 2,000 children in Gaza.\n\nIsraelhas destroyed hospitals and schools.\n\nIsraelhas killed UN workers and journalists.\n\nIsraelis threatening an invasion that would spark a regional war.\n\nBut sure, tell us again how Chinais the greater threat.", "Israel waited for the Super Bowl to intensify itsgenocideby bombingRafah, the most crowded village in Gaza precisely because Israel has spent 4 months razing the rest of Gaza.\n\nThis has to stop.", "Israelis already sniping at civilians attempting to go home during the temporaryceasefire.\n\nThis terrorist regime has run out of masks to take off."], "MollyJongFast": ["It was supposed to be an event on fighting antisemitism, but like so many things in Trumpworld, it quickly turned into Donald Trump just engaging inantisemitism.", "As aJew, I know that othering against one group leads to othering the rest of us", "As ajew, I have a sacred duty to support the candidate who believes in democracy and the rule of law, and not the candidate who was the driving force behind January 6.", "Adelson: Jews have a \"sacred duty\" to vote for Trump.\n\nLet that sink in.\n\nTrump: Jews \"would have a lot to do with the loss\" if Harris wins.\n\nLet that sink in.\n\nThis is not normal. Don't let anyone tell you either of these things are OK to say.@birenbombwas there. x.com/TheNVIndy/stat…", "Curious how the “free speech absolutists” defend this", "Trump says Americans who criticize the Supreme Court for overturning Roe v. Wade should be imprisoned: “These people should be put in jail for the way they talk about our judges and justices”", "I wrote about how Harris flipped the script", "Something worse than what we already know?", "This is a must read from@ruthbenghiat@TimothyDSnyderand rachel kleinfeld and Steven Levitskyhttps://supremecourt.gov/DocketPDF/23/23-719/299402/20240131142658027_2024.01.31%20Final%20Brief%20of%20Democracy%20Experts.pdf…", ".@LinseyDavis&@DavidMuirhave done an excellent job. Asking detailed questions. Pushing for answers. Keeping everyone calm."], "FiorellaIsabelM": ["Israelhas been shooting at civilians, trying to reach food dropped off by air inGaza.  The fact is nothing has been done and the weak, cowardly words from international organizations are not anything more than empty virtue signals.Israelis killing with impunity. \n\nHere is", "Israelstruck various neighborhoods inGazain themiddleof the dark last night, during a full internet & communications blackout. According to a doctor inGaza's Al Shifa Hospital, at least 500 civilians, including women & children, were murdered by Israeli missiles.", "Israelis deliberately, undeniably targeting hospitals where injured & civilians go for safety.  Just now more Israeli strikes in front of the Al Quds Hospital inGaza, leaving several dead. Israeli jets also targeted the Al Shifa and Indonesian hospitals simultaneously.", "As the temporary pauses begins dozens of Palestinians return to the homes they were forced to leave. Trucks carrying aid & fuel enter theGazaStrip, this after weeks of incessant carpet bombing byIsrael. \n\nIsraeli forces have been deploying tear gas & firing shots in many", "WARNING Horrific images of Israel’smassacreofRafah, where they charred thousands of displaced people with 8 missiles, targeting the vicinity of UNRWA agency headquarters. A child's head & legs were decapitated, families wiped out; women, children, & elderly burned to death.", "Since October 7th, Israel’s dropped 18,000 tons of bombs on Gaza, 1.5 times the force dropped on Hiroshima. \n\nThis is a global, unforgivable massgenocidewar crime.", "Israel has been shooting at civilians, trying to reach food dropped off by air in Gaza.  The fact is nothing has been done and the weak, cowardly words from international organizations are not anything more than empty virtue signals. Israel is killing with impunity. \n\nHere is", "Israel struck various neighborhoods in Gaza in the middle of the dark last night, during a full internet & communications blackout. According to a doctor in Gaza's Al Shifa Hospital, at least 500 civilians, including women & children, were murdered by Israeli missiles."], "aaronjmate": ["Israel’s mass murder campaign inGazashattered what the Wall Street Journal described in October as “an undeclared truce between Tehran and Washington.”\n\nFor more than six months before Oct. 7th, the Journal noted, “Iranian-backed militia groups refrained from launching drones", "One day after it whitewashed the Palestinian death toll, NYT now describes an Israeli attempt to raze Palestinian homes and make their area unlivable as an attempt to \"help create a buffer zone.\"  Nazi propagandists would be impressed.", "In 2018, Henry Siegman, former head of the American Jewish Congress and the Synagogue Council of America, wrote this aboutIsrael's claim of \"self-defense\" inGazaand theWestBank:\n\n\"InGaza, as in theWestBankbeyond the pre-1967 armistice line,Israelis acting not in", "This headline -- erasing the \"cost\" of 23,000+ Palestinians killed by the invading Israeli army, plus many more wounded, maimed, and displaced -- only underscores that the NYT should change its name to the Nazi Yisrael Times:", "The Israeli outlet Haaretz has confirmed what independent journalists@AliAbunimah@davidsheen@MaxBlumenthalreported from the start: Israel invoked the Hannibal Directive and slaughtered its own people on Oct. 7th to prevent them from being taken captive. \n\nFormer IDF", "Israel’s mass murder campaign in Gaza shattered what the Wall Street Journal described in October as “an undeclared truce between Tehran and Washington.”\n\nFor more than six months before Oct. 7th, the Journal noted, “Iranian-backed militia groups refrained from launching drones", "Rather than use vital US leverage to stop Israel's assault on Gaza, Joe Biden fuels the carnage.\n\nIn May 2021, according to an insider account, Biden's orders forcedNetanyahuto stop a deadly assault on Gaza.Netanyahu“kept begging for time” but “struggled to justify his", "This headline -- erasing the \"cost\" of 23,000+ Palestinians killed by the invading Israeli army, plus many more wounded, maimed, and displaced -- only underscores that the NYT should change its name to the Nazi Yisrael Times:"]}